{
    "videoId": "P8ObEpadycI",
    "totalComments": 101,
    "comments": [
        {
            "author": "@Randomstuff12439",
            "text": "As an Everton fan hearing about this hurts"
        },
        {
            "author": "@shreemurugaraman8751",
            "text": "Moved money between his coat pockets and saved thr club 😅😂😂"
        },
        {
            "author": "@KIRO_YT.",
            "text": "he is a successful unsuccessful businessman"
        },
        {
            "author": "@mikepolantis8472",
            "text": "Surely, there are tax implications to this move, but perhaps it was worth it."
        },
        {
            "author": "@segunarosanyin1896",
            "text": "It ain&#39;t devious if it&#39;s allowed by the rules. The League should make ironclad rules to stop Loopholes FC"
        },
        {
            "author": "@gourami7",
            "text": "Complete bs rule to excuse punishment <br><br>All at war at ownership level, looks like this years soap opera"
        },
        {
            "author": "@John...44...",
            "text": "Does this mean they can no longer count the hotels profits in CFC accounts??"
        },
        {
            "author": "@Rio_Editzs",
            "text": "man city take notes"
        },
        {
            "author": "@julianhay584",
            "text": "This just shows that ffp has no real meaning in football. The epl has its favourites"
        },
        {
            "author": "@antheadavison6494",
            "text": "Should be illegal..just corrupt! How can you sell something to yourself and get away with it!"
        },
        {
            "author": "@lewislight7394",
            "text": "Ok my friend u sound like u grew up to cricket not footy talking the premier league like ur English and grew up to it 😅😅😅😅😅😅😅"
        },
        {
            "author": "@Cityforlife356",
            "text": "Lmao i love the bias if city does something like this u guys would say were ruining football and were run by momey but chelsea do it its funny and pure genius"
        },
        {
            "author": "@robertnegron9706",
            "text": "Sleight of hand 🤚 trick"
        },
        {
            "author": "@dabumenon2358",
            "text": "Bro is Mourinho fan and also a very intelligent Businessman."
        },
        {
            "author": "@Aazammm",
            "text": "Chelsea is the real oil money no history club"
        },
        {
            "author": "@jteigen11",
            "text": "so this is why chelsea didnt want to qualify to the champions league"
        },
        {
            "author": "@pandadoubl3561",
            "text": "This guy is a true buisnessman 😂"
        },
        {
            "author": "@_slimexd_1079",
            "text": "Most devious one? They sold the woman’s team TO THEMSELVES 😭"
        },
        {
            "author": "@tankz613",
            "text": "Premier League sees Man City and Chelsea making a mockery of FFP, and decide to punish Everton. Wrong blue team, but they’ve got the spirit"
        },
        {
            "author": "@seyioluwadayomi4265",
            "text": "Can&#39;t u see that ur music is too loud? U be MuMu 😮"
        },
        {
            "author": "@orangejackcaroline1808",
            "text": "City gotta take notes&#39;"
        },
        {
            "author": "@youngtuggaaa6424",
            "text": "Nah chelsea on some vile shit 😂"
        },
        {
            "author": "@tzshzr",
            "text": "MFs will do anything except playing good"
        },
        {
            "author": "@tyreesenelson5968",
            "text": "Bros playing monopoly"
        },
        {
            "author": "@onlyfacts3178",
            "text": "thats basically corruption..."
        },
        {
            "author": "@hamidmalik7754",
            "text": "It&#39;s a financing transaction, wont be accounted for as a sale, instead would be as loan only interest income over the period would be allowed"
        },
        {
            "author": "@whackeryounis",
            "text": "I wouldn&#39;t say they just saved Chelsea. That implies they did it being unsure of the outcome. They very well knew how it would go down. They got the hotels independently valuated multiple times so knew there wouldn&#39;t be an issue regarding that. The only thing that stopped it from being approved sooner was knowing the other clubs would have to vote on it and even that had an obvious outcome as why would other clubs vote against something they could exploit in the future? <br><br>It&#39;s like knowing you passed your exams before being given your results. Never in question as all the hard work and prep was done before"
        },
        {
            "author": "@jdjphotographynl",
            "text": "So what will Chelsea sell next now that they will almost certainly head towards another loss making season this year? 😬"
        },
        {
            "author": "@enlightenthyself",
            "text": "So money laundering"
        },
        {
            "author": "@samirsaha2067",
            "text": "That is a stupid rule"
        },
        {
            "author": "@HenneDS03",
            "text": "I feel like this is 100% fair since the income no longer benefits the club and the club has spent money on it in the past, however if it isnt, it Should only be allowed if it is for a fair price"
        },
        {
            "author": "@destinyobamwonyi",
            "text": "For those confused, read about corporate legal peraonality."
        },
        {
            "author": "@muhammadryanelyeddari8631",
            "text": "Chelsea is an actual Football Manager save. Only buying players under 23, selling all the old players to Saudi, making loan farms and even abusing bugs."
        },
        {
            "author": "@paulodesousa9210",
            "text": "This is a bad move for the club because when he decides to leave, those hotels aren&#39;t coming back. Plus he probably sold himself the hotels on the cheap. Next season the same thing will happen and he&#39;ll sell Stamford bridge to himself 😂"
        },
        {
            "author": "@user-op6kt8pg9y",
            "text": "The premier league is the most plastic league"
        },
        {
            "author": "@joshualiley",
            "text": "❌️ Not spending £100s of millions on useless reserve players<br>✅️ Selling hotels to yourself as a 1-off payment that will save you for exactly 1 season"
        },
        {
            "author": "@dragonmark9092",
            "text": "How is this shit allowed"
        },
        {
            "author": "@Aran-_-",
            "text": "The mid table mandem are smart ngl"
        },
        {
            "author": "@dimitrisefstathiadis6562",
            "text": "It’s ridiculous! How can we allow this? He just saying I can cheat however I want"
        },
        {
            "author": "@brianmendoza9095",
            "text": "Chelsea is going to be the next Barca with all this wreckless spending"
        },
        {
            "author": "@LSpectral",
            "text": "City as the premier favorites not getting relegated for their 115 charges:"
        },
        {
            "author": "@dkwho6614",
            "text": "City:Oil money cheats <br>Chelsea: Genius buisnessman!!!"
        },
        {
            "author": "@Insomnia74",
            "text": "As good as it is. I am worried about next season then."
        },
        {
            "author": "@tanumoydas1782",
            "text": "&amp; that&#39;s how all the big teams, like Chelsea, City, Madrid, Barca are ruining football... for atleast a decade now... With shady business, &amp; corruption, &amp; using loopholes ignored by UEFA, &amp; FIFA,..."
        },
        {
            "author": "@holdencross5904",
            "text": "This is dumb."
        },
        {
            "author": "@kunjpatel9570",
            "text": "When city do this they cry about it ,but todd is a genius 😂"
        },
        {
            "author": "@saulgoodman9188",
            "text": "And they&#39;re still a fraud of a team 😂😂😂"
        },
        {
            "author": "@lilcutzzz",
            "text": "Chelsea and Boherly are literally just money laundering."
        },
        {
            "author": "@janetyeboah5565",
            "text": "Now deduct 10 points from Everton"
        },
        {
            "author": "@gamingkami9148",
            "text": "two hotels they sold to thjemselves, cheating scum bags. Its amazing how many clubs manage to dodge points deductions but my club get <b>**</b> in the arse."
        },
        {
            "author": "@IShowSlow420",
            "text": "It’s not even crazy anymore, hats off to Boehly for escaping more ffp charges than city"
        },
        {
            "author": "@jaymz6473",
            "text": "That feeling when the new owners are more dodgy than a Russian oil tycoon. 😅"
        },
        {
            "author": "@aaryashinde6062",
            "text": "Barca on the other hand cant register players 😂"
        },
        {
            "author": "@Traylbl43er007",
            "text": "He&#39;s smart at something atleast 😂"
        },
        {
            "author": "@Haw2stuff",
            "text": "So meaning even if another buyer wants Chelsea, they cant have rhe hotels 🤔 what if that&#39;s his plan... Using Chelsea to build his personal portfolio since he&#39;s not the sole owner of Chelsea 😂"
        },
        {
            "author": "@dhoom-z7221",
            "text": "I sold from my registered company to my other company, thus I have in fact earned money. It is basically a power up of generating more cash."
        },
        {
            "author": "@mr_dauz9639",
            "text": "We are talking about USA Classic tax evasion pro here"
        },
        {
            "author": "@Footlife-0",
            "text": "Please would you make more of this video i would really appreciate it."
        },
        {
            "author": "@wowzers96",
            "text": "Boely is a successful businessman, not a Football club owner."
        },
        {
            "author": "@ObaBaller",
            "text": "I don&#39;t like Chelsea but damn!! game respect game 😂😂😂 he&#39;s a terrible chairman but a brilliant business man"
        },
        {
            "author": "@asdasdasd9320",
            "text": "Interesting... Deduct Everton 10 points immediately for this"
        },
        {
            "author": "@Boimiless",
            "text": "That&#39;s d4 chess ngl"
        },
        {
            "author": "@mrevilducky",
            "text": "No one dodges taxes and punishments like an American"
        },
        {
            "author": "@maxbaudinet7988",
            "text": "Man city be like…👀😏"
        },
        {
            "author": "@user-uq5xy6ex5t",
            "text": "tbh it doesnt matter bcs theyre still playing terribly"
        },
        {
            "author": "@0nimal_930",
            "text": "surely they chelasa could continue doing that for like £1 billion and never break ffp ever again"
        },
        {
            "author": "@darthcenter6130",
            "text": "Jokes aside he is a really good and successful business man."
        },
        {
            "author": "@Haalandenjoyer69",
            "text": "Just saying If city or Newcastle did this people would lose their minds I wonder what the reason is why people aren&#39;t for this 🤔"
        },
        {
            "author": "@frankfrank6631",
            "text": "I heard they sold the training ground too, crazy how this is allowed tbh."
        },
        {
            "author": "@aslamaakhter7388",
            "text": "Bro took money from right hand to left hand and escaped punishment"
        },
        {
            "author": "@anubis8586",
            "text": "This Indian dude might be the most absolute casual on this platform lol <br>You can sense his Indian bias &amp; hate as well. Never talks about certain people/players unless he’s hating. Pathetic"
        },
        {
            "author": "@apcontroller",
            "text": "I&#39;m telling u this club Might get Bankrupt one day,if this man is still there"
        },
        {
            "author": "@ibifubarajumbo2957",
            "text": "Boehly is a good business man, not a good football owner 😕"
        },
        {
            "author": "@tsdineshjai8565",
            "text": "The existence of Chelsea is a disgrace to PL and so does City"
        },
        {
            "author": "@tottereff8615",
            "text": "Genius..... Its cheating"
        },
        {
            "author": "@MaxiVera-p6m",
            "text": "Clownlake circus is moving on!"
        },
        {
            "author": "@BlazeBuds",
            "text": "Haha nice work! Shame they made them get rid of the old owner cause he is Russian though, what a joke"
        },
        {
            "author": "@quanicybynoe8628",
            "text": "Soo he just found an infinite money glitch? Sell hotels to sister companies, and still have the hotel while pocketing the fee"
        },
        {
            "author": "@KoolerKayden",
            "text": "Off the pitch: fine<br>On the pitch: shit"
        },
        {
            "author": "@craigoliver8712",
            "text": "Sounds like he is spinning plates but tbf i have no insight into his business practices"
        },
        {
            "author": "@nickmalet9306",
            "text": "lol so he exploited a loophole that’s allowing Chelsea to, yet again, spend their way into contention and you guys are praising it? SMH!"
        },
        {
            "author": "@Gamecoolnez",
            "text": "Its not like man city also no ones worried of chelsea winning the league"
        },
        {
            "author": "@rendznema",
            "text": "Loophole fc strikes again 😂😂"
        },
        {
            "author": "@rishaansharma7667",
            "text": "THIS JUST IN: Chelsea sign the entire staff of both four-star hotels to add to their industry of players."
        },
        {
            "author": "@Fail84-nv7qh",
            "text": "Now if they can only spend money on the right players and not players that COULD pan out…."
        },
        {
            "author": "@nathanmadho1208",
            "text": "Is todd boely actually smart"
        },
        {
            "author": "@KindaRealBarcaFan",
            "text": "Imagine playing Monopoly against this mf"
        },
        {
            "author": "@patrickshatro9630",
            "text": "If only he knew ball like business"
        },
        {
            "author": "@yendo77",
            "text": "I know everyone be memeing this guy for his football knowledge but he sure knows his way around business"
        },
        {
            "author": "@RSGuardianE11",
            "text": "We know hes a shocking owner of a football club, but hes one of the best businessmen ive ever heard of"
        },
        {
            "author": "@akshilnegi6519",
            "text": "Shit owner shit club"
        },
        {
            "author": "@jasondebrah4126",
            "text": "The master of loopholes"
        },
        {
            "author": "@alex0O0O",
            "text": "That&#39;s why he rejected Osimhen <br>Bro thought he can&#39;t sell him to his sister and brother clubs<br>And his salary would&#39;ve been too unreasonable <br><br>Classic American, doin&#39; business with bl-"
        },
        {
            "author": "@MudThought",
            "text": "When westerners did it, smart trick. When city owned by asian did it, it&#39;s FPP violation. lol"
        },
        {
            "author": "@user-uh8et2rc8t",
            "text": "Boehly playing 4D chess but it&#39;s actually sad Chelsea isn&#39;t in the champions league"
        },
        {
            "author": "@InfiniteKDB",
            "text": "Chelsea gangsta till they&#39;re hit another ,£100m loss"
        },
        {
            "author": "@somnathghosh7793",
            "text": "He proves time and again that he is a successful businessman."
        },
        {
            "author": "@khrawbryan",
            "text": "So he now owns those Hotel that previously belonged to him 😂"
        },
        {
            "author": "@ayabashir6868",
            "text": "They Can&#39;t Keep Getting Away With This"
        },
        {
            "author": "@mk49948",
            "text": "Classic  chelsea"
        },
        {
            "author": "@E_shortsball",
            "text": "Like if your not gay"
        }
    ]
}