{
    "videoId": "bxXvu8S6wIg",
    "totalComments": 1034,
    "comments": [
        {
            "author": "@valentim.mp4",
            "text": "The dog whisperer?"
        },
        {
            "author": "@sudharmansitaraman8377",
            "text": "Joe and Ramsay are like a schoolboy and Michael Jordan playing basketball against you. One will make all the slamdunks, and the other will sit around and make faces at you."
        },
        {
            "author": "@ldslao",
            "text": "El estepario cooks when not drumming"
        },
        {
            "author": "@jonathanbeardsley4783",
            "text": "Haha too spicy for Joe"
        },
        {
            "author": "@raytierra7412",
            "text": "Subjective. Taste is always is subjective and relative. <br>I do not like these types of shows."
        },
        {
            "author": "@moonlightpaw5868",
            "text": "Joe the snowflake"
        },
        {
            "author": "@unubilegbaasanjav333",
            "text": "I feel like joes brain just cant comprehend and process wtf hes tasting"
        },
        {
            "author": "@dickiegreenleaf750",
            "text": "Look how serious the judges faces are.  These cooking shows are hilarious. It’s food. Come on. Bunch of weirdos cult."
        },
        {
            "author": "@ahmarelvirgio823",
            "text": "Asian famously with spicy dishes, Joe just weak"
        },
        {
            "author": "@BLANK2729",
            "text": "That’s right Micheal.!!! Bringing the heat.!!"
        },
        {
            "author": "@chvk94",
            "text": "What season it is??"
        },
        {
            "author": "@iNeverSimp",
            "text": "Kimchi isn&#39;t &quot;wow&quot; spicy.  Joe needs to grow a pair."
        },
        {
            "author": "@anemNai",
            "text": "I love kimchi.. i tried making twice, tge 2nd time i succeeded, using my own gochujang alternative.. 😊😊😊❤❤ tye kimchi tasted exactly lije the ones i often bought or tge ones i had eaten when i visited south korea once... 😊😊😊"
        },
        {
            "author": "@ipaintstuff4884",
            "text": "Hell yeah Michael! Show them white folks some flavor."
        },
        {
            "author": "@dogabutila",
            "text": "dude is quite possibly the best chef to not win masterchef."
        },
        {
            "author": "@httxxxxx1",
            "text": "what season is this?"
        },
        {
            "author": "@IMAnonymous-yr7mz",
            "text": "Have  these cooking shows where regular people are the judges not  chefs."
        },
        {
            "author": "@Chickfilay22",
            "text": "Hi Michael I saw you in season 10 with nick"
        },
        {
            "author": "@bochapman1058",
            "text": "Joe was by far the worst judge ever. At least Gordon had constructive feedback. Joe was just a dick."
        },
        {
            "author": "@Pickedilly_",
            "text": "Ahh the classic Joe…. Waoh"
        },
        {
            "author": "@michellerivoire6618",
            "text": "They all need to grow a pair!"
        },
        {
            "author": "@nausherkhan8480",
            "text": "Wait are you from the Mr beast video 😂"
        },
        {
            "author": "@Hyonomusic",
            "text": "Spicy is preference for lots of people and yourself being comfortable with spicy food you gotta eat lots of spicy to scare away the flood... I know lots of white folks that can&#39;t even handle black pepper 🤷"
        },
        {
            "author": "@femmefuntime",
            "text": "Common Joe L"
        },
        {
            "author": "@pkdesuwu",
            "text": "distilled water is probably too spicy for joe"
        },
        {
            "author": "@fieryrozen",
            "text": "That guy&#39;s been eeating breads and nuts for his entire life until he finally discovered spice and.. find it strange to his tastes"
        },
        {
            "author": "@mishalaziz9380",
            "text": "Which master-chef series is this???"
        },
        {
            "author": "@Xgame727",
            "text": "Why ariana grande watching them"
        },
        {
            "author": "@immortalinaros8751",
            "text": "Joe does not belong in Masterchef as a judge."
        },
        {
            "author": "@syedhashmi8398",
            "text": "These guys are chef but cant handle spicy food lol 😂😂"
        },
        {
            "author": "@dhruvved8039",
            "text": "Whomp whomp"
        },
        {
            "author": "@Yin-Yang-Youtube",
            "text": "Only ogs remember the grubhub ads (Saying this cause of the grubhub container they showed)"
        },
        {
            "author": "@alfredyt",
            "text": "Joe whoooo?"
        },
        {
            "author": "@maximiliansmith8260",
            "text": "What&#39;s the point of the bald guy"
        },
        {
            "author": "@boluk1bo",
            "text": "Who&#39;s that bald judges?  Change him with chef Pierre please"
        },
        {
            "author": "@itadoriyuji6832",
            "text": "What is Ariyana Grande doing there 👁️👄👁️"
        },
        {
            "author": "@tabadaantonjoshuam.5252",
            "text": "Jinggg watching with smiles on his face"
        },
        {
            "author": "@r.v.jscourge2032",
            "text": "Joe has the spice tolerance of a kid"
        },
        {
            "author": "@louaubreycanedo6943",
            "text": "Judges sshould endure all flavors not like this judge"
        },
        {
            "author": "@johnsullivan1526",
            "text": "Gotta admit that looks great"
        },
        {
            "author": "@AverageAngler512",
            "text": "As a textual component. Nah dude I just tossed those leftovers on top for no reason"
        },
        {
            "author": "@demiglas7942",
            "text": "Thats a ramen ?"
        },
        {
            "author": "@yamilagelo7395",
            "text": "He clearly never tried spicy 🌶 😂"
        },
        {
            "author": "@Marco-jw7gq",
            "text": "Spicy is always better"
        },
        {
            "author": "@arnavbanerjee4606",
            "text": "I like the expressions in these people&#39;s face. Far better than most trained actors"
        },
        {
            "author": "@Rick4u",
            "text": "What season is this?"
        },
        {
            "author": "@LankingKamei",
            "text": "Try chewing north-east Indian king chilli.<br>I can turn winter to summer within few seconds😂"
        },
        {
            "author": "@Sugar00sparkles",
            "text": "When I&#39;m on my deathbed. Fucking elevated.  I want kimchi chigea. Also the biggest bottle of soju. I want  to be black out (soju is like nothing you know. Have a rimmer, twist play game) and remember one shot. first. I want to make it hardcore. . Don&#39;t forget the grill. Hot pot is good too. I&#39;m literally surprised I didn&#39;t die. I lived in Hak dong. Next to gangnam. Lost my phone there. There&#39;s more to the story. But who cares. Hahaha I love imaging and this was a win. Thanks for the memories."
        },
        {
            "author": "@bobandmrmecaleb5873",
            "text": "Wait, that&#39;s you?!"
        },
        {
            "author": "@mrtahmid86",
            "text": "Jo is a cool guy in person. I&#39;ve worked for him. At his restaurant in nyc"
        },
        {
            "author": "@TooMuchSmoke",
            "text": "I bet Joe thinks peppers spicy 😂😂"
        },
        {
            "author": "@autoimmunedefficiencysyndrome",
            "text": "Joe looks incompetent"
        },
        {
            "author": "@UnexpectingDuck",
            "text": "This dude is the least constructive judge I’ve ever seen. Literally is the worst one in every episode"
        },
        {
            "author": "@Varooooooom",
            "text": "everyone in this short looks like a professional wrestler"
        },
        {
            "author": "@derpedfox",
            "text": "White people"
        },
        {
            "author": "@shortandcut",
            "text": "Joe is always the Drama Queen they need to replace him."
        },
        {
            "author": "@VirusZero0140",
            "text": "Ok but why is raven from &#39;thats so raven&#39; on a cooking show"
        },
        {
            "author": "@alexchainey.",
            "text": "Bastianich wrong again. That is nothing new. What is perplexing is why is he still on the show?"
        },
        {
            "author": "@dango4ever719",
            "text": "Joe is just a coaster, he has no clue what flavour is outside of European food that his mom makes."
        },
        {
            "author": "@izumihyari3333",
            "text": "That face he make when he tasted the sauce."
        },
        {
            "author": "@HammerbiteStudios",
            "text": "Its wild that more people dont view joe as just a wannabe Ramsey tryhard. Its so damn obvious."
        },
        {
            "author": "@loverofnature224",
            "text": "What season is this from"
        },
        {
            "author": "@totallyfackedmate",
            "text": "i personally love rly hot food"
        },
        {
            "author": "@Greg_Twistedwizardpro",
            "text": "He experienced 🌟Flavour🌟"
        },
        {
            "author": "@KimberlyBishh",
            "text": "Spicy is where it&#39;s at it has to be the future of food.<br>Everybody&#39;s different but all of these judges need to be able to, I know Gordon can handle the heat."
        },
        {
            "author": "@samswiss3492",
            "text": "Korean food can be quite spicy"
        },
        {
            "author": "@local9",
            "text": "It&#39;s Korean inspired, if it ain&#39;t spicy then it ain&#39;t inspired... And boy did he do it right. That guy was the example of why there is white people spice."
        },
        {
            "author": "@stuartkawasaki8581",
            "text": "I’m sorry. It’s a “traditional Japanese ramen” with Korean noodles and meat. … What’s Japanese about it?"
        },
        {
            "author": "@asmitakarmakar",
            "text": "which season ?"
        },
        {
            "author": "@adityamadaan21",
            "text": "I loved the part where they all actually tried it 🙂"
        },
        {
            "author": "@Naz-if4ft",
            "text": "Ramen and ramyun are meant to be extra spicy"
        },
        {
            "author": "@jcors.7439",
            "text": "Joe is just weak with spicy"
        },
        {
            "author": "@slickricky769",
            "text": "Joe its called flavor... probably havent heard of it since all he eats is cheese and boiled dough"
        },
        {
            "author": "@q_uax5631",
            "text": "Joe definitely has robins spice tolerance 💀"
        },
        {
            "author": "@lamp1215",
            "text": "😮micheal is a judge or the judges are judge 😅"
        },
        {
            "author": "@salmanshahzad772",
            "text": "why have you repeated the same video<br>ten times."
        },
        {
            "author": "@sheamckenna6788",
            "text": "“Yeah so I made an authentic Japanese dish Korean style”……. Am I the only one seeing the irony in this"
        },
        {
            "author": "@randomphantom9750",
            "text": "tanmay bhat in the front row laughing! 😂😂"
        },
        {
            "author": "@Sam-er1zx",
            "text": "At least if you get eliminated for it being too spicy, you can call them pansies to justify it"
        },
        {
            "author": "@user-vq1oc9ur2w",
            "text": "Im convinced I am a better cook than baldy, 1000%!<br>All he does is act up, never seen him do any constructive criticism EVER.<br>Its like you made the first wild Karen you met a judge on a cooking show, just wild!"
        },
        {
            "author": "@johnwaffles9972",
            "text": "I love the part where he tried it"
        },
        {
            "author": "@Penguun",
            "text": "Id love to see someone make a dish that is just too spicy for the judges. Make a hot ones level spicy food and say nothing besides &quot;i made a spicy [insert dish here]&quot; without noting that that &quot;spicy&quot;bis a massive understatement. I want the judges to have a hard time even tasting the dishes from the spice"
        },
        {
            "author": "@conzydonzy3351",
            "text": "Bro show the full video im not here to watch half a clip"
        },
        {
            "author": "@barlmax4095",
            "text": "and what was the reaction of the other judges??"
        },
        {
            "author": "@FrozenKnight21",
            "text": "Spicy isnt always bad. My test for if its too spicy is if i want more after the first bite. If the answer is yes, then its just right no matter the spice level."
        },
        {
            "author": "@TheUltimateCancerCell",
            "text": "Wait what season was this? Why do I recognize some of the old contestants?"
        },
        {
            "author": "@AntiTankLover",
            "text": "Why is black ariana grande up there"
        },
        {
            "author": "@RemRem22",
            "text": "No way you look just like grug from the croods 😮"
        },
        {
            "author": "@kaimingchua2046",
            "text": "Nah that’s probably not spicy…. Dude’s just too weak to handle spice."
        },
        {
            "author": "@seppukumouse8005",
            "text": "Joe &quot;WOW! Thats a spicy meatball!<br>Aaron &quot; nice little kick could use more chilis."
        },
        {
            "author": "@pnepaul87",
            "text": "What the heck. I was waiting for them to try the damn dish"
        },
        {
            "author": "@moisesarellano9205",
            "text": "As a Mexican, if it’s not spicy it’s bland"
        },
        {
            "author": "@Dark_Jester89",
            "text": "&quot;delivered by GrubHub&quot; phhfft"
        },
        {
            "author": "@mewhentheuhhboblos",
            "text": "Joe finally quit because he was immature to the dishes ;-;"
        },
        {
            "author": "@fullthrottlereviews656",
            "text": "That joe grow some balls"
        },
        {
            "author": "@sandeepgiri2554",
            "text": "Joe isnt even a cook. dude got his restaurant from his dad lol. <br>Dude is a joke"
        },
        {
            "author": "@sinoperture",
            "text": "&quot;Textual component&quot;.  When cooks try to sound smart or if they are doing something innately difficult….  :-\\"
        },
        {
            "author": "@ZENAphelion",
            "text": "A white dude that cant handle spice who would have thought"
        },
        {
            "author": "@gamingemail2399",
            "text": "Lol what do you mean too spicy? Lmao"
        },
        {
            "author": "@nrg6245",
            "text": "“Looking forward to trying it” <br>Dies*"
        },
        {
            "author": "@michaelchavis2650",
            "text": "Can&#39;t stand videos that take you all the way to the end and cut you off before it&#39;s finished. It&#39;s like a fishing video that reels the fish almost all the way in but doesn&#39;t pull the fish in...... it sucks"
        },
        {
            "author": "@jessevancooney6963",
            "text": "I have never understood why people will edit videos with showing the last half of a video then flashback to the beginning. Either only show the results or keep it in order"
        },
        {
            "author": "@crowofmorrigan8553",
            "text": "I hate Joe so much,  he&#39;s genuinely so annoying"
        },
        {
            "author": "@dxnttrxp6408",
            "text": "They have george lopez as a judge?"
        },
        {
            "author": "@Snak-Pak",
            "text": "Joe is just a baby. I genuinely don&#39;t understand why he&#39;s on the show"
        },
        {
            "author": "@xrysostomosrahim1525",
            "text": "How can anyone be a judge worthy of critiqueing flavour, if they are unable to handle a lil spice. Baffles me."
        },
        {
            "author": "@Pike737",
            "text": "White guys must stick with reviewing burgers or Italian food 😂."
        },
        {
            "author": "@abcron3788",
            "text": "All he said was &quot;Wow&quot; and the comments are so mean to him 😂"
        },
        {
            "author": "@Tyler-T",
            "text": "Joe wouldn&#39;t know flavour if it hit him in the head."
        },
        {
            "author": "@hffh9262",
            "text": "I kinda just want to point out to those debating the L vs. R sound for Ramyun - The sound is an INVERTED R sound, since phonetically neither Korean nor Japanese actually have the regular R sound in their languages <br><br>I lived there for several years it’s really not that serious"
        },
        {
            "author": "@rainbowslushy223",
            "text": "that soup sounds great"
        },
        {
            "author": "@invisible.spectra5809",
            "text": "He’s the kinda guy to call mayo spicy 😂"
        },
        {
            "author": "@dedotated",
            "text": "People who think Joe is annoying <br><br>👇"
        },
        {
            "author": "@darkcabinproductions4575",
            "text": "How is a vjj"
        },
        {
            "author": "@Darkblade0926",
            "text": "Thanks for not showing the end, bow i&#39;m gonna go watch the episode.<br><br>These types of youtube channels where they show half a video then cut it off randomly wouod be great for getting people to watch shows"
        },
        {
            "author": "@JoeBlow-lb6vn",
            "text": "Presentation is wonderful"
        },
        {
            "author": "@rahulshah1408",
            "text": "Joe has mellowed a lot on screen. I’m impressed."
        },
        {
            "author": "@105thBattalion",
            "text": "Joe is so dramatic"
        },
        {
            "author": "@padrepiokenobi8608",
            "text": "If Joe goes to Korea he&#39;s gonna find out Michael didn&#39;t put enough spice."
        },
        {
            "author": "@Mina.Eats_Pizza",
            "text": "Joe got that &quot;white girl starbucks consumer&quot; Spice tolerance💀"
        },
        {
            "author": "@Fuzei_Media",
            "text": "Joe ruined this show"
        },
        {
            "author": "@blakemccarthy3742",
            "text": "Joe just mad he doesnt get to throw food in the trash."
        },
        {
            "author": "@CILinkzSpre3",
            "text": "if he knew from the start that the spice could be too much, why do it? why not make it a tad more mellow"
        },
        {
            "author": "@arrowguy0226",
            "text": "Joe could eat a head of cabbage and it be too spicy for him"
        },
        {
            "author": "@jessa1895",
            "text": "Just remember if you burn off the chefs tastebuds they can’t try anybody else’s food and you win by default"
        },
        {
            "author": "@viggimahe2808",
            "text": "My man Michael is so handsome."
        },
        {
            "author": "@escanorsama5989",
            "text": "They can&#39;t eat spice at all. 2 green chillies might be the end game for them"
        },
        {
            "author": "@davidpaulino1422",
            "text": "Thats not a soup bro. Not even a &quot;dish&quot; more of a snack. Dude will tell people that he cooks up a single egg for breakfast everyday, takes one bite from the egg white, and says he&#39;s stuffed. Bro cook some food not some crumbs"
        },
        {
            "author": "@Aldebaran04",
            "text": "That judge probably thinks mustard is too spicy🥵"
        },
        {
            "author": "@shanejohnson4546",
            "text": "Congrats! absolutely love when videos cut right before the obvious important part! Sooo amazing!"
        },
        {
            "author": "@williamstandish2926",
            "text": "Many Asian dishes are spicy. Old food joke is England declared war on the world for everyone else&#39;s spices. They think a dash of pepper and salt is spicy."
        },
        {
            "author": "@Souc._",
            "text": "I really don’t like this Joe guy, so pretentious when he has no right to be"
        },
        {
            "author": "@ducktux2321",
            "text": "“If its too spicy, you’re too white.”"
        },
        {
            "author": "@shaktisingh5543",
            "text": "Chef Mike I don’t hate you but I also don’t like you and I really don’t know why 😂😂😂"
        },
        {
            "author": "@asdqwe4427",
            "text": "The right amount, not the white amount"
        },
        {
            "author": "@bo0tybandit",
            "text": "Sorry but you shouldn&#39;t even be a food judge if you cant handle spice..."
        },
        {
            "author": "@Heiryuu",
            "text": "I’m of two minds when it comes to things being too spicy, I’m Lao I can handle my spice so for me Korean food is fantastic when it comes to heat. And I think if a dish is supposed to be spicy it should be made that way. On the other hand some people murder dishes with spice to get reactions and it becomes more about spice and less about flavor. <br><br>So here. If the flavors are excellent but it’s very spicy I think he shouldn’t be penalized. If the flavors are bad and it’s just spicy then penalize him for not being able to balance things well."
        },
        {
            "author": "@IanTranSend",
            "text": "Sometimes the spice humbles a person and I like to think it&#39;s because ancestors of the land coming back in a different karmic cycle to give the current generations a telling about the culture with all their inherited angst and angers in measured doses 😂"
        },
        {
            "author": "@itsfutile414",
            "text": "I was about to subscribe to the channel, but when I saw the channel picture, I changed my mind 💀😆"
        },
        {
            "author": "@pablodm9",
            "text": "It&#39;s fun that nobody will complain about something being &quot;too spicy&quot;. They would be looked down on if they did. Abuse that bug"
        },
        {
            "author": "@ripper2343",
            "text": "Just because you can’t handle spice doesn’t mean you gotta say the food sucks"
        },
        {
            "author": "@LawrenceQ-lw9ju",
            "text": "They are just looking for what they can give the least of, and charge the most for, That&#39;s it."
        },
        {
            "author": "@bottom_lizard192",
            "text": "Imagine Asians making white people inspired food. <br><br>“Today I’ve made a sandwich with just tomatoes and a pinch of ketchup enjoy chefs”"
        },
        {
            "author": "@erldekker",
            "text": "You ask for a Korean dish and than you complane about the spicy taste what he say WOUW"
        },
        {
            "author": "@youngeshmoney",
            "text": "I&#39;m with Joe for once, there comes a point where spicy level overpowers any flavor that exists. I want to enjoy my food, not feel like my face and tongue is on fire."
        },
        {
            "author": "@kimzeysmith6704",
            "text": "As a chef myself and if you cant handle spicy food just quit.. korean food and all asain is suppose to be spicy so if he cant handle it just quit and get a job somewhere else but not in a kitchen or in a resturant"
        },
        {
            "author": "@boatsandhoes4346",
            "text": "Joe is a flavour snake he only likes what he likes"
        },
        {
            "author": "@timsvoboda8621",
            "text": "Everything looks.. super elevated 🤓☝️"
        },
        {
            "author": "@gabfann1126",
            "text": "Milk is too spicy for the bald man, let alone a Korean dish"
        },
        {
            "author": "@user-mx2ii2tp6f",
            "text": "Fuuuyoo Joe, you week start eating  spicy food hayyya"
        },
        {
            "author": "@patrickk1417",
            "text": "Made a broth with dog vomit and kitty poopies, slurp slurp."
        },
        {
            "author": "@dumdum5520",
            "text": "I appreciate this man so much, he pronounced 라면 properly 🙌 instead of ramen"
        },
        {
            "author": "@JayZX2000",
            "text": "I remember Joe saying “Spicy good” to one of Josh’s dishes in season 3. Heat is definitely an unexpected flavor, but when used sparingly it is really quite magical"
        },
        {
            "author": "@samuelkim6702",
            "text": "As a Korean we like spicy remyeon I prove of this dish just need some more stuff inside"
        },
        {
            "author": "@kossailor3207",
            "text": "It looks really great! I would try this ramen for sure 👌🏻"
        },
        {
            "author": "@MP-dq6ko",
            "text": "Joe always looks lost and is only there to insult people. He&#39;s so lame."
        },
        {
            "author": "@keithharris5196",
            "text": "But Korean food is spicy...it&#39;s meant to be spicy the bald guy is just a pampered whimp"
        },
        {
            "author": "@LaxiusOne",
            "text": "Milk is too spicy for Joe."
        },
        {
            "author": "@accavanos",
            "text": "Do they think theyre in a dojo"
        },
        {
            "author": "@ziraprod6090",
            "text": "Such a silly, silly, show."
        },
        {
            "author": "@dominicviner6619",
            "text": "Wasn’t that spicy I imagine too"
        },
        {
            "author": "@J_O_K_E_R69",
            "text": "The most white reaction in master chef😂"
        },
        {
            "author": "@hoid7",
            "text": "I would eat this. I have never tried it and today I will eat some pork medallions with sweet potato and cucumbers. I can&#39;t wait to eat it and wish you all a happy saturday, my food friends. My favourite food is probably pizza."
        },
        {
            "author": "@tasnifrahman2486",
            "text": "If you cant handle spice or heat you have no business judging a cooking competition. Spices exist, hot foods exist. Your inability to consume it doesnt make it bad, its your problem not the chef&#39;s."
        },
        {
            "author": "@GlidingBoulder",
            "text": "How spicy was it?"
        },
        {
            "author": "@TPMiner04",
            "text": "I think Joe forgot The milk😂"
        },
        {
            "author": "@jonhenning",
            "text": "When a chef makes a dish he is creating his art to his pallet. So if that is what he intended then as a judge one should judge it based on that not your palate. Just saying."
        },
        {
            "author": "@treelandcar7844",
            "text": "If u can&#39;t handle the heat stay out the kitchen they say"
        },
        {
            "author": "@theprankfulpilgrim4245",
            "text": "Joe doesnt deserve eating ramyeon"
        },
        {
            "author": "@Kencarsonnnn",
            "text": "What’s Ariana grande doing up there"
        },
        {
            "author": "@Lordmadara.",
            "text": "Man  can&#39;t handle the heat get of the kitchen"
        },
        {
            "author": "@TechBirb",
            "text": "Walmart agent 47 acts so smug."
        },
        {
            "author": "@username15yearsago52",
            "text": "When Joe discovers spice outside of Italy 😂"
        },
        {
            "author": "@thegrouperslayer",
            "text": "People are starving in the world and these shows still exist.."
        },
        {
            "author": "@taidin1828",
            "text": "Why won&#39;t it be , they be putting spice and honey sugar together and if they eat lil then they be like 🥵"
        },
        {
            "author": "@nabatron21",
            "text": "Joe is the worst thing on this show"
        },
        {
            "author": "@ianchiovaro6518",
            "text": "Michael is so hot 🥵"
        },
        {
            "author": "@sethdacosta-cz6ng",
            "text": "i wanna know if he gay cuz of da profile rq"
        },
        {
            "author": "@jectan2117",
            "text": "I like the part where the judge&#39;s tried his dish..."
        },
        {
            "author": "@lostpotata5567",
            "text": "awww lil baby can&#39;t eat korean food. Boohoo"
        },
        {
            "author": "@ToshiroSquad10",
            "text": "Too much spice isnt a good reason to say it isnt good. Someone who loves spice is going to love that dish."
        },
        {
            "author": "@Walker-ow7vj",
            "text": "Ay his name Michael too and he got a dope beard like me 🤩"
        },
        {
            "author": "@scoclego6040",
            "text": "Joe is the worst judge on any sort of show. The ego on him is astounding when all he&#39;s done on the show is set a table."
        },
        {
            "author": "@akim5702",
            "text": "The fact he said ramyun. This guy gets it. 👌 💯"
        },
        {
            "author": "@dantesfarts6375",
            "text": "Joe is the worst"
        },
        {
            "author": "@qwe123xx",
            "text": "Serving is as tiny as his pants 😂"
        },
        {
            "author": "@davidliles7044",
            "text": "Why does food need to be explained?  It is good if it is good - the judges didn&#39;t expect a specific meal, and they are supposed to be experts, so they should be able to judge it on what they eat."
        },
        {
            "author": "@DeKhawarizmi",
            "text": "Such a baby, scared of spicy, Joe?😂😂"
        },
        {
            "author": "@db67889",
            "text": "Joe was a manchild 😂"
        },
        {
            "author": "@JorgefabianArenas-rojel",
            "text": "Don&#39;t be a psssy uncle Roger words lol"
        },
        {
            "author": "@CrittingOut",
            "text": "people who can&#39;t eat spicy food shouldn&#39;t judge spicy food"
        },
        {
            "author": "@DCLOVESGOD365",
            "text": "Joe is such talks trash to the competitors &amp; acts all tough yet he can&#39;t handle a little spice?"
        },
        {
            "author": "@theneonsongbird1200",
            "text": "I swear they keep joe in so the audience has someone to rag on i cant imagine working with him is pleasant"
        },
        {
            "author": "@cameronh421",
            "text": "Im so sick of joe"
        },
        {
            "author": "@kiptepetuk",
            "text": "Joe is a cry baby. He can&#39;t be a judge if he can&#39;t tolerate all types of flavour"
        },
        {
            "author": "@lukepittle8961",
            "text": "See I love spice. He gets spice and has a cry. Some people love it"
        },
        {
            "author": "@carolinekim4057",
            "text": "The fact that you know the difference between ramen and ramyun just tells me all I need to know 👏"
        },
        {
            "author": "@PiZZMiSSLE",
            "text": "Cant be the only one who thought this was a derek jeter x chef gordan collab"
        },
        {
            "author": "@SmokeyOwOs",
            "text": "Joe was the worst judge in the show bar none"
        },
        {
            "author": "@Not-Penguin",
            "text": "nah he&#39;s allergic to flavor"
        },
        {
            "author": "@seanhall9720",
            "text": "I hate how much cultural food I&#39;ll never be able to properly experience. I have a capsaicin allergy, and cant eat even slightly spicy food."
        },
        {
            "author": "@breaknfiction21",
            "text": "Yo props for knowing the difference between Ramen and Ramyun. You definitely invited to the Korean Barbecue"
        },
        {
            "author": "@rajibsikder3315",
            "text": "I thought you were the winner of this revenge season"
        },
        {
            "author": "@TheBeaver2x01",
            "text": "I would love that spicy"
        },
        {
            "author": "@tmgisi8459",
            "text": "I love the part where they try his dish"
        },
        {
            "author": "@qxacexp1925",
            "text": "I dont think theres such a thing as too spicy<br>Only people with different spice tolerance <br><br>Unless we are talking about the one chip challenge, then yea thats overkill xD"
        },
        {
            "author": "@Stoner_boy",
            "text": "The black girl nudged the Asian dude like yooo that’s your shit!🤣🤣🙏🏾"
        },
        {
            "author": "@gcelite36",
            "text": "Was that raven??"
        },
        {
            "author": "@theceoofcanada7540",
            "text": "For those saying &quot;joes a chef and gordans meaner&quot; first off HIS MOMS A CHEF lydia is a great cook her show is always wholesome and awsome and even when he showed up on the show he was a dick he knows the bare basics of cooking he owms a couple resturants and wine buisnesses it doesnt make him a chef. As for gordan being meaner. I implore you t0 rewatch masterchef gordan is only mean whens hes got to be in fact hes decently nice alot of the time joe is pretentious and a prick every single time. To the point gordan had publicly said he doesnt like the way joe acts"
        },
        {
            "author": "@idioteric",
            "text": "I was not expecting cratos when I saw this dude"
        },
        {
            "author": "@thomasaur12290",
            "text": "Nah bro, he got offended by the Karen’s that would complain about it."
        },
        {
            "author": "@gmkbass",
            "text": "As a Korean descendant, kudos on the distinction between Ramen and Ramyun. But at the end of the day, I love both :P<br><br>Oh, and fuck Joe Bastar, I mean Bastianich."
        },
        {
            "author": "@kawardt6784",
            "text": "bold white man should not judge anything that is spicy"
        },
        {
            "author": "@hassanalkhawaher3161",
            "text": "Oh Christian from season 5 is here I didn’t notice that before 😅"
        },
        {
            "author": "@Johnmagsayo-c8f",
            "text": "I dont know why joe has to be one of the judges, when he cant handle spicy food he based on his taste bud and not the flavor of the food."
        },
        {
            "author": "@jonconnor0729",
            "text": "I don&#39;t like Joe&#39;s Eurocentric bias towards food. He is a bad judge."
        },
        {
            "author": "@FH-id6xi",
            "text": "Joe is a Croatian gypsy"
        },
        {
            "author": "@clawmachinehunter702",
            "text": "Korean dishes are typically spicy what do you expect??"
        },
        {
            "author": "@prasathkp8222",
            "text": "What season is this ??"
        },
        {
            "author": "@Livingthelifeneenee",
            "text": "Tv cooking show judges are so irritating!  Why though?   Stuffy and superior 😢"
        },
        {
            "author": "@enoughisenough1478",
            "text": "🔥🔥🔥🔥Is very very gooodies its clearn<br>ss ur months 🙏🧕☝️🌍"
        },
        {
            "author": "@lingpham7540",
            "text": "Which season is it can someone tell me ? Ty"
        },
        {
            "author": "@iisportexii5258",
            "text": "Wow its better than daily soaps 😅😅"
        },
        {
            "author": "@garrettchapman8170",
            "text": "Joe is the worst judge ever"
        },
        {
            "author": "@nishant3098",
            "text": "Barbara: for that reason,i am out"
        },
        {
            "author": "@dosidicusgigas1376",
            "text": "Joe turned in to a fish"
        },
        {
            "author": "@benlopez1517",
            "text": "Which season??"
        },
        {
            "author": "@TdiAlejandro",
            "text": "If Joe can’t handle da heat, he shouldn’t be in da kitchen"
        },
        {
            "author": "@vjays500",
            "text": "Am i missing something every time i hear all big dish names and this and that and in the end that food is for Mini ants not humans. 😂😂"
        },
        {
            "author": "@knightworld3019",
            "text": "Isn&#39;t Joe Italian? Why was he getting spooked by spice? I thought the Italians were the only Europeans that actually liked using spice"
        },
        {
            "author": "@Henk-u1b",
            "text": "they should have an asian judge too counter this white weakness."
        },
        {
            "author": "@yoshimitsu8643",
            "text": "I’ve no idea where that bald guy is most of the show"
        },
        {
            "author": "@romanu2293",
            "text": "Pointless short. Hate this content without any clue what happend in the end"
        },
        {
            "author": "@angled-4391",
            "text": "Low spice tolerance is connected to having low testosterone, Joe is such a beta"
        },
        {
            "author": "@Daniela-gp4fk",
            "text": "Michael is very very handsome"
        },
        {
            "author": "@queenofpain7067",
            "text": "It&#39;s Korean inspired and they say it&#39;s too spicy.? Hello.?"
        },
        {
            "author": "@brianreid9241",
            "text": "Joe is soft"
        },
        {
            "author": "@avriia9173",
            "text": "The presentation of the Korean ramyeon is amazing!!"
        },
        {
            "author": "@mygdsgd",
            "text": "Aaron, please dress for a TV show, you can do it chef!❤"
        },
        {
            "author": "@johnmanila2715",
            "text": "It’s glass noodles not a rice noodles"
        },
        {
            "author": "@tricksgod9174",
            "text": "Bro is jacked Adam Levine who cooks"
        },
        {
            "author": "@MS09631",
            "text": "Ingredients are perfect blend of flavors. My only concern is why such a small bowl?"
        },
        {
            "author": "@rasmusketola",
            "text": "No result=block list"
        },
        {
            "author": "@harshmadaan9244",
            "text": "Which season is this...?"
        },
        {
            "author": "@architecture.w",
            "text": "Joe has a white bread palate."
        },
        {
            "author": "@MH-ov8fs",
            "text": "HaHa I eat KimChi erryday and luv it<br>...<br>An Acquired taste is all it is"
        },
        {
            "author": "@thesinaclwon",
            "text": "Is the bearded guy wearing yoga pants?"
        },
        {
            "author": "@p1zzamemes372",
            "text": "The fact that he said &quot;Ramyeon&quot; instead of &quot;Ramen&quot; is already enough for any Korean to love him"
        },
        {
            "author": "@Peeceee",
            "text": "If you had asian judges, they would say not spicy enough"
        },
        {
            "author": "@davudgoldberg747",
            "text": "Joe is known not to like spice .. almost every time he will say he doesn’t like it or say no"
        },
        {
            "author": "@eyoutube1",
            "text": "Joe is a restraunteur. Did the show run out of chefs to use as judges? Can&#39;t be that hard."
        },
        {
            "author": "@fishaholic6791",
            "text": "bro can cook!"
        },
        {
            "author": "@JacobTurner.",
            "text": "I love that this is posted by the chef who made it 😂 that just added another layer to the humor lmao"
        },
        {
            "author": "@UndersackitchFungalbollock",
            "text": "Gordons udders are showing"
        },
        {
            "author": "@valentingarcia6582",
            "text": "everybody has worked hard for the spot they are in. you are cooking. i dont see any jackhammers or shovels. its not hard. you stand around, throw ingredients together, burn it and hope these judges pick yours as the best."
        },
        {
            "author": "@agoraphobicadam1171",
            "text": "Joe would make it a day eating Cajun food."
        },
        {
            "author": "@codegerman71",
            "text": "This would be ultimate revenge on a judge, if they trashed you for minor things 😂"
        },
        {
            "author": "@jvebarnes",
            "text": "I&#39;m not a fan of Kimchee but give me a spicy eye watering face melting seafood laksa and I&#39;m all in."
        },
        {
            "author": "@waxiong2705",
            "text": "I bet that ain&#39;t spicy at all."
        },
        {
            "author": "@ajtam05",
            "text": "Only one guy on that judging panel can tolerate spice.  Lol I&#39;ll let you guess who.  😂"
        },
        {
            "author": "@RetroFizz22",
            "text": "That looks amazing! Incredible presentation I can only imagine the smell in that room"
        },
        {
            "author": "@criticalcat420",
            "text": "its good koream food if its to spicy to eat... compliments to Michael"
        },
        {
            "author": "@Sevem7m",
            "text": "Joe is irrelevant anyways who cares what he thinks about anything"
        },
        {
            "author": "@Sniff-Sniffa",
            "text": "Korean food spicy is different that European and American spicy."
        },
        {
            "author": "@irithindyr",
            "text": "I&#39;d make a dish where I tell Joe part of the consumption style is to snort Carolina reaper flakes up his nose and the drip down his throat is part of the dishes &quot;style&quot; and &quot;process&quot;<br><br>I that guy is a joke that isn&#39;t funny"
        },
        {
            "author": "@Okipullup6103",
            "text": "Is joe simply a judge because he’s some restaurant owner? Because he just tried something that has spice which is usually a great flavor, and doesn’t like it. He literally has no experience. Why are people even in this show that has a dumb guy like him? I don’t like Gordon much but he actually knows everything he’s doing but joe is just there for show."
        },
        {
            "author": "@sully47",
            "text": "Isnt joe not a chef?"
        },
        {
            "author": "@MrReaperHand",
            "text": "That is GORGEOUS ramen and ramyeon. The fact the colors are properly distributed and contrast with great broth. I did a competition like Iron chef years ago when I was at the Culinary Institute of America and did win, but only because I was better than them. I make good ramen, but this is WAY above me still. I love making it and asian cuisine with an emphasis on Japanese is my goto. Keep at it for sure, major props."
        },
        {
            "author": "@uitvindertje",
            "text": "That looks delicious"
        },
        {
            "author": "@finnabbq",
            "text": "Joe is soft"
        },
        {
            "author": "@bruticusdude65",
            "text": "i dont like joe, he always turns his nose up at everything that isnt his own cooking. Like if i ever make the chicken wing geoza from Shokugeki no Soma (Food Wars) i can definatly tell he&#39;ll bin it"
        },
        {
            "author": "@snakeoo7ca",
            "text": "Joe couldn&#39;t pretend to be Gordon because he was in the room 😂"
        },
        {
            "author": "@thericehatwok2375",
            "text": "If I’m going to remove any judge it would 100% be Joe. I feel like his ego shows too much when he judges food. I’m not a food critic or anything but it’s painful to watch him like 90% of the time"
        },
        {
            "author": "@Conlushion",
            "text": "it supposed to be spicy most of the time"
        },
        {
            "author": "@kusaragima3092",
            "text": "What season is this?"
        },
        {
            "author": "@bonkyouded",
            "text": "Every korean watching this : awww white boy cant handle the spice! Sooo saad 😭"
        },
        {
            "author": "@JohnYoo39",
            "text": "As a Korean, I kinda wanna try this shrimp-head kimchi? It may be trash, but it could be ok."
        },
        {
            "author": "@benyameenyitzhak1036",
            "text": "As if the bald guy matters 😂"
        },
        {
            "author": "@am33rtriplex81",
            "text": "If your a top chef you should be able to handle spicy food"
        },
        {
            "author": "@jaydencasey273",
            "text": "I have a genuine hatred toward joe that I can’t even begin to explain"
        },
        {
            "author": "@MrChipoclas",
            "text": "Joe is such a bad judge"
        },
        {
            "author": "@jakobramey8997",
            "text": "On one side we have this and in the other we have 3rd world countries"
        },
        {
            "author": "@gabrielarredondo3203",
            "text": "That Mexican Guy Put On Some Crazy Weight"
        },
        {
            "author": "@haris1321",
            "text": "actually Joe liked the dish and he also agree that the spiciness elevates the dish ."
        },
        {
            "author": "@seanlee3088",
            "text": "Love how he said the Korean version of ramyun right to the best of his ability lol"
        },
        {
            "author": "@NutLump",
            "text": "How do you, as a &quot;Super Amazing famous food critic&quot; hear the word &quot;Korean&quot; and still get taken aback by the spiciness? lol"
        },
        {
            "author": "@EpicRanger48",
            "text": "Didn’t know Jason kelce could cook!"
        },
        {
            "author": "@SwirlyBag",
            "text": "Joe looks like he thinks gluten is spicy."
        },
        {
            "author": "@ShadeScarecrow",
            "text": "To be fair, Joe looks like mayo is to spicy for him..."
        },
        {
            "author": "@sazquacz",
            "text": "This joe guy... what a... ehh."
        },
        {
            "author": "@ian10145",
            "text": "Wow Joe didn’t just smash the plate into the floor that’s how you know this guy can cook"
        },
        {
            "author": "@infernalmedia1784",
            "text": "why was the broth delivered by fucking grub hub XD"
        },
        {
            "author": "@iKilleas",
            "text": "Me as a asian i love spicy foods. I know also some dont appreciate spicy dish. Me the spicy is it, is the best. Nice job. Do the asian food in asian measure not in English measurement. Can&#39;t take spicy food? maybe it&#39;s not for you."
        },
        {
            "author": "@snoopyguy21",
            "text": "How much gochujang did mans put for it to be too spicy?"
        },
        {
            "author": "@XXavierSin-XXs",
            "text": "If I ever cooked on this show I would purposefully make Joe a dish that looks the same, but tastes like putrid ass, with such an insane level of heat that it ruins his palate for hours"
        },
        {
            "author": "@poteato0987",
            "text": "uncle roger be like :<br>why are you like this? why white people scared of spicy? why white people scared of flavour?"
        },
        {
            "author": "@dylanbingham1776",
            "text": "The ingredients look really elevated"
        },
        {
            "author": "@Mark6O9",
            "text": "You can never be too spicy. It just depends on how enjoyable the spice is"
        },
        {
            "author": "@bigfriendlyginger4878",
            "text": "Michael looks like an aged up dad version of Zac Efron, the face shape and eyes..."
        },
        {
            "author": "@matthewtibbs8605",
            "text": "Joe has the palate of a four year old. Just give him spaghetti O&#39;s and set him in the corner."
        },
        {
            "author": "@efraimgarces1126",
            "text": "What in the heck is spicy for him hell?"
        },
        {
            "author": "@Jinx1349",
            "text": "Wait you left Joe speechless, thats a fucking win  right there . :)"
        },
        {
            "author": "@Huh-rv7oe",
            "text": "well most Koreans like spicy foods"
        },
        {
            "author": "@jaanmohammed1720",
            "text": "Damn his expression is like &quot; are you fucking serious ? This is spicy?&quot; 😑😑. ,😂😂😂🤣"
        },
        {
            "author": "@moight143",
            "text": "Wow I’ve never seen American master chef before💀"
        },
        {
            "author": "@jimsmith3715",
            "text": "Joe is straight up the worst judge they could&#39;ve picked, he&#39;s just horrible at his job, doesn&#39;t provide any constructive criticism. Just says what is subjective opinion is which anyone can do."
        },
        {
            "author": "@dertyluck",
            "text": "I love how he’s the one that posted this"
        },
        {
            "author": "@ConvexSpys",
            "text": "Why is there a GrubHub container I thought everything was meant to be made by the chiefs? Asking as someone who doesn&#39;t watch the show so generally curious."
        },
        {
            "author": "@gideonjohnson8268",
            "text": "&quot;this is you on a plate, but i need YOU to be more like ME&quot; - Joe talking to Dorian in season 10"
        },
        {
            "author": "@Galiea456",
            "text": "Salt is too spicy for joe"
        },
        {
            "author": "@AbominationalFailure",
            "text": "I would watch MasterChef US if it weren&#39;t for Joe"
        },
        {
            "author": "@DemiGodCC",
            "text": "Joe look like the kinda guy to say mildly hot taco sauce is too spicy"
        },
        {
            "author": "@JJ-hk9xk",
            "text": "Love the part where they tried the food fr"
        },
        {
            "author": "@yuriikrasylovych3939",
            "text": "Not to defend Joe, but this video he was a nice guy, yet still everybody shits on him. Chill, dudes, he is not the worst person, by faaar. Not to mention, it&#39;s a show"
        },
        {
            "author": "@LostTravelr",
            "text": "Michael has the body of someone who could kill but the mind and soul of a great man who knows his stuff."
        },
        {
            "author": "@itsinternet5768",
            "text": "“Being the top feels really good.”"
        },
        {
            "author": "@BigSmoce",
            "text": "Another pointless clip."
        },
        {
            "author": "@mrobertson188",
            "text": "he was always the best chef"
        },
        {
            "author": "@KingsRow55",
            "text": "Can I just say the presentation is gorgeous? Really making my mouth water 🤤"
        },
        {
            "author": "@vikingshark2634",
            "text": "Anytime you tell me I&#39;m about to eat something made from shrimp heads and kimchi, please do make it so spicy that it burns away all the flavor."
        },
        {
            "author": "@nifLefty",
            "text": "&quot;The food is amazing but its not on my taste for that reason im out&quot; - Joe<br><br>Its like someone saying your idea will make millions if not billions but im too much of a pussy so for thag reason im out"
        },
        {
            "author": "@RapTapTap69",
            "text": "Moody Chews. Like Moody Blues but chews because it bites🤷"
        },
        {
            "author": "@abhinandramankulath8238",
            "text": "Use the right amount of spice and not the white amount"
        },
        {
            "author": "@spartan1010101",
            "text": "Joe’s the type of dude that owns a restaurant but has never eaten any of the food there."
        },
        {
            "author": "@Dayhawk101",
            "text": "That guy in the middle that is a judge reminds me alot of The dog whisper Cesar Millan."
        },
        {
            "author": "@cainsalim4802",
            "text": "Joe the kind of guy to cry if mayonnaise has salt"
        },
        {
            "author": "@matthewreynolds8618",
            "text": "dont worry about any opinion but gordon&#39;s on this show. Joe&#39;s a bum"
        },
        {
            "author": "@argonaut4432",
            "text": "Honestly shouldve put more spice"
        },
        {
            "author": "@farlonmuentes6004",
            "text": "how can one be a food judge if they can&#39;t handle spicy that was mostly used in other dishes? koreans are known to have fire noodles."
        },
        {
            "author": "@Rescel1",
            "text": "I know joe is the Villain in this show but I really hate that when something is a little bit spicy he gets angry … you have freaking penne alrabiata in Italy grow up"
        },
        {
            "author": "@Saba_Ora",
            "text": "A courtroom jester playing king"
        },
        {
            "author": "@Hockeyfan268",
            "text": "Joe is a good critic, he doesn’t know food"
        },
        {
            "author": "@iancummisford5235",
            "text": "All my homies hate joe"
        },
        {
            "author": "@36harshalmehta5",
            "text": "This is my new dream now, goto MasterChef and make every judge taste the most horrifyingly spicy flavor in existence."
        },
        {
            "author": "@ek7713",
            "text": "Imagine your Masterchef chances being ruined cus some white guy things your food is too spicy for HIS palet lmao"
        },
        {
            "author": "@rusticrooks9748",
            "text": "Dude cant handle foods that are little bit spicy.   🤷‍♂️ as sharma man says grow some hair on za chest."
        },
        {
            "author": "@gabrielcho999",
            "text": "Who&#39;s Joe?"
        },
        {
            "author": "@Oliver2k3",
            "text": "we all know joe is just a puff"
        },
        {
            "author": "@brrman4089",
            "text": "<b>Too spicy</b> more like too weak."
        },
        {
            "author": "@AmasterfulJuice",
            "text": "Tf does that mean?"
        },
        {
            "author": "@hypernova4725",
            "text": "Joe who?"
        },
        {
            "author": "@SteveTheFollower",
            "text": "Joe is a joke to me tbh"
        },
        {
            "author": "@DarkestKnight2424",
            "text": "That&#39;s a really small size bowl of ramen.."
        },
        {
            "author": "@latenightcereal2390",
            "text": "Tf was that?"
        },
        {
            "author": "@raytheperson",
            "text": "Spicy is easy flavor is difficult<br>To many people are easily impressed with chili"
        },
        {
            "author": "@OrtegaSauce",
            "text": "Of course its too spicy for him"
        },
        {
            "author": "@ruben4050",
            "text": "Massive respect for knowing the difference between ramen and ramyun"
        },
        {
            "author": "@piccoleitor",
            "text": "It&#39;s straight up stupid to make a really spicy dish if it&#39;s going to be judged"
        },
        {
            "author": "@CBrasil1966",
            "text": "Since when George Lopez is a cooking show?😂"
        },
        {
            "author": "@toasterknight5372",
            "text": "That was the face of &quot;holy shit thats good but way too spicy for me&quot;"
        },
        {
            "author": "@martinfereg2882",
            "text": "good soup"
        },
        {
            "author": "@AnnoyYourself",
            "text": "Did gordans wrinkles come back?"
        },
        {
            "author": "@Godscaliber69",
            "text": "Man can we just kick Joe off the show, I’ve never had a moment where I thought, He’s perfect for the show. I’ve prob only seen him like 3 dishes"
        },
        {
            "author": "@nakotahunt1324",
            "text": "Joe is hilarious. So famous yet nobody knows who he is or what he did to get famous"
        },
        {
            "author": "@nedcurfman3486",
            "text": "Seeing everyone rally against Cueball over here makes me smile."
        },
        {
            "author": "@erics5572",
            "text": "I&#39;m so glad I stopped at just one hidden tattoo in the year 2000, already then it was becoming too mainstream. Now every Tom dick and harry has a tattoo and it&#39;s not a counter culture statement anymore."
        },
        {
            "author": "@hamsterdmg",
            "text": "Kimchi is pretty spicy. i dont see the issue"
        },
        {
            "author": "@flopilop4596",
            "text": "On one hand he should know he is cooking for white classically trained chefs where spice isn’t frequent and second those chefs shouldn’t be eating it xD"
        },
        {
            "author": "@Noah_thegamer097",
            "text": "Of course, Joe doesn’t understand the actual definition of flavor because his family was friends with the sexual harassing chef and he is not an actual chef"
        },
        {
            "author": "@hametsu475",
            "text": "Wtf happened to Ramsay? He looks 30 years older than he was yesterday!"
        },
        {
            "author": "@dimasdeathcore",
            "text": "Too spicy? Why are you so weak <br>- uncle Roger"
        },
        {
            "author": "@Khizar_kt",
            "text": "No such thing as too spicy in korean dish"
        },
        {
            "author": "@donrektmeplease",
            "text": "These judges run bankrupted restaurants anyway. Lols"
        },
        {
            "author": "@awayspyder2",
            "text": "Joe can’t hang lol"
        },
        {
            "author": "@matthewduran2629",
            "text": "Wow. *walks off and dies"
        },
        {
            "author": "@Not-posting-until-100-subs",
            "text": "Wait is this 10 or 12 I’ve watched both"
        },
        {
            "author": "@enriquecabrera2137",
            "text": "To be fair, Joe finds mayo spicy."
        },
        {
            "author": "@t2d748",
            "text": "gordon hates the food so im going to hate it more"
        },
        {
            "author": "@kidrorororo",
            "text": "Joe is a definitely a bottom"
        },
        {
            "author": "@piratescove4",
            "text": "So did GrubHub deliver the to go bag that Gordon was speaking about? Product placement huh."
        },
        {
            "author": "@illusion2you396",
            "text": "Korean ramen is traditionally really spicy. You did a good job getting that part traditionally correct. I am not an expert but I did go to Korea for 16 months."
        },
        {
            "author": "@BenRangel",
            "text": "fuck shorts! now we didn&#39;t get to see the ending. (but we all knew they loved it, so 🤷‍♂️ i Guess )"
        },
        {
            "author": "@BFPerry220",
            "text": "This shows nothing to be seen."
        },
        {
            "author": "@TheIrishGamer16",
            "text": "Nobody:<br><br>Joe: I&#39;m Italian so I&#39;m basically the greatest chef to ever exist. Also if he&#39;s Italian and afraid of a bolder flavor palet, shame."
        },
        {
            "author": "@frogmann-ug3cs",
            "text": "Micheal looks like a mf to eat a ghost pepper and say it’s not spicy enough"
        },
        {
            "author": "@jordipernillo3026",
            "text": "Joe got to where he is by riding mamas coattails while doing absolutely nothing of substance"
        },
        {
            "author": "@NoThankYouToo",
            "text": "The complete and utter lack of masculinity"
        },
        {
            "author": "@testuser8977",
            "text": "I can see by the comments that I&#39;m not the only one who doesn&#39;t like that judge. He&#39;s such a tool."
        },
        {
            "author": "@TheComedyColosseum",
            "text": "“Does that taste like a neighbourhood you’ve never been to?”"
        },
        {
            "author": "@MrHoodlin",
            "text": "The way the two judges talk is like how you text somebody. Lol"
        },
        {
            "author": "@jasonnelson3819",
            "text": "Romyun ? ... What the f is that"
        },
        {
            "author": "@cameroncanter5649",
            "text": "Never too spicy unless its over what you ment to do"
        },
        {
            "author": "@dsta9996",
            "text": "Of course skin tight jeans for a flood lol"
        },
        {
            "author": "@01bear01",
            "text": "Joe has no credibility to be a judge. He is a host. Nothing more. He wouldn&#39;t know true palates if it bit him."
        },
        {
            "author": "@brony954",
            "text": "I don&#39;t like Joe he is so snobby and argentine,"
        },
        {
            "author": "@accavanos",
            "text": "Now George Lopez is doing a cooking show?"
        },
        {
            "author": "@mrshitterthepencilspitter6931",
            "text": "joe is literally my college professor he knows jack shit and tries to assign more work than what is needed of us."
        },
        {
            "author": "@Wickedwardog",
            "text": "Too spicy for JOE MAMA"
        },
        {
            "author": "@brannon4954",
            "text": "He might be on top now but something tells me he&#39;s going to be on the bottom later"
        },
        {
            "author": "@CMPLX_BNGO",
            "text": "I really want to try that lol"
        },
        {
            "author": "@alins4629",
            "text": "People who dont eat spicy food shouldn&#39;t judge."
        },
        {
            "author": "@Binmusu",
            "text": "He is italian cant handle the flavor due to the amount of wine and cheese in his vein."
        },
        {
            "author": "@comradekitty3759",
            "text": "When I heard kimchi I thought of a manga I was reading with a saintess that came from Korea giving kimchi to European royalty 😂.  It went like this (name of mange was divorcing my tyrant husband ep20 and 21)"
        },
        {
            "author": "@paulawerchowsky926",
            "text": "What season is this"
        },
        {
            "author": "@victorlopez190",
            "text": "Joe probably thinks taco bell sauce is spicy.."
        },
        {
            "author": "@mursil2204",
            "text": "dude&#39;s beard is too good"
        },
        {
            "author": "@UnderTheMillkyWay",
            "text": "I guess Joe is not aware Korean food can be extra spicy. That&#39;s shocking to me. Wish I could have heard them finish on the next dish because it looked so tasty."
        },
        {
            "author": "@Luxury037",
            "text": "Just weak honestly 😂"
        },
        {
            "author": "@AllenHanPR",
            "text": "Joe: why is your kimchi spicy. I&#39;m an expert on all cuisine and that is way too spicy and sour."
        },
        {
            "author": "@carp6963",
            "text": "I thought Shanika was raven samone"
        },
        {
            "author": "@an_38kitkashyap",
            "text": "The western people are <b>just</b> not made for spicy food. If he was Indian, he&#39;d have been really big by now 😂"
        },
        {
            "author": "@crystalne",
            "text": "Joe is a horrible judge"
        },
        {
            "author": "@issac82983",
            "text": "bruh thinks cacio e pepe is too spicy"
        },
        {
            "author": "@chino5811",
            "text": "Joe is such a pussy bro<br><br>He&#39;s got less experience than all of those chefs he&#39;s judging"
        },
        {
            "author": "@6SpaceShake9",
            "text": "I never understood Americans, I thought they ate spicy stuff but then I saw Gordon Ramsay put a singular chili in his dish and added something in the dish to &quot;soften the blow&quot;"
        },
        {
            "author": "@tropa1481",
            "text": "when a judge cant judge spicy then he should not be a judge"
        },
        {
            "author": "@Central.IntelligenceAgency.",
            "text": "Fun fact : spice is not a taste, it is a pain"
        },
        {
            "author": "@smol_gura",
            "text": "Joe finally realised that there are more than just salt and pepper"
        },
        {
            "author": "@MrRocko15",
            "text": "Joe thinks paprika is too spicy."
        },
        {
            "author": "@ayudameporfavor1146",
            "text": "Bruh Asians would love the spice as would most Hispanics and many others too"
        },
        {
            "author": "@thisguy6632",
            "text": "this is dumb.  they&#39;re just cooking food.  I cook everyday.  they act like it&#39;s life or death."
        },
        {
            "author": "@Mike-Home-Cook",
            "text": "If you can’t handle spice you can’t handle Korean food. <br><br>맵부심"
        },
        {
            "author": "@pgdgus",
            "text": "I hate shorts that end right before it shows what the title leads you to believe it will show."
        },
        {
            "author": "@calvinyip364",
            "text": "Korean food are spicy. But I love it. But sometime it can be too spicy"
        },
        {
            "author": "@dawghe",
            "text": "Joe thinks pepper is spicy he’s a clown"
        },
        {
            "author": "@shabnamkhanam5987",
            "text": "Come to India"
        },
        {
            "author": "@RealJesusChrist1",
            "text": "Joe is Italian, they don&#39;t know what spicy is 😂"
        },
        {
            "author": "@Thee_Spud",
            "text": "Yea but there’s a frog on the window"
        },
        {
            "author": "@MikeJ-dx2fe",
            "text": "Excuse me but there is beard hairs in my soup"
        },
        {
            "author": "@rafavargas7775",
            "text": "Do u really think that joe is a real chef? 😂😂😂😂😂"
        },
        {
            "author": "@Cyanide_no_aji",
            "text": "This guy knows Korean, I can tell by how he speaks how he said ramen and the  &quot;un&quot; response"
        },
        {
            "author": "@TheBongripper",
            "text": "Is that gorge Lopez"
        },
        {
            "author": "@DevelonLP",
            "text": "Joe saying wow moving on and bringing no value. Average Joe moment."
        },
        {
            "author": "@MuhdNurIlman",
            "text": "I hope more contestant made spicy food...its like saying the bald judge opinion doesn&#39;t matter"
        },
        {
            "author": "@johns1754",
            "text": "Joe is the perfect example when confidence turns into pretentious behavior. One is attractive the other isn&#39;t."
        },
        {
            "author": "@yassinzallali7366",
            "text": "They dont have culture so no spices 🌶 🧂"
        },
        {
            "author": "@MCPLUSTR",
            "text": "Joe looks like fucking MODOK from ant man and the wasp quantumania 😂😂"
        },
        {
            "author": "@ddavidd1648",
            "text": "kimchi is not that spicy;; thats a joke reaction."
        },
        {
            "author": "@IronJustice2755",
            "text": "White peopl 😔😔😔"
        },
        {
            "author": "@koksoozhoung6126",
            "text": "&quot;so weak cant even handle spice haiyaaaa &quot; - uncle roger"
        },
        {
            "author": "@MaartenDeBaar",
            "text": "Who is Joe"
        },
        {
            "author": "@A-Plus124",
            "text": "I like the part when they try it"
        },
        {
            "author": "@Outerworlds360",
            "text": "I was brushing the my teeth while watching this video and I thought he said fermented toothpaste 😂"
        },
        {
            "author": "@shadowbbb4010",
            "text": "Joe is the best chef!"
        },
        {
            "author": "@pureparkour6114",
            "text": "&quot;Why so weak, sooo weak!&quot;<br>Uncle Roger..."
        },
        {
            "author": "@tundraxd4896",
            "text": "Hope someone sneaks a Carolina reaper in Joe&#39;s ramen"
        },
        {
            "author": "@VendonJura",
            "text": "spicy food is the best food :D"
        },
        {
            "author": "@angelrambojr4587",
            "text": "Fuck I’m hungry now. Stuck at the mechanic lmao puta madre"
        },
        {
            "author": "@jeah8259",
            "text": "Joe’s mom seem so nice and talented, what happened to Joe?"
        },
        {
            "author": "@kristie979",
            "text": "Joe has the personality of iceberg lettuce"
        },
        {
            "author": "@nancyjob9804",
            "text": "I have a thing for Joe&#39;s lips. Lol. It&#39;s all I can look at"
        },
        {
            "author": "@camronmcgrath9973",
            "text": "Imagine being a judge and not liking spice"
        },
        {
            "author": "@ghada7nassr",
            "text": "Waiting for a cooking book by chef Michael 🙏💜"
        },
        {
            "author": "@user-wj9mk8un4i",
            "text": "Korean style?? .. What makes it so ? Lol"
        },
        {
            "author": "@pucci_seq636",
            "text": "Bro looks like he sniffed smoked a joint for the first time"
        },
        {
            "author": "@procarreviewsbypablo6340",
            "text": "Joe is such a trash human being"
        },
        {
            "author": "@JD-ts1yq",
            "text": "I will never understand cooking shows, there’s no criteria it’s based on opinion 😅 if 75 million people like my food and 3 judges don’t I lose the competition 😂😂"
        },
        {
            "author": "@benseungyupsong1273",
            "text": "As a Korean ngl it just looks like an American dish. The dish looks fantastic I’m just saying that I wish it had more of the Korean vibe to it."
        },
        {
            "author": "@Albatross0913",
            "text": "I would absolutely love to try this dish, it looks wonderful"
        },
        {
            "author": "@gijoe678",
            "text": "Snobbish Italian chef experiences flavor and doesn&#39;t like it"
        },
        {
            "author": "@greeneyedgal8270",
            "text": "Most food in America that&#39;s supposed to be spicy barely has any kick. They keep it bland for guys like joe"
        },
        {
            "author": "@richiekaylor5004",
            "text": "The main thing I hate about these shows is they seem to get chefs with similar palettes. I feel like they hate on dishes they don’t like. Not everyone is the same"
        },
        {
            "author": "@purplewolfranger22",
            "text": "Joe experienced flavor for the first time."
        },
        {
            "author": "@gabemohanwanderlust7900",
            "text": "It&#39;s his problem if he doesn&#39;t like ramen spicy"
        },
        {
            "author": "@hummingbirdcake1902",
            "text": "Air is too spicy for Joe tbh"
        },
        {
            "author": "@84g3ta2dq",
            "text": "Support from another Michael"
        },
        {
            "author": "@Easty2776",
            "text": "Joe just acting like he knows shit idk why they even had him there"
        },
        {
            "author": "@GG-mr9iz",
            "text": "I like the fact that he used kimchee. You can tell he took a risk but it shows he is bold enough to try different styles.  The judges don’t seem to understand Korean style cuisine but which shows there lack of understanding or taste. Some food is meant to be eaten spicy. Not all types have to cater to his taste."
        },
        {
            "author": "@SungGui91",
            "text": "Korean spicy hits different lol"
        },
        {
            "author": "@lililive1092",
            "text": "I always hated them saying things were too spicy, like y’all are chefs. Joe was always the worst he has terrible takes and he’s not even actually good at Italian food he just likes to hear himself talk"
        },
        {
            "author": "@rooooooby",
            "text": "Why so weak?"
        },
        {
            "author": "@addicterror589",
            "text": "It&#39;s ramyeon not ramyun"
        },
        {
            "author": "@gdiaz8827",
            "text": "White judges cant handle spice"
        },
        {
            "author": "@michaelnguyen7445",
            "text": "Joe is the type to try little boy you till the two other chief says it’s very good"
        },
        {
            "author": "@yofedstyhrega4594",
            "text": "That&#39;s rough because make it not spicy and it dissapoints and make it too spicy and it sucks."
        },
        {
            "author": "@mattvarvorski",
            "text": "I wanna change my answer from (if you had one punch who would you hit with no immunity?) from Zuckerburg to Joe. He might just be putting this on for TV but I’m not sure, just seems like a guy you would drink a beer around and he’d go “wow, you drink that?”"
        },
        {
            "author": "@daninja130",
            "text": "I don&#39;t think it was to spicy he just was getting ready to smash the guy until the real chefs tasted it and loved it."
        },
        {
            "author": "@handyranks6407",
            "text": "Joe is so sensitive he&#39;s like a woman but bald lol"
        },
        {
            "author": "@AcerAz115",
            "text": "Guy should&#39;ve known there was only one judge up there that can actually take the heat 🤣"
        },
        {
            "author": "@ashtonwhite6181",
            "text": "Not enough food"
        },
        {
            "author": "@williamsmith2526",
            "text": "Joe is a panzy and a drama queen"
        },
        {
            "author": "@manojc5971",
            "text": "Think if bayashi is here 🤣🤣"
        },
        {
            "author": "@dish9849",
            "text": "Remember us the right amount not the white amount"
        },
        {
            "author": "@Aang_L._Jackson",
            "text": "Joe got his ass heated 😂😆"
        },
        {
            "author": "@user-cf4rx4em6y",
            "text": "Joe is just too weak to try Asian food"
        },
        {
            "author": "@carvitqmilate9244",
            "text": "i still wondering a food businesses man is not a chef and being judges at master chef🙃"
        },
        {
            "author": "@kezneki",
            "text": "That dude&#39;s dishes looked bomb af"
        },
        {
            "author": "@gamerhex7335",
            "text": "Joe is literally the ONLY reason I don&#39;t watch the show. Wish they&#39;d get rid of him. Also, does he know just how much his audience hates him?"
        },
        {
            "author": "@matthewalexissalazar6458",
            "text": "My man Joe is to white"
        },
        {
            "author": "@jaibharti007",
            "text": "Which season is this"
        },
        {
            "author": "@dysennn",
            "text": "that’s literally raven on the balcony i swear"
        },
        {
            "author": "@Chutney423",
            "text": "It is korean inspired dish. TF was he expecting"
        },
        {
            "author": "@zyzz3123",
            "text": "Does lil Joe need the firefighters"
        },
        {
            "author": "@ricksterk7014",
            "text": "Time is catching up with Gordon 😭"
        },
        {
            "author": "@simonyeager6062",
            "text": "This guy is my favorite! His dishes look amazing!"
        },
        {
            "author": "@MystixGaming03",
            "text": "Currently watching ur season !!!"
        },
        {
            "author": "@ThrowMyBackOutOnTheACFT",
            "text": "He’s not used to heat. He’s not used to making sure his food tastes good. He’s used to his mommy doing his work for him, and then talking down to others for slightly overcooked venison when he can’t even wipe his own ass"
        },
        {
            "author": "@___________________-1",
            "text": "I like the part where they all tasted it"
        },
        {
            "author": "@halfandhalf5768",
            "text": "Joe is the type of people i wish didn&#39;t exist. World would be in a way better place with people like Gordon, because at least he gives actual fucken advice"
        },
        {
            "author": "@motationhd8989",
            "text": "Spicy for them is like candy for a Mexican"
        },
        {
            "author": "@martinaasta",
            "text": "Seems like people don&#39;t get that food is not just bland or spicy. Most world&#39;s cuisines don&#39;t even eat spicy food that much"
        },
        {
            "author": "@amandao6686",
            "text": "I love how this comment section knows the show and is just shitting on the guy that didnt even talk! 🤣"
        },
        {
            "author": "@JuniorJr_23",
            "text": "very creative"
        },
        {
            "author": "@md.shariarkabir7350",
            "text": "Which season?"
        },
        {
            "author": "@Randy_Lahey0623",
            "text": "Yea that 25% Italian tongue ain’t liking actual flavor"
        },
        {
            "author": "@senorpapasfritasconqueso",
            "text": "Hey man don&#39;t knock the gochujang. Delicious funky spicy flavor. If you can&#39;t handle that it&#39;s not because it&#39;s bad, it&#39;s because you&#39;re too weak. Why so weak?"
        },
        {
            "author": "@jjsvizard75",
            "text": "Uncle Roger would be proud of joe!"
        },
        {
            "author": "@siittosiika",
            "text": "Michael! This had flavour!"
        },
        {
            "author": "@achillcapybara",
            "text": "GrubHub perks give you deals for the food you love, the kind of deals that make you boogy. 💃"
        },
        {
            "author": "@darkyt6600",
            "text": "1000th comment"
        },
        {
            "author": "@user-md2ds2qh5i",
            "text": "Joe is such a crybaby"
        },
        {
            "author": "@megadonald1982",
            "text": "Where is the end ?"
        },
        {
            "author": "@Contemelia",
            "text": "Considering Joe, I&#39;m not surprised... as I mentioned in a previous comment, he just doesn&#39;t have his own opinion as he knows it will be wrong anyways... cz he can&#39;t judge shit.. bro can&#39;t even boil water and decided to become a judge"
        },
        {
            "author": "@sanatsrivastava2814",
            "text": "Joe judging a cooking show is like Kevin Hart judging a powerlifting competition"
        },
        {
            "author": "@stevem6856",
            "text": "Joe doesn&#39;t have an opinion. He waits for Ramsay to give one. Then shows up like he&#39;s being original"
        },
        {
            "author": "@usefulpoison673",
            "text": "Poor Joe and his inability to handle any heat"
        },
        {
            "author": "@benquah5604",
            "text": "Asian dishes always taste awesome"
        },
        {
            "author": "@Kyberblox123",
            "text": "I love the part where they tried it"
        },
        {
            "author": "@AnimeLavva",
            "text": "Cant handle the spice?   Weak.  🤣"
        },
        {
            "author": "@anime_sensei",
            "text": "Haiyaaa I didn&#39;t expected much from Joe as he is another white guy only"
        },
        {
            "author": "@muliyanto5097",
            "text": "2 mistakes <br><br>1. Korean food has big servings <br>2. There’s no such thing as too spicy for Asian dish unless you are white peoples"
        },
        {
            "author": "@KS-ds9ed",
            "text": "which season is this? i see there several contestants from previous seasons"
        },
        {
            "author": "@swgdsm",
            "text": "Joe would lick the side of a semi and call it spicy."
        },
        {
            "author": "@eminem2088",
            "text": "Bish can’t handle a little heat coz he’s italian"
        },
        {
            "author": "@blingousman2396",
            "text": "Joe is allergic to flavour Micheal is lucky he didn’t get a plate thrown at him"
        },
        {
            "author": "@blackdude4767",
            "text": "Never used to watch this show whenever on tv.The contestants are cocky, except for Gordan the judges are unqualified and cocky.Masterched Australia was a treat to watch tho."
        },
        {
            "author": "@d.a.2115",
            "text": "“This hurt my little tongue, for this reason u are out. Maybe be a little whiter”"
        },
        {
            "author": "@joshuavaldivieso55",
            "text": "Ughh chef Michael you’re so fineee 😍 like wow that beard especially"
        },
        {
            "author": "@ktrex2057",
            "text": "Joe is the worst judge like just because it was spicy for him he doesn’t like it like In my opinion, I would never let someone cross me like that"
        },
        {
            "author": "@ezra._.skk0924",
            "text": "What&#39;s this episode called"
        },
        {
            "author": "@goku8159",
            "text": "Did that lid say dilivered by grub hub 💀💀"
        },
        {
            "author": "@jolt06",
            "text": "So he made a shrimp kimchi soup with ramen noodles"
        },
        {
            "author": "@alexandersavage305",
            "text": "Joe is such a hack lmao"
        },
        {
            "author": "@ziejackson6236",
            "text": "What season and episode is this"
        },
        {
            "author": "@BigDoof2",
            "text": "I&#39;m super glad it was too spicy for Joe, I really dislike him and the way he judges the competitors. You can&#39;t talk that much shit without being able to do better yourself."
        },
        {
            "author": "@emt8756",
            "text": "Joe is just another typical critic."
        },
        {
            "author": "@Masked_808",
            "text": "Korean food is usually pretty spicy so you just stayed true to the culture"
        },
        {
            "author": "@TheeRomanHD55",
            "text": "Ya and I&#39;ll poop it out later and it will look like a brown log later 😆 🤣"
        },
        {
            "author": "@dragnaigaming2912",
            "text": "Man you guys hate joe when you realize he’s just really strict"
        },
        {
            "author": "@haryzlee",
            "text": "Joe is Barbra. You gotta have one in any judging competitions"
        },
        {
            "author": "@kylelunarioum4197",
            "text": "All I hear from the judge I&#39;m little b****h"
        },
        {
            "author": "@outlawaz1266",
            "text": "Joe has the palate of a newborn"
        },
        {
            "author": "@Mere135",
            "text": "Man... I want both of the ramen and ramyun (ramyeon?) Tbh... I&#39;d definitely like the spice... The spiciness...If Joe doesn&#39;t respect it, better give it to me (grabby hands)"
        },
        {
            "author": "@himalayahazarika661",
            "text": "Joe acting tough but can&#39;t even handle spice👀"
        },
        {
            "author": "@stevenwolfe3610",
            "text": "That was a meal? it looked more like a tiny snack."
        },
        {
            "author": "@gabrielhicks8043",
            "text": "&quot;Everything looks super elevated&quot; what do you mean by that 🤨"
        },
        {
            "author": "@imperialdra-mon5907",
            "text": "He made it of spicy not white man spicy"
        },
        {
            "author": "@sutnack7537",
            "text": "Joe is a little girl"
        },
        {
            "author": "@Heisenburnt",
            "text": "Joe just a business man w a mouth"
        },
        {
            "author": "@davidbaltazor4045",
            "text": "Too spicy for sissy"
        },
        {
            "author": "@gabrielaviles8833",
            "text": "Mfer has the Gigachad chin."
        },
        {
            "author": "@xxanger911xx5",
            "text": "“Korean-inspired”<br>It is meant to be spicy, there is never too much spice.  Only too weak of people."
        },
        {
            "author": "@johntexan4165",
            "text": "Korean Ramyun is typically very spicy… the judge is just a wuss."
        },
        {
            "author": "@Rxbandit421",
            "text": "Why did you edit it like this? Just keep the end for the end"
        },
        {
            "author": "@remb9614",
            "text": "A white person using spices, we do exist"
        },
        {
            "author": "@LowercaseKev",
            "text": "This is why you let the person finish telling you what they made. 🤣"
        },
        {
            "author": "@RamminRanch",
            "text": "Joe a beta. Not even surprised tbh"
        },
        {
            "author": "@tarottman3926",
            "text": "Ramsey likes it Joe&#39;s likes it Ramsey hates it Joe&#39;s hates it"
        },
        {
            "author": "@liuchangde3093",
            "text": "Thank god there isn&#39;t a cringe joe mama joke"
        },
        {
            "author": "@Bigballinsmouth",
            "text": "I bet ketchup is too spicy for Joe"
        },
        {
            "author": "@jamesneilson4351",
            "text": "I hate food snobbery…."
        },
        {
            "author": "@abingeorge9228",
            "text": "Joe doesn&#39;t have any credibility to be a judge on a cooking competition"
        },
        {
            "author": "@gautamsingha3951",
            "text": "Noodle is an asian dish so use of right amount is paramount and not the white amount."
        },
        {
            "author": "@olive-yello",
            "text": "Bro Korean food is spicy. Gochujang is spicy but it has SO MUCH flavor!! Like c’mon."
        },
        {
            "author": "@thoibayumnam99",
            "text": "Lol all they know is salt and pepper"
        },
        {
            "author": "@AStrangePersonOnline",
            "text": "Joe is just mad that it’s to “swicy” and that it make his tummy huwt"
        },
        {
            "author": "@leorguz1905",
            "text": "It ain’t the chefs fault that the master chefs aren’t good with spicy food!!"
        },
        {
            "author": "@Utubesuperstar",
            "text": "Joe was like oh I don’t like it too spicy and the others were like man stfu that’s flavor"
        },
        {
            "author": "@iityxy",
            "text": "I can’t believe that’s Ariana grande on the top 😂"
        },
        {
            "author": "@plir2128",
            "text": "joes tongue finally felt spice"
        },
        {
            "author": "@iwantabetterworld1759",
            "text": "I know it will be great is right after they finish judging that there’s a show that someone judges them the same exact way to see how they take it"
        },
        {
            "author": "@TheMr.NiceGuy",
            "text": "...isn&#39;t Korean food supposed to be spicy?"
        },
        {
            "author": "@shkai2674",
            "text": "Is joe full American if so it explains alot"
        },
        {
            "author": "@ghostuchiha9786",
            "text": "Man looks good i want some i like spicy food"
        },
        {
            "author": "@faerieSAALE",
            "text": "Kimchi and Shrimp Heads? GAWD I think I&#39;m gonna barf!"
        },
        {
            "author": "@hannafazz2153",
            "text": "Why do people with such low flavor profile get paid to be judges...bland food isn&#39;t good food."
        },
        {
            "author": "@rogansmith8986",
            "text": "Can we have the recipe"
        },
        {
            "author": "@user-xz3hp4gl2w",
            "text": "if you hate the food because it was spicy. you should not be a judge for cooking contest."
        },
        {
            "author": "@kindagory",
            "text": "when a anime fan becomes a chef"
        },
        {
            "author": "@jamesszoer7698",
            "text": "White boy"
        },
        {
            "author": "@User-mn8mj",
            "text": "He can’t handle spice that’s why he lost his hair"
        },
        {
            "author": "@ethanschott4320",
            "text": "Sounds delicious. Anytime I have ever gone for ramen I always face the same problem. It&#39;s not spicy enough. I like Ramen really spicy. I would be interested in trying his recipe"
        },
        {
            "author": "@kobayashid3186",
            "text": "That’s racist to spicy😂"
        },
        {
            "author": "@mygrammieis",
            "text": "Awesome Awesomely yummy looking"
        },
        {
            "author": "@tonyboy8946",
            "text": "Duh, its korean food. Its supposed to be spicy. Bald judge should try the 5x spicy noodle."
        },
        {
            "author": "@shanman3",
            "text": "It’s stupid that they judge on spice because everyone has different preferences and tolerances, just because baldy can’t take the heat doesn’t mean it’s bad lol"
        },
        {
            "author": "@linotorreblanca4557",
            "text": "soup?"
        },
        {
            "author": "@zakiullahkhan9255",
            "text": "Michael is the best in this batch.. he uses fresh ingredients and is really talented 👍"
        },
        {
            "author": "@beverlyostrander9376",
            "text": "Why are Andrew and Nikola arguing about a cooking competition.  CHILL! COOKING EATING AND SHARING ARE GOOD THING&#39;S. JOE ONLY OWNS AND RUNS ABOUT 20 RESTAURANTS.  HE WORKED WITH HIS MOM, LYDIA, FROM THE TIME HE WAS YOUNG. HE DIDN&#39;T START OUT WITH A SILVER SPOON IN HIS MOUTH, LYDIA&#39;S SMARTER THAN THAT. HE STARTED BUSING TABLE&#39;S AND WASHING DISHES. FROM WHAT I&#39;VE READ WHEN HE DECIDES TO BACK AN UP AND COMING CHEF HE GIVES HIS ALL WITHOUT TAKING SHIT OR BEING WALKED ON. QUIT TRYING TO BE A JUDGE."
        },
        {
            "author": "@beverlyostrander9376",
            "text": "I love thus show including all the judge&#39;s. Even Joe. If he wasn&#39;t the way he is the show wouldn&#39;t be as interesting. I ❤️ his Mom&#39;s show to. She&#39;s an incredible Chef specializing in her native Italian cuisine. I&#39;ve learned alot from Gordon Ramsey, Joe and Aaron. For the 7th season they brought other guest Chef&#39;s to help judge. Great show."
        },
        {
            "author": "@R0gueM",
            "text": "Well done Chef! That looked really good and I bet that heat gave the dish a wonderful kick."
        },
        {
            "author": "@aarons.hood_",
            "text": "I’d put a shit ton of Carolina reapers in the dish just for joe"
        },
        {
            "author": "@princebenmillsamera9794",
            "text": "That bald Joe really shouldn&#39;t be on the show of cooking"
        },
        {
            "author": "@slimevvs__1393",
            "text": "Shout out to Chef Aaron For being the most insightful chef on the show. His feedbacks are always great and constructive UNLIKE JOE who gives amateur comments every time"
        },
        {
            "author": "@PoliteTuxedo",
            "text": "Was the the chick from thats so raven on the overhang?"
        },
        {
            "author": "@janmarcosss",
            "text": "bros heart dropped in the beginning you could see it in his face😂"
        },
        {
            "author": "@eddiepark9978",
            "text": "Of course broth itself might be too spicy,  BUT he said its freakin RAMYUN.  You have to eat them all together with noodles+other ingredients…😢"
        },
        {
            "author": "@CsprShorts",
            "text": "As a Korea i approve this dish"
        },
        {
            "author": "@dillonellis5902",
            "text": "If Gordon is satisfied I wouldn&#39;t even acknowledge Joe"
        },
        {
            "author": "@cirrxcirrx1866",
            "text": "I&#39;m the 911th comment"
        },
        {
            "author": "@adityakumarjha9088",
            "text": "Joe is that aunt whose only duty is to find mistakes"
        },
        {
            "author": "@noposguau447",
            "text": "Joe is a wannabe Gordon Ramsey, and tbh, that&#39;s the truth. I dare anyone to challenge that"
        },
        {
            "author": "@randyholcomb2140",
            "text": "What season was this"
        },
        {
            "author": "@deadpooliowolverine7425",
            "text": "Uncle roger: 👁👄👁"
        },
        {
            "author": "@coversbyrichard",
            "text": "Okay. He said Ramyeon. You sir, are awesome."
        },
        {
            "author": "@anhdang6544",
            "text": "Eff that bland-food-eatin arrogant judge.  How tf is the standard for good food get filtered through the mofos with shallow taste buds?😂"
        },
        {
            "author": "@meeu",
            "text": "There is no such thing as spicy for korean dishes. . ."
        },
        {
            "author": "@nikhilbannerjee5126",
            "text": "Why does fine dining most of time looks like scraped leftovers"
        },
        {
            "author": "@joeycamacho6046",
            "text": "Is this new season ?"
        },
        {
            "author": "@KowalskiAnalyasis",
            "text": "&quot;Being the TOP feels really good, I have worked so hard for this&quot; ayo ?!?! 😳"
        },
        {
            "author": "@SANTANA1deep",
            "text": "Spice is nice."
        },
        {
            "author": "@Chickenfeetnomore",
            "text": "Toilet roll was in the fridge that night"
        },
        {
            "author": "@perez5479",
            "text": "Joe  had nothing bad to say buuuut hes got to keep up with his image so .. is too hot for me 😂😂 yea okay"
        },
        {
            "author": "@rainingdeathx3368",
            "text": "<b>&quot;who&#39;s joe?&quot;</b>"
        },
        {
            "author": "@PETER-es4ic",
            "text": "Joe probably thinks celery is spicy"
        },
        {
            "author": "@jafjavier4939",
            "text": "it&#39;s korean, it should be spicy"
        },
        {
            "author": "@jacobquackenbush2981",
            "text": "“The presentation is clever”<br>: just food thrown on a plate"
        },
        {
            "author": "@insideoutsideupsidedown2218",
            "text": "Yeah, toast can be confusing to Joe…."
        },
        {
            "author": "@royaljames3233",
            "text": "The lies and the deceptions a little bit spicy that s*** spicy AF aka baby atomic bomb"
        },
        {
            "author": "@sturmtiger7704",
            "text": "Wow, sounds amazing. No hate on food."
        },
        {
            "author": "@jigo9377",
            "text": "Joe doesn&#39;t know what flavours are.<br><br>These are judges are novice chefs. I don&#39;t see how they&#39;re professional.<br><br>They&#39;re pros in there little space but when they roam the world they&#39;re still UN taught little apprentice&#39;s"
        },
        {
            "author": "@bigjohnhansome5779",
            "text": "These chefs have no idea what real spicy is."
        },
        {
            "author": "@cagethelonewolf",
            "text": "He made it extra spicy to shut Joe up"
        },
        {
            "author": "@carmenrubio6894",
            "text": "JOE IS A CLOWN"
        },
        {
            "author": "@CLB0023",
            "text": "They take food way to serious"
        },
        {
            "author": "@DaveQZ85",
            "text": "&quot;You&#39;re using the crispy little rice noodles as a textural component&quot;<br><br>Yes...that was the intent when they were fried...crispy. Good job. Observant.<br><br>Asians tend to do that with the rice noodles as garnish..."
        },
        {
            "author": "@terencebernard2337",
            "text": "He&#39;s wearing skinny jeans say no more"
        },
        {
            "author": "@Jess-Cruz",
            "text": "Cut the cidio to early or started it too late but I speak for everyone when I say we wanna see what the judges say after they try the food too please and thank u"
        },
        {
            "author": "@orangecrush1208",
            "text": "Joe kinda seems like a jerk from what ive seen, i dont know what experience he has in the kitchen, you cetainly dont need any to tell if somthing taste good but he seems to like nothing."
        },
        {
            "author": "@lupusreginabeta3318",
            "text": "Joe seems really not famous 😂"
        },
        {
            "author": "@rocketeerjakeharrylamayreb6259",
            "text": "Omg I’m such a huge fan congratulations on making it to the finale you have nothing to be ashamed of your passion and dedication and determination are amazing I have no doubt you’ll be a success in the future 😎😎😎😎😎😎👨‍🍳👨‍🍳😀😀😀🎉🎊💯💯💯"
        },
        {
            "author": "@theprocessss",
            "text": "Wow. Those are some tight jeans that guy has on. If this season hasn’t finished yet I hope he doesn’t win. Cmon man, be a MAN"
        },
        {
            "author": "@builditfrom0",
            "text": "Give him bland food . Coz that&#39;s what he deserved ."
        },
        {
            "author": "@taemybae6263",
            "text": "Joe probably never ate korean meals"
        },
        {
            "author": "@trisco900g",
            "text": "Canadian judges are the best!"
        },
        {
            "author": "@dontjudge817",
            "text": "Joe : &quot;judging other  country dish that was accurate as original and not even know how its original taste&quot;.<br>Me: &quot;get your fking Italian dish out of my food!&quot;"
        },
        {
            "author": "@lillyflower1415",
            "text": "I enjoy watching u Michael ur great cook and person"
        },
        {
            "author": "@adamthers1881",
            "text": "Who are those two guys with Ramsey?!"
        },
        {
            "author": "@filipjovanovic1912",
            "text": "what season is this"
        },
        {
            "author": "@StarLeo_",
            "text": "Joe is the human embodiment of a fart"
        },
        {
            "author": "@tenzingtsega9164",
            "text": "Mf thinks whatever they like is only known as food💀"
        },
        {
            "author": "@afrobudda3075",
            "text": "Yo who is this bald dude? I’ve never watched master chiefhonestly because I’m not a fan of watching peoples dreams be torn apart by experts who show little remorse but honestly, I’ve been seeing at lot of these clips and Gordon Ramsey seems to be the genuine teacher who wants all students to do well whilst the other experts (if that) seem to be there for entertainment value"
        },
        {
            "author": "@BamBabyBrenda",
            "text": "Joe should chug the broth"
        },
        {
            "author": "@bellanderson4227",
            "text": "Imma be honest..sometimes I think when it comes to spice with Joe at the very least...he can&#39;t handle it..."
        },
        {
            "author": "@m.m9076",
            "text": "Anyone with a soul patch’s opinion is one not worth hearing"
        },
        {
            "author": "@austinmcphee6022",
            "text": "Like they say if you can&#39;t handle the heat get out of the kitchen LOL"
        },
        {
            "author": "@taylornoblett5359",
            "text": "He went top three this episode"
        },
        {
            "author": "@everytimesheeesh",
            "text": "If you can&#39;t handle the heat then get out of the kitchen.."
        },
        {
            "author": "@KylaFuller",
            "text": "His face said that just smacked tf outta me. It&#39;s okay bro. You&#39;ll be okay."
        },
        {
            "author": "@smileysatanson3404",
            "text": "Idk when its too Spicey for the Mexican chef then its really spicey"
        },
        {
            "author": "@idealess718",
            "text": "Which season is this?"
        },
        {
            "author": "@giannoski6257",
            "text": "I means thats as mixed authentic as it can get"
        },
        {
            "author": "@PotatoToey",
            "text": "Nah bros just got severe white tounge."
        },
        {
            "author": "@degov5",
            "text": "If there&#39;s one thing I&#39;ve learned from watching cooking competitions, it&#39;s be very careful using spices with most judges. Even regular red pepper flakes are too spicy for some of them."
        },
        {
            "author": "@myplateisempty.4292",
            "text": "Yassss that&#39;s what a good amount of Gochujang tastes like."
        },
        {
            "author": "@tomh.2445",
            "text": "Love when they showed how it turned out"
        },
        {
            "author": "@Gsuneow",
            "text": "I never liked Joe because unlike Gordon Ramsay and the other real chefs who busted their ass in the kitchen for hours. Joe actually got that spot because he has a company that manages restaurants, he doesn’t even manage the restaurants he literally hires other people to manage them."
        },
        {
            "author": "@tauhugoreng2929",
            "text": "If real korean eat it... They might say said &quot;This is good for hangovers&quot;"
        },
        {
            "author": "@mattc3233",
            "text": "Gordon looks rough here"
        },
        {
            "author": "@H8_M3",
            "text": "Some foods aren&#39;t meant to be spicy."
        },
        {
            "author": "@albertusaswin2012",
            "text": "Bully Joe could not stand some heat"
        },
        {
            "author": "@victorzoela7879",
            "text": "as soon as he said “Kimchi” I could already feel my ancestors crying"
        },
        {
            "author": "@cookiefoxer",
            "text": "Which season was this i would love to watch it"
        },
        {
            "author": "@MrManzana533",
            "text": "Joe needs to quit being a panzy."
        },
        {
            "author": "@sickening_love1154",
            "text": "Too spicy? Not for me! I love spicy food!"
        },
        {
            "author": "@imamuslim375",
            "text": "Of course it would be spicy"
        },
        {
            "author": "@kuzon34mc32",
            "text": "If you cant handle spicy you not a real masterchef.."
        },
        {
            "author": "@samplesowoopass",
            "text": "Idk, he&#39;s got bottom energy if you ask me"
        },
        {
            "author": "@rajgill7576",
            "text": "OK you cut be a nancyboy as a food judge. It&#39;s like the only rule, leave your own biases out of it"
        },
        {
            "author": "@sleepless2612",
            "text": "Hold on, who&#39;s joe ?"
        },
        {
            "author": "@couththememer",
            "text": "But real question though, who is Joe?"
        },
        {
            "author": "@charlottesphie7037",
            "text": "What season please someone. Wanna see joe once again"
        },
        {
            "author": "@shaneberx5221",
            "text": "To be honest, Joe is a wussy with spicy food..."
        },
        {
            "author": "@mssummerrose1",
            "text": "A dish is a dish and if it&#39;s supposed to be spicy it should be spicy... wtf"
        },
        {
            "author": "@kenversusryu",
            "text": "I like how he says “Japanese style ramen” and “Korean style ramyun”. Extra points."
        },
        {
            "author": "@dannyvue6595",
            "text": "Korean spicy is the most mild Asian spicy ever lmao. Caucasians 😂"
        },
        {
            "author": "@PrajnaIsPrajna-exceptPrajna",
            "text": "Joe is incapable of tasting anything that’s more flavorful than a salted napkin, don’t traumatize him like that"
        },
        {
            "author": "@aqmalnazzim2991",
            "text": "Joe weak can&#39;t beat spicy"
        },
        {
            "author": "@Mabel-BM",
            "text": "Gordon is soooo OLD he&#39;s not aging well😫"
        },
        {
            "author": "@imakeepitreal2214",
            "text": "Nobody has eyes like Michael. So bright and pretty"
        },
        {
            "author": "@Genosisnt",
            "text": "That looks wonderful! I can&#39;t really cook, and Im a brand new mom so I gotta learn quick"
        },
        {
            "author": "@hillarycastillo5594",
            "text": "I don’t trust chefs that stick to one type of cuisine and call other shit trash. Joe isn’t even a chef, he is a Italian wine maker"
        },
        {
            "author": "@matthewbuckingham190",
            "text": "When pompous Italian meats traditional Asia."
        },
        {
            "author": "@aschriner1moon142",
            "text": "Hey Michael your my favorite contestant"
        },
        {
            "author": "@iiburningashii",
            "text": "surprised joe didnt hit him with the “they dont have spice in Korea”"
        },
        {
            "author": "@chijaytavaakachija1513",
            "text": "Kemchi is hot. What did joe expect. Eat some in Korea, you&#39;ll have the same reaction and I love hot food."
        },
        {
            "author": "@mr.dr.sir.560",
            "text": "Joe is such a fake tough guy u can tell he was the least favorite kid out of the family"
        },
        {
            "author": "@leaveleague3491",
            "text": "This would be perfect for us but not some Italian who don&#39;t play with spicy"
        },
        {
            "author": "@Kid_Ikaris",
            "text": "So this is what Carlos Mencia ended up doing"
        },
        {
            "author": "@edipasplays",
            "text": "Never make spicy food for white people. Ever! Even boiled carrots are too spicy for them. C&#39;mon Micheal. I thought you knew this already!"
        },
        {
            "author": "@CptDuck",
            "text": "Should it be Ramyun or Ramyan?"
        },
        {
            "author": "@Theproclaimed",
            "text": "Isn’t Korean food spicy by default?"
        },
        {
            "author": "@zipzipperton2598",
            "text": "No such thing as a soup broth being too spicy... 😋"
        },
        {
            "author": "@rizsley",
            "text": "who&#39;s Joe?"
        },
        {
            "author": "@Rayrulesohye",
            "text": "The British version of this show is a million times better"
        },
        {
            "author": "@Rennyyl",
            "text": "I always hated Joe, no idea how to cook, living off his families business name, and was a genuinely terrible guy. He did shit like throw away peoples plate without even tasting it first because he <b>personally</b> didn’t like the presentation"
        },
        {
            "author": "@SenpaiOG_69",
            "text": "Joe finally realised that there are different flavour other than sweet"
        },
        {
            "author": "@oompaloompa6579",
            "text": "Well, ngl asian loves watching these American specimens butchered our dish 👀"
        },
        {
            "author": "@Apollyon47",
            "text": "Pffft that is spicy?<br><br><br>Come onn, looks like you eat too much sweet"
        },
        {
            "author": "@nothiiiiiiiing",
            "text": "Spicey"
        },
        {
            "author": "@candidate3512",
            "text": "Is it really that spicy or just white spicy..."
        },
        {
            "author": "@reporter8746",
            "text": "Who&#39;s Joe"
        },
        {
            "author": "@lilliana32y.0-checkmyvdeo4",
            "text": "The bald dudes eyes teared up 😂 we all know that dish was fire"
        },
        {
            "author": "@themad-lad",
            "text": "They need white about of flavour not right amount of spices 😂"
        },
        {
            "author": "@Sad-ms5bl",
            "text": "If iw as there . I will never low the level of spicy for the judge . Sorry but . I gonna respect the spicy level from the original recipe"
        },
        {
            "author": "@weirdluck3312",
            "text": "Fun fact: Joe isn&#39;t even a chef and doesn&#39;t eat normal food but instead high quality so if a normal pantry has normal eggs he eats high grade eggs which are more elevated and that means that he judges off of inexperience, different quality and egotistical values"
        },
        {
            "author": "@froighibli7549",
            "text": "Childish Joe"
        },
        {
            "author": "@quinncykaluzniak5429",
            "text": "Shoulda warned him about the kimchi"
        },
        {
            "author": "@ChocoRon",
            "text": "Baldi isn&#39;t even a chef wtf he doin there 💀"
        },
        {
            "author": "@PapiGwon",
            "text": "Didn’t even know he had a YouTube. Bring it home bro you’re almost there"
        },
        {
            "author": "@DignanDurden",
            "text": "bro&#39;s pasty ass couldn&#39;t handle the heat💀💀"
        },
        {
            "author": "@mikajasin5399",
            "text": "Spicy?? Its Sweet"
        },
        {
            "author": "@rjkrish4586",
            "text": "I thought the guy behind on the thumbnail was rikishi"
        },
        {
            "author": "@yuzakikobayashi1895",
            "text": "Imagine being so privileged to the point that anything taste good is just not good enough."
        },
        {
            "author": "@Lucifers_gates",
            "text": "Joe hella white lol"
        },
        {
            "author": "@KyXnline",
            "text": "Every single time I&#39;ve seen this Joe dude, he&#39;s never given me the impression that he understands food. He&#39;s so uninspired, uninsteresting, annoying, and on top of being all of that he has a completely unjustified arrogance around him. <br>Joe. You are not that guy. You never will be that guy. Please stop showing up in my shorts. This is the least annoying clip I&#39;ve seen of you yet, and it&#39;s you(a judge) completely lacking the ability to judge."
        },
        {
            "author": "@mlgamingnaga9178",
            "text": "Too spicy for the little girl."
        },
        {
            "author": "@drekwilliamton5830",
            "text": "&#39;Wow&#39; is code for: my mouth is on fire and I don&#39;t want to talk more than I have to"
        },
        {
            "author": "@adityamorey728",
            "text": "Bland food eaters trying flavor for the first time LOL"
        },
        {
            "author": "@karmaQT",
            "text": "American MasterChef is hilariously bad 😂"
        },
        {
            "author": "@NFGate",
            "text": "&quot;Looking forward to trying it...&quot;<br>(Legend has it, they&#39;re still trying it.)"
        },
        {
            "author": "@_feara",
            "text": "he looks so happy ugghh I like Michael"
        },
        {
            "author": "@PureGrime616",
            "text": "Joe is such a ween"
        },
        {
            "author": "@destinyabz1247",
            "text": "You just got a new subscriber, keep on grinding 💪, you just chill like that"
        },
        {
            "author": "@Drunk_Karen",
            "text": "I thought one dude was  George Lopez for a second. I was confused."
        },
        {
            "author": "@madeyoulook4689",
            "text": "A white dude, a Mexican, and a British judging Korean ramyun lol"
        },
        {
            "author": "@FrostThorn",
            "text": "Joe is a joke why dies his opinion even matter? He can&#39;t even cook probably doesn&#39;t even know what half the food is"
        },
        {
            "author": "@kgkingdom8035",
            "text": "I wanna try it"
        },
        {
            "author": "@kingofthrones_2835",
            "text": "Everyone when  someone gets embarrassed:🤣👉<br>Everyone when someone does a good job 👏😒"
        },
        {
            "author": "@markglez6785",
            "text": "What season is this?"
        },
        {
            "author": "@richardriddick5916",
            "text": "Weak ppl can&#39;t handle spice"
        },
        {
            "author": "@trung1418",
            "text": "666th comment"
        },
        {
            "author": "@RikkertdePikkert",
            "text": "I thought I was watching the office after that “alright Michael”"
        },
        {
            "author": "@peeloffyourskin",
            "text": "There&#39;s a black dude named &quot;Christian&quot;.... wow 👏"
        },
        {
            "author": "@B3N7221",
            "text": "Just &quot;wow&quot; lol. Like &quot;fuck, good or bad man good or bad????&quot; 😂"
        },
        {
            "author": "@thedarkwhisper2206",
            "text": "It is korean dish, what do you expect? I said it once, I said it again. Never ever take western chef opinion on Asian dish. Just don&#39;t. Most of the time, they would just try to westernise it somehow."
        },
        {
            "author": "@i3eastxskill323",
            "text": "Which season"
        },
        {
            "author": "@RENOX.",
            "text": "I don&#39;t think anyone should judge your cooking u know and the customer know your taste it&#39;s fine ik it&#39;s a competition, but I don&#39;t like Gorden ramesey the way it treats the competitors"
        },
        {
            "author": "@veginito9927",
            "text": "Joe has a baby mouth, there&#39;s a few times Gordon disagrees and joe back pedals"
        },
        {
            "author": "@williamjohnson7226",
            "text": "Spicy food is the best though"
        },
        {
            "author": "@Embarblaze",
            "text": "Joe who?"
        },
        {
            "author": "@jessicalin9446",
            "text": "Its not Korean food unless you mouth is burning like a forest fire"
        },
        {
            "author": "@christi-janhendriks3126",
            "text": "Damn Michael, you cute though"
        },
        {
            "author": "@rapmonster3142",
            "text": "What show is this ????"
        },
        {
            "author": "@Smokey_____",
            "text": "How you a chef and can’t handle hot"
        },
        {
            "author": "@distritochristianangeloa.157",
            "text": "What masterchef season is this?"
        },
        {
            "author": "@bananathebread4678",
            "text": "Who’s Joe?"
        },
        {
            "author": "@stoneypatchkid7734",
            "text": "What episode is this from?"
        },
        {
            "author": "@deaths_night_mare6041",
            "text": "It was so spicy he grow hair"
        },
        {
            "author": "@djdoublek3689",
            "text": "Masterchef is 🔥, me and my boys really rooting for Michael."
        },
        {
            "author": "@deyh5664",
            "text": "People can be so pretentious about food lol..."
        },
        {
            "author": "@cool-a_potatoe69",
            "text": "The judge Tryna act all cool with the technical words"
        },
        {
            "author": "@beverlydominguez3233",
            "text": "Damn is it just me or is Gordon hulking it up ....his biceps are sticking out 🤔"
        },
        {
            "author": "@Xreboyzre",
            "text": "Joe is a Walmart Italian"
        },
        {
            "author": "@t_zlayen3386",
            "text": "✝️💖Jesus Christ is the same yesterday, today, and forever.<br>Hebrews 13:8 NLT<br>God saved me from homosexuality, hatred,a lying tongue, and theft<br>He saved me from eternal pain and suffering of hell. He sent his one and only Son Jesus Christ to die for all of our sins as a once and final sacrifice of sins. The Lord loves is all so much to send his one and only Son to die for our sins. He loves you. Repent of your sins and turn to him✝️...."
        },
        {
            "author": "@csc7345",
            "text": "Thank you so much for different pronunciation between ramen and ramyun 🙏"
        },
        {
            "author": "@jaybird7616",
            "text": "Joe is just a crybaby lol"
        },
        {
            "author": "@mohammadsyazwigeoffrey7325",
            "text": "Little did they knew before disaster “A little bit spicy” was an understatement"
        },
        {
            "author": "@scottakanumba1heathen379",
            "text": "Shrimp heads?"
        },
        {
            "author": "@nEver_asked",
            "text": "Any Indians watching this be like. That&#39;s spicy??"
        },
        {
            "author": "@yueshijoorya601",
            "text": "Joe&#39;s words mean nothing on this show, I just pretend he&#39;s not there. He&#39;s an audial and visual nuisance."
        },
        {
            "author": "@sibusiso2841",
            "text": "Yall really don&#39;t like Joe💀"
        },
        {
            "author": "@obanai1130",
            "text": "&quot;too spicy for joe, JOE MAMA!!!&quot;"
        },
        {
            "author": "@PinguNook",
            "text": "I cannot take the bald guy seriously 😂 wtf why is he wearing a suit and white trainers ?"
        },
        {
            "author": "@ronaldallanpena5778",
            "text": "Joe thinks he know everything about food"
        },
        {
            "author": "@datsweetsansabooty",
            "text": "George Lopez hosting cooking shows now?"
        },
        {
            "author": "@guyknack",
            "text": "Joe who?"
        },
        {
            "author": "@BlueStreakStudio",
            "text": "Watching Joe suffer from that spice brought me great joy."
        },
        {
            "author": "@SaintShieldWolf",
            "text": "What’s the dog whisperer doing there"
        },
        {
            "author": "@seek_strangeniss",
            "text": "This is hilarious, this don&#39;t need to be taken seriously is it great it is it fast food worthy simple"
        },
        {
            "author": "@Juni_Bowman",
            "text": "Ah, I love the part where they actually try the food, it was amazing"
        },
        {
            "author": "@gamerzone0764",
            "text": "Spicy for joe? My dad calls that a fuckin custard"
        },
        {
            "author": "@fardrives",
            "text": "Joe&#39;s the 2nd best judge in the show&#39;s history.. don&#39;t @me"
        },
        {
            "author": "@zacharyjackson1829",
            "text": "Can&#39;t blame the poor guy. Dude is so &quot;Italian&quot; the only way he&#39;s probably ever experienced heat was a couple of dashes of chili flakes on his pizza.....oh I&#39;m sorry I meant Flatbread 😉"
        },
        {
            "author": "@Xx-MNKY-xX",
            "text": "Holy fuck that shut looks real good"
        },
        {
            "author": "@badonshrimp6851",
            "text": "JOE PONDAN"
        },
        {
            "author": "@rayjordun",
            "text": "Something I heard one of my Chefs say once was that a spicy dish shouldn&#39;t feel spicy until the third bite. The idea is so it&#39;s not over powering. We serve alot of people who aren&#39;t comfortable with spice of course, so that&#39;s important. But if a dish is meant to be spicy nock socks off. This dish looks beautiful"
        },
        {
            "author": "@Thunder_God_Eneru",
            "text": "He&#39;s got an amazing beard"
        },
        {
            "author": "@apolloisnotashirt",
            "text": "“Remember nieces and nephews, use the right amount not the white amount.”<br><br><br><br>-Uncle givememoney."
        },
        {
            "author": "@alucarddracula9999",
            "text": "Joe the extra xd"
        },
        {
            "author": "@slbshadow",
            "text": "Tbh that looked really amazing"
        },
        {
            "author": "@aydenpeeken1343",
            "text": "He kinda looks like John seed from far cry 5"
        },
        {
            "author": "@garbagemusic487",
            "text": "His face when he had to keep it in"
        },
        {
            "author": "@ScrotumBalls",
            "text": "Gordon, Bald gay Italian and Mexican guy who sometimes forget to speak with a Mexican accent."
        },
        {
            "author": "@tylergoodland4289",
            "text": "Nice editing."
        },
        {
            "author": "@UGLYUGG",
            "text": "Joe wants to be Gordon so bad"
        },
        {
            "author": "@Don_2424",
            "text": "Master chef Australia is much much more challenging than master chef us"
        },
        {
            "author": "@CS-hr8kr",
            "text": "I can&#39;t stand when people be like spicy this and that on their menu and then no spice so I applaud him for giving Joe that reaction because he&#39;s a true Chef he doesn&#39;t water down his food to please people you want Spice you get spice"
        },
        {
            "author": "@kankanmwah",
            "text": "Holy shit it&#39;s Chef Mike"
        },
        {
            "author": "@krap101",
            "text": "Doesn&#39;t sound spicy"
        },
        {
            "author": "@juanm849",
            "text": "That girl on top looks like a young raven simone"
        },
        {
            "author": "@Th3Downz",
            "text": "I&#39;ve never watched a full episode of this show but have seen many clips. God Joe fucking sucks"
        },
        {
            "author": "@Cloud987600",
            "text": "Was that? That so Raven?"
        },
        {
            "author": "@weenharmustafi5489",
            "text": "I want all masterchef judges sit in chairs and slap them till their faces are swollen and then ask them to put their tongue out and uppercut their chin and then I’ll tell them to pronounce ‘bro’ with their mouth open and if it doesn’t sound like they are saying bro they will get 15 whips in the face"
        },
        {
            "author": "@matty808pyro8",
            "text": "When it comes to spiciness: Use the right amount not the white amount - Uncle Roger<br><br>I&#39;m Asian, I LOVE spicy dishes, nothing is ever too spicy imo. You did a damn good job for a non asian!"
        },
        {
            "author": "@Gameswithmarc",
            "text": "Why cut the clip … bad edit"
        },
        {
            "author": "@topking403",
            "text": "He&#39;s too big to be so feminine"
        },
        {
            "author": "@EnderalRocks",
            "text": "Joe is a fake judge and chef"
        },
        {
            "author": "@mostly._.human2275",
            "text": "God and Jesus love you.."
        },
        {
            "author": "@OGPeanutbutter",
            "text": "Yall see the brown skin lady in the balcony??!!?!? 😍😍😍😍😍😍😍😍😍😍"
        },
        {
            "author": "@K1lly",
            "text": "Joe is hands down the worst judge ever. It’s like he doesn’t enjoy food, period."
        },
        {
            "author": "@freashswagg1",
            "text": "Them guys know nothing of food"
        },
        {
            "author": "@kipchickensout",
            "text": "&quot;the presentation is clever&quot;<br><br><b>literally on top of eachother like anyone would&#39;ve done</b>"
        },
        {
            "author": "@r4ng3rd3thr0w",
            "text": "That beard loos better than the food. Fr."
        },
        {
            "author": "@10thgenmando",
            "text": "Joe one of the worst judges n very rude , tried too much to act like Gordon"
        },
        {
            "author": "@llReggie",
            "text": "If you don’t think someone is gonna like your food make it incredibly spicy"
        },
        {
            "author": "@ipeefreely2364",
            "text": "What a 🐱🐱🐱🐱"
        },
        {
            "author": "@RealKingDubb",
            "text": "What season is this"
        },
        {
            "author": "@RipYourRoll",
            "text": "I hate to be mean, but honestly people that can&#39;t handle any level of spice are weak af."
        },
        {
            "author": "@susqadesh4321",
            "text": "Yeah chef Michael! Science!"
        },
        {
            "author": "@darrendelanois3600",
            "text": "Joe is like my stepdad <br>He loves making everybody around him unhappy"
        },
        {
            "author": "@slimycat534",
            "text": "It is traditional in Japanese culture to make it really spicy"
        },
        {
            "author": "@Yrnsmoove",
            "text": "Who’s the beautiful black woman tho?"
        },
        {
            "author": "@goldleader4735",
            "text": "So this is where Andrew tate originated from"
        },
        {
            "author": "@Mr420smoker666",
            "text": "You call your self a Joe"
        },
        {
            "author": "@aninnocentbystander0",
            "text": "The thing about Korean food is, if it doesn&#39;t burn going in, and then burn going out, it&#39;s definitely not spicy enough"
        },
        {
            "author": "@tygerstripes",
            "text": "It looked so goooood. I bet it tasted fire"
        },
        {
            "author": "@seccsycabbage2979",
            "text": "So spicy he finally close Joe&#39;s mouth. My god can that phony Italian meatball complain"
        },
        {
            "author": "@Barry_Macaque",
            "text": "Why does that container say &quot;delivered by Grubhub&quot;"
        },
        {
            "author": "@AdityaSingh-bi3nw",
            "text": "Season?"
        },
        {
            "author": "@tenzinwangjor5079",
            "text": "Joe is a face you want to punch really hard lol"
        },
        {
            "author": "@TohtoriP",
            "text": "He definently sounds like a humble giant"
        },
        {
            "author": "@rme1383",
            "text": "So what was the result?"
        },
        {
            "author": "@RiftRaid",
            "text": "Can&#39;t handle spice lol as our great uncle said just eat bland food"
        },
        {
            "author": "@Fumy22",
            "text": "Why every cooking show has to have one judge that is bald and insufferable?"
        },
        {
            "author": "@incognito1783",
            "text": "Africans and Asians know what spice is. As someone who went abroad a couple of times, I&#39;d know-"
        },
        {
            "author": "@michaelangelosumang1617",
            "text": "Cooking using Asian when you are not.Stop using us.Use Italian etc coz it might fit you but please not ours.I feel disgusted"
        },
        {
            "author": "@surajthakur401",
            "text": "I wonder its American too spicy or asia too spicy"
        },
        {
            "author": "@youngbloodnba",
            "text": "Joe is white"
        },
        {
            "author": "@MikeRetroModz",
            "text": "What season is this?"
        },
        {
            "author": "@tigersmith12",
            "text": "I really love the part where they tasted the broth"
        },
        {
            "author": "@theonepieceisreal8878",
            "text": "He looks like the chad filter"
        },
        {
            "author": "@annabelgrace1267",
            "text": "I want the recipe for the broth."
        },
        {
            "author": "@SavannahBooo",
            "text": "I&#39;m gonna be on season 13!!"
        },
        {
            "author": "@timmann111",
            "text": "Why is it backwards... talk about terrible editing"
        },
        {
            "author": "@eeshansajjad",
            "text": "Too spicy for &quot;Joe&quot; more like too spicy for Joe mama<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>I know I&#39;m not funny and have ADHD and depressed but plz laugh<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>This was a joke so don&#39;t take seriously and I don&#39;t have depression I think 🤔"
        },
        {
            "author": "@BWTECH0521",
            "text": "Wow he pronounced Japanese Ramen and Korean Ramyeon differently. I cannot believe that just happened. Props to this dude. He actually studied it."
        },
        {
            "author": "@suicasu3514",
            "text": "Italian is Joe&#39;s personality trait."
        },
        {
            "author": "@pixelsbyobrince5606",
            "text": "Wow, I didn&#39;t know the dog whisperer is a chef"
        },
        {
            "author": "@NationOfMasturbation",
            "text": "Korean food is supposed to be spicay"
        },
        {
            "author": "@prashantmanoram7059",
            "text": "What season of masterchef is this"
        },
        {
            "author": "@harold9421",
            "text": "Who is joe?"
        },
        {
            "author": "@CameronGuarino",
            "text": "i still can’t believe joe lasted more than a few episodes. frankly i’m surprised they even hired him in the first place, he’s not even a chef, he’s just an italian guy who owns a couple restaurants and a wine company."
        },
        {
            "author": "@knightjia97",
            "text": "Ah yes the good old not showing the results"
        },
        {
            "author": "@jungkookjeon-16",
            "text": "The flavor of kimchi to be honest is best and joe cant handle that flavor"
        },
        {
            "author": "@karthiksharma2296",
            "text": "He&#39;s too weak for the true Asian flavours"
        },
        {
            "author": "@saqibmudabbar",
            "text": "This show would be 100x better if Gordon Ramsey was the only judge."
        },
        {
            "author": "@HTgBoomerPro",
            "text": "I like the part where they try it"
        },
        {
            "author": "@mlz_c",
            "text": "this reminds me of food wars"
        },
        {
            "author": "@ankhenaton7197",
            "text": "That is Asien kitchen that is Hot, nothing for wimps!"
        },
        {
            "author": "@vimlajah3684",
            "text": "What I dnt understand y shld Asians reduce spice.. Respect originality.. Do Italians reduce sauce in pasta.. No Europeans respect zer dish originality n Nt of others"
        },
        {
            "author": "@Alex-ih9lc",
            "text": "Dang bro you really didn’t cut the ending in, I gotta block"
        },
        {
            "author": "@Korben999",
            "text": "What season is this?"
        },
        {
            "author": "@gigachadsbigbrother92",
            "text": "Why do i have the feeling that i know why he cut out Ramsey Gordons part?"
        },
        {
            "author": "@mhorrissmanahan8718",
            "text": "Korean food ahhh its got spicy flavor why because spicy its a great source of heat"
        },
        {
            "author": "@karmanyasingh3604",
            "text": "Joe Who?"
        },
        {
            "author": "@ShootNowAskLater01",
            "text": "Joe has no idea wtf he is doing. He’s just there to make an exasperated face then fall in line with whatever Ramsay’s judgment is."
        },
        {
            "author": "@erikvymetal455",
            "text": "I liked MasterChef but Its just Luck if you dont lose or win"
        },
        {
            "author": "@josswagdepimpdaddy5467",
            "text": "Sorry but that emoji looks like someone getting off on sniffing."
        },
        {
            "author": "@shaamilthattayil",
            "text": "I thought I was the only one who disliked Joe for his behaviour and mannerisms. Reading through these comments, I realise that I&#39;m part of a whole army!"
        },
        {
            "author": "@soggyperch",
            "text": "No one can beat a spicy foods"
        },
        {
            "author": "@adityasolanki5326",
            "text": "He&#39;s used to eating tomato sauce and cheese, noting else"
        },
        {
            "author": "@antsensei1481",
            "text": "is this season12?"
        },
        {
            "author": "@Eclipse-lw4vf",
            "text": "Genuinely hate when joe is a judge"
        },
        {
            "author": "@french_toast223",
            "text": "Mexican brother knows real food, white boy couldnt handle it"
        },
        {
            "author": "@r.veerendrasingh5785",
            "text": "Joe who?"
        },
        {
            "author": "@phurailatpampaonasharma2594",
            "text": "People who can&#39;t tolerate mild spicy are pu**y, there is no taste if food is not spicy"
        },
        {
            "author": "@hangnyung0329",
            "text": "Bro awesome!!!! Korean flavorrrrrrssss!!!"
        },
        {
            "author": "@adamgrimsley2900",
            "text": "This programme is awful"
        },
        {
            "author": "@ESNN20",
            "text": "Not a fan of Joe, not even a chef and not really even qualified to judge things outside italian foods and steak. Should of brought Elliot back"
        },
        {
            "author": "@dhcjduendncudjsbdcjdjsnjdj7340",
            "text": "We all know that show is fake"
        },
        {
            "author": "@praayyee4202",
            "text": "Panthoen really wanna be a baker"
        },
        {
            "author": "@Zeradias",
            "text": "Bro Joe needs to go<br>Bring back the big nigga who got skinny"
        },
        {
            "author": "@hardcoregaming7467",
            "text": "Almost lost his eyebrows 💀"
        },
        {
            "author": "@sandk7969",
            "text": "Ohh Joe wouldn&#39;t be able to handle Malaysian, Indonesian, Singaporean, and Thai&#39;s food."
        },
        {
            "author": "@dro206NGM",
            "text": "Joes opinion doesn’t even factor so don’t worry about him he couldn’t tell salad from steak"
        },
        {
            "author": "@siamresidency4231",
            "text": "So are we all gonna trust this white Italian bald guy about this Korean dish being too spicy? This softcock clearly never tried real chillies before. All he ever had in his life were pastas, cheese and some vegetables with wine. What a joke really !"
        },
        {
            "author": "@Tropicaltip",
            "text": "Love the part where Joe burnt the living hell out his tongue"
        },
        {
            "author": "@VedicDesi",
            "text": "Nothing about what he was describing was classic or traditional. I used to like these shows but I realize now they are just propaganda to entice the average person into fusing food and destroying culture and traditional methods and recipes. It makes the world easier homogenize and eventually take over When we lose our origins and roots."
        },
        {
            "author": "@samdaman9214",
            "text": "God Joe is such a little girl"
        },
        {
            "author": "@nagashimah-justin5508",
            "text": "When the judges are asian : incredible  , you stay"
        },
        {
            "author": "@Remiiloves_eggs",
            "text": "Of course he is …"
        },
        {
            "author": "@AdelLevi",
            "text": "Joe dude probably just an investor of some sort that&#39;s why he&#39;s in there. such a not so qualified judge"
        },
        {
            "author": "@jakec1943",
            "text": "IDK if Joe has ever had Korean! It&#39;s not exactly lacking in flavor / spice haha."
        },
        {
            "author": "@joshmcdevitt137",
            "text": "Is he wearing jeggings ? Noicccce"
        },
        {
            "author": "@davidchambers7530",
            "text": "I didn’t know Ramsay could become more wrinkled hahaha what the hell he’s like a halloween mask hahaha"
        },
        {
            "author": "@whiteknights8812",
            "text": "Joe really rocking that Andrew tate look and stupidity"
        },
        {
            "author": "@Eat_My_Bum",
            "text": "They don&#39;t even know actual Korean food if they say it&#39;s too spicy, so fucking pretentious,<br>Kudos to Michael"
        },
        {
            "author": "@Gutta2016",
            "text": "&quot;Wow&quot;. I now dismiss myself as my tongue has been misplaced"
        },
        {
            "author": "@hussamtastic7621",
            "text": "IS THAT FUCKING RAVEN FROM THAT&#39;S SO RAVEN"
        },
        {
            "author": "@Alkaris",
            "text": "Joe has never had spicy fermented paste before or any Korean dish that has lots of spice."
        },
        {
            "author": "@michaelmayers3622",
            "text": "The back girl is fine"
        },
        {
            "author": "@c3tito753",
            "text": "Joe has the palate of a raccoon I still don&#39;t understand how he got that job"
        },
        {
            "author": "@jejakamalaya1484",
            "text": "Joe can run businesses  but he aint for the show."
        },
        {
            "author": "@countryboycolton4532",
            "text": "Great job u deserve to win 🏆"
        },
        {
            "author": "@christopherbolanos2480",
            "text": "Was that Raven symone"
        },
        {
            "author": "@Ethian315",
            "text": "I&#39;ll just don&#39;t recommend this to <br>My short. Ridiculous"
        },
        {
            "author": "@defs8073",
            "text": "Irritating"
        },
        {
            "author": "@markjensen8207",
            "text": "This dish would probably cost $100 😂"
        },
        {
            "author": "@matthewsmith5374",
            "text": "They showed the end at the beginning and it made me think I was more high than I already am."
        },
        {
            "author": "@Fevah5",
            "text": "“RamYunYunyun….yun” - Amy from Amy’s Baking Company"
        },
        {
            "author": "@saxgarcon734",
            "text": "I bet Joe needs a glass of milk when he eats ice cream, it might be a bit too spicy for him."
        },
        {
            "author": "@Myrtlebeachskyline",
            "text": "I can’t stand him."
        },
        {
            "author": "@dexterbonaparte8163",
            "text": "that first “wow” is soo powerful, is it good?!!!is it bad?!?!?! that wow will change this man’s life for better<br>or for worse"
        },
        {
            "author": "@religiontb324",
            "text": "Not everyone can handle it doesn’t mean it’s bad just weak"
        },
        {
            "author": "@whitedevil5885",
            "text": "Italians don&#39;t like spicy"
        },
        {
            "author": "@jesusfuentes9347",
            "text": "If spicy is too spicy for you or you cant eat spicy foods at all then you shouldn&#39;t judge spicy foods."
        },
        {
            "author": "@fight8the8feeling8",
            "text": "Joe is easily the worst judge in the history of Masterchef."
        },
        {
            "author": "@itsmrhunter",
            "text": "If you can&#39;t take the heat, stay outta the kitchen Joe"
        },
        {
            "author": "@h22hh2hwhw2",
            "text": "Actually I paused it looks fuckikg shite to be honest and I&#39;m.half way or korevtyrew a bottle of wine so that should look that good I should be able to smell it threw the phone screen"
        },
        {
            "author": "@jmc224",
            "text": "Uhhhh sounds like ingredients in our soups for sure in Korea."
        },
        {
            "author": "@kanieloutis5604",
            "text": "The only spice that bald judge can handle is pumpkin spice."
        },
        {
            "author": "@Manii21",
            "text": "The bald guy is prob the worst judge there. Feels like he judges of his own taste buds, not if the dish is even good or not"
        },
        {
            "author": "@EssEsss4",
            "text": "honestly if he got that deduction i call the show a sham. just because a judge is too weak for spice doesn’t make a dish intolerable."
        },
        {
            "author": "@YoukaiFofo",
            "text": "In Uncle Roger&#39;s voice &quot;too spicy? No such thing. Why you so weak? Sooo weak&quot;"
        },
        {
            "author": "@oscarspieceofmind1885",
            "text": "He&#39;s like &quot;wow (I&#39;m a bitch)&quot;"
        },
        {
            "author": "@nicholashelms2395",
            "text": "If you can&#39;t handle spicy food you shouldn&#39;t be a judge on a cooking show."
        },
        {
            "author": "@tr.mateomusic",
            "text": "When you realize only the white guy found it spicy"
        },
        {
            "author": "@darcywilson1726",
            "text": "At least Joe keeps his mouth shut when eating now."
        },
        {
            "author": "@FIT_.NERDIE",
            "text": "If korean food isnt spicy then its not korean.....…...."
        },
        {
            "author": "@LvlyTunesNFlixx",
            "text": "Someone drop the full video please"
        },
        {
            "author": "@ThouArtOfWar0724",
            "text": "Please keep Jo&#39;s off this show he&#39;s not even a chef"
        },
        {
            "author": "@dbongoloid9541",
            "text": "The Shanika chick legit look like raven, she&#39;s gorgeous"
        },
        {
            "author": "@deonwoode-amissah8806",
            "text": "what season?"
        },
        {
            "author": "@agb5003",
            "text": "joe the whitest dude ever 💀"
        },
        {
            "author": "@CommanderGreyFox",
            "text": "I don&#39;t think that was the right choice in emoji"
        },
        {
            "author": "@benscott19841",
            "text": "Is there a link to a longer version?"
        },
        {
            "author": "@PistolTCG",
            "text": "Looked really good, imo"
        },
        {
            "author": "@ShaulDawg",
            "text": "I&#39;m sorry, but that shit sounded gross 🤮"
        },
        {
            "author": "@ZekeBarzahd",
            "text": "This short is so fuckin unstructured lol"
        },
        {
            "author": "@cynicaloptimism4048",
            "text": "Joe couldn’t tell the difference between risotto and a dead rat"
        },
        {
            "author": "@thomasflores7817",
            "text": "The absolute retardery of having a judge for a cooking show that cannot cook himself"
        },
        {
            "author": "@mrs.dr.spencerreid3992",
            "text": "“Shrimp heads”?!?!  I don’t eat seafood. However, aren’t the heads undesirable?!?"
        },
        {
            "author": "@tyrelsnider4397",
            "text": "Joe is a waste of a judge on that show honestly 🙄"
        },
        {
            "author": "@dopeboy_sb1429",
            "text": "how joe be tasting anything don’t shit be on his spoon"
        },
        {
            "author": "@eduardosanchez7850",
            "text": "It’s hard to cook with spice when your tolerance is so high"
        },
        {
            "author": "@jepe9666",
            "text": "Spicy is not a problem here , as a judges you must know that spicy is a characteristic for every asian dish .. good job"
        },
        {
            "author": "@stateyourbuisness1928",
            "text": "Joe is one of the worst judges in television history. He tries so hard like literally makes me cringe at how hard he tries to be gordon ramsay or simon cowell. He has a shit pallett to be judging stuff and he is always off with his takes"
        },
        {
            "author": "@Ayam23473",
            "text": "The fire was shining on his head because of the heat"
        },
        {
            "author": "@youngkwak9931",
            "text": "Respect to this man for making korean food"
        },
        {
            "author": "@sharrukhahmed",
            "text": "Korean food is spicy"
        },
        {
            "author": "@911norman",
            "text": "Why is it delivered by grubhub?"
        },
        {
            "author": "@melzawl1990",
            "text": "What is a dish without spice..."
        },
        {
            "author": "@leighridgway1791",
            "text": "Korean inspired anything is brilliant!"
        },
        {
            "author": "@abigbang5971",
            "text": "Brits and large portion of Americans can’t handle spice i bet that roman dish was not even that spicy"
        },
        {
            "author": "@brokenbiscuit3609",
            "text": "&quot;Being the top feels really good&quot;<br>You know it, brother"
        },
        {
            "author": "@chrisg3193",
            "text": "Koodos to the people for not assaulting Joe, cause he’s a delusional goof that thinks the show is centered around him 😂"
        },
        {
            "author": "@isaacloftus1791",
            "text": "May God and Jesus bless you"
        },
        {
            "author": "@lajibolala1052",
            "text": "He added the right amount,not the white amount👍😂😉"
        },
        {
            "author": "@tajdagostino8566",
            "text": "Leave it to a bias judge or a subjective taste to dislike your dish smh"
        },
        {
            "author": "@ignantxxxninja",
            "text": "Korean pronunciation is La-myun.<br>He got the second part right, but it’s not pronounced with an R even though it’s spelled ramyun"
        },
        {
            "author": "@teddyted2806",
            "text": "Bruh joe an asshole to be an asshole. At least when Gordon is an asshole he usually follows it with tough love constructive criticism."
        },
        {
            "author": "@mystictimewarp9831",
            "text": "He jihp when they complimented him did you hear that &quot;mmhmm&quot; 😆"
        },
        {
            "author": "@7asoon2002",
            "text": "What season is this from"
        },
        {
            "author": "@lokimtg5976",
            "text": "It&#39;s korean food bro it&#39;s going to be spicy and or sour"
        },
        {
            "author": "@guislarcia6423",
            "text": "That’s how you know Joe is whiter than marshmallow fluff. Andrew Tates long lost brother"
        },
        {
            "author": "@noblenumenorean5165",
            "text": "Having Joe as a judge was ridiculous"
        },
        {
            "author": "@lqtmn",
            "text": "Bastianich is why I don&#39;t watch this show. He just sucks too much."
        },
        {
            "author": "@abukariba",
            "text": "Why is ceasar milan a judge lmao"
        },
        {
            "author": "@hawklebird4939",
            "text": "Joe was the least qualified to be a judge and I don&#39;t have any qualities other than cooking for 10 years"
        },
        {
            "author": "@Kazuma0915",
            "text": "Bruh that bald head dude can&#39;t be judge. Is he even a chef? I mean this kind of shows needs chefs to be the judges. Wouldn&#39;t trust somebody to judge  if they didn&#39;t work as a chef."
        },
        {
            "author": "@marshmello9189",
            "text": "Spicy is good"
        },
        {
            "author": "@fahmizulkuply8013",
            "text": "when the judges all white"
        },
        {
            "author": "@borneoexplorer4827",
            "text": "Chef that have low tolerance to spicy 🤣🥲🥲🥲"
        },
        {
            "author": "@gorshkovcarlvinson9537",
            "text": "That bald guys is stupid ngl"
        },
        {
            "author": "@tymiller1944",
            "text": "😂😂if you can&#39;t handle the heat get out the kitchen joe"
        },
        {
            "author": "@aloneheroyt1524",
            "text": "White man alart*"
        },
        {
            "author": "@callmeisaac5153",
            "text": "Joe finally experienced flavor and he doesn’t like it"
        },
        {
            "author": "@ethanporto1745",
            "text": "I fucking hate these shows. So much amazing food shit on just because a judge doesn’t like the flavor profile. For example someone makes pasta, judge then says “I fucking hate pasta” try it and say “this is the worst fucking pasta ever” if you don’t like pasta then obviously you’re not gonna like it. Others on the other hand love pasta tho 😂 like seriously I love spicy food and bet I woulda loved his dish."
        },
        {
            "author": "@peachtea1318",
            "text": "God joe was such an awful judge he threw a fit about everything I’m surprised he didn’t break the entire dish for hurting his tongue"
        },
        {
            "author": "@grant8490",
            "text": "He puts a tiny bit of pepper in his dish and the 1 European guy is like, no way.... this is too spicy. I&#39;m European, I would know. Us Europeans know better than the rest of the world."
        },
        {
            "author": "@imanuelzrm9708",
            "text": "Korean dishes are meant to be spicy"
        },
        {
            "author": "@jasoqueso8669",
            "text": "Yo no way! I’ve been rooting for u since the beginning and had no idea you had a YouTube channel! Good luck man :D"
        },
        {
            "author": "@delonscott6248",
            "text": "Am rooting for you Michael💯"
        },
        {
            "author": "@Gio_of_the_Sound",
            "text": "I watched that episode and that shiz looked soooo yummy, and it was a cool way to present the ramyun."
        },
        {
            "author": "@MarcotheKorean",
            "text": "I see nothing Korean except the kimchi though"
        },
        {
            "author": "@dillonclark1853",
            "text": "Gordon looking aged suddenly."
        },
        {
            "author": "@daveeraps",
            "text": "I know this comment will go unnoticed but keep me in your prayers please. I used to have 5 brain tumors, but now I have only 1 left to go. In the past I became deaf, and also started having seizures. If you’re reading this I hope things get better for you and your family. One love"
        },
        {
            "author": "@blistcc1680",
            "text": "Congratulations"
        },
        {
            "author": "@jangingout",
            "text": "His pronunciation of Ramyun was spot on"
        },
        {
            "author": "@6BEEP9",
            "text": "Its korean, how does he not expect it to pack some heat"
        },
        {
            "author": "@samueldickenson2062",
            "text": "If the chef was Asian they wouldn&#39;t complain about it being too spicy"
        },
        {
            "author": "@MrPlenty1",
            "text": "Is that the dog whisperer critiquing food? 😄"
        },
        {
            "author": "@brightbluesky1548",
            "text": "It may not be spicy for the chef but to spicy for a judge. You can&#39;t knock off points based on someone else&#39;s spice tolerant"
        },
        {
            "author": "@ttvphilswifft8682",
            "text": "Lit that guy up 🤣"
        },
        {
            "author": "@cheapshushi432",
            "text": "Good food<br>But why do you look like a gym bro version of Joaquin phoenix"
        },
        {
            "author": "@CammyG0",
            "text": "Ramsay looks so old in this"
        },
        {
            "author": "@coleslaw5713",
            "text": "Dude he looks like a really good dad lol. He has that dad look"
        },
        {
            "author": "@benk7902",
            "text": "I wouldn’t trust food from a grown man wearing what amounts to essentially leggings."
        },
        {
            "author": "@ajanggocrazyyycblessfree7483",
            "text": "brooo a food judge without a spice tolerance is so insane"
        },
        {
            "author": "@philipkim6480",
            "text": "Love the emphasis on “ramen” and “ramyun”."
        },
        {
            "author": "@juts_sama",
            "text": "when you&#39;ve been scrolling in yt shorts for a long time thinking this is another video cut by some &quot;creator&quot; to boost their channel.<br><br>not realizing it is the channel of the actual chef in the freakin video"
        },
        {
            "author": "@TheFightersspirit",
            "text": "Did they make you drink the purple koolaid"
        },
        {
            "author": "@skunksprayorlicorice7922",
            "text": "When you add seasonings other than salt and pepper to the white folk cookout"
        },
        {
            "author": "@Ali_art",
            "text": "Spicy is better than bland salt and pepper"
        },
        {
            "author": "@AngelGuerratherealme",
            "text": "Michael I seen you on TV man I was rooting for you since the beginning 🙏 🙏"
        },
        {
            "author": "@topramen7081",
            "text": "This guys face is always so devoid of emotion so this cracked me up. He really did the Shaq meme"
        },
        {
            "author": "@newguyishere4767",
            "text": "Someone should cook something and say it was made with kizma"
        },
        {
            "author": "@Se0what",
            "text": "He even said Ramen like a Korean person. Passes the vibe check on that alone"
        },
        {
            "author": "@dantheman359",
            "text": "I know you win just say it already"
        },
        {
            "author": "@Gohan-_--",
            "text": "Am I the only one who sees the girl from darman in this episode"
        },
        {
            "author": "@multifister47",
            "text": "Joe is the most dramatic man I’ve ever seen in my life."
        },
        {
            "author": "@P.T_luvrgirl",
            "text": "Honestly they should get chefs who can handle spice cause spice is a massive thing in a lot of countries and if they can’t handle the spice it’s the shows fault for not finding chefs that can handle spice cause Korean food most of it has some type of spice and despite being spicy it’s delicious but some people can handle spice so they can’t taste the flavours idk if he lost or sum but if he did and it was cause the spice icl it’s their fault not his💁🏽‍♀️💁🏽‍♀️"
        },
        {
            "author": "@iqbaltaqwakal",
            "text": "Hmph weak, you call yourself judge"
        },
        {
            "author": "@mindgames50",
            "text": "Food needs spice, not the chefs fault if his tolerance is bitch level"
        },
        {
            "author": "@maddogbasil",
            "text": "<b>Japanese and koreans left the chat</b>"
        },
        {
            "author": "@user-kt2ko1fw8i",
            "text": "What season??"
        },
        {
            "author": "@G.I.Jack69",
            "text": "Pov you’re still waiting"
        },
        {
            "author": "@eklipz238",
            "text": "Can someone tell me why was there a grub hub container on the counter? Was it a sponsored episode?"
        },
        {
            "author": "@tayydouble0548",
            "text": "I seriously hate bro, he&#39;s not a chef, but feel his opinion matters"
        },
        {
            "author": "@logvoid1559",
            "text": "Joe is a poser anyways"
        },
        {
            "author": "@shinjeh",
            "text": "Michael is my favorite"
        },
        {
            "author": "@oladayoisaac6890",
            "text": "Naruto has entered the chat"
        },
        {
            "author": "@joestrum8056",
            "text": "People, you dont HAVE to have ridiculous tats all over you. Its getting stupid."
        },
        {
            "author": "@zh0ngxina634",
            "text": "As Uncle Roger says : Put the right amount.  Not the white amount."
        },
        {
            "author": "@catinblack2247",
            "text": "Just looking at your dish...🤔<br><br>Imma subscribe 😊"
        },
        {
            "author": "@kishankr8537",
            "text": "As Uncle Roger might have said <br>Use the right amount not the white amount."
        },
        {
            "author": "@infrdarkfire",
            "text": "Joe annoyed me this season. Bro actually can&#39;t take any spice."
        },
        {
            "author": "@JeiYT0419",
            "text": "link for the full video pls"
        },
        {
            "author": "@Papatabb69",
            "text": "You&#39;re awesome I&#39;m happy to see you on yt"
        },
        {
            "author": "@enchmengas6394",
            "text": "He was weak maybe he to much time out when he was young"
        },
        {
            "author": "@LeoLCDT",
            "text": "Damn, that season contains a lot of scary looking mfs."
        },
        {
            "author": "@gregorysmillie2008",
            "text": "If it&#39;s not too spicy it&#39;s not Korean."
        },
        {
            "author": "@ijustmakeinflammatorycomme9839",
            "text": "Joe is pretentious and minus masterchef what are his actual credentials? Tried watching US masterchef once and he talked over Gordon as if Gordon isn&#39;t one of the most respected chefs in the world"
        },
        {
            "author": "@EdwardAlcala",
            "text": "Holy shit, Chef Mike."
        },
        {
            "author": "@mas5621",
            "text": "What season is this?"
        },
        {
            "author": "@Lonzokoh",
            "text": "Bro crying cuz he dont have the spice tolerance others have 🤡🤡🤡"
        },
        {
            "author": "@eyanmehlhoff2338",
            "text": "Joe was such an awful judge. His qualifications were &quot;I&#39;m Italian and I own a couple wine businesses.&quot; Hypercritcal all the time(somehow worse than Gordon) and just mean. At least Gordon provides some constructive criticism to the chefs. Joe was just always like, &quot;It&#39;s too boring,&quot; or &quot;it&#39;s not that good.&quot; And never, here is why it&#39;s bad and here is what you could do to improve. Shameful on his part."
        },
        {
            "author": "@Aaron_Rodgers8",
            "text": "Should edit the title of this as pt.1 I honestly thought you cut off the video until I went to look for the second part"
        },
        {
            "author": "@MyPotato2",
            "text": "Rule number one.   Don’t blow the judges palates out….."
        },
        {
            "author": "@Alfskini",
            "text": "i like the part where joe says it’s too spicy"
        },
        {
            "author": "@RandomPerson-vg9rq",
            "text": "Spicy ramen is the only type of ramen i will est"
        },
        {
            "author": "@baileymiller8620",
            "text": "Damn those pants are tight"
        },
        {
            "author": "@HungMantis",
            "text": "Joe doesn’t know shit though like bro is not a good cook at all he just owns a restaurant he shouldn’t be on the show lol"
        },
        {
            "author": "@lilkeemusic8248",
            "text": "Is it just me or does anybody else just not really like the bald guy at all he doesn’t even act like a chef half the time he throws it away without trying it and then whines about what they mad whenever he hasn’t even tasted it"
        },
        {
            "author": "@superbduperb",
            "text": "Bro got it right Ramyun for Korean dish, Ramen for Japanese. Nice"
        },
        {
            "author": "@seaiftamer6788",
            "text": "Which season is this"
        },
        {
            "author": "@qburn2081",
            "text": "As a korean this looks amazing"
        },
        {
            "author": "@Yilkanzhi_Nooristani",
            "text": "Took me awhile to realise this channel is owned by the same cook in this video."
        },
        {
            "author": "@davidpetruic9557",
            "text": "Why is this edited so bad I do t follow the continuity"
        },
        {
            "author": "@harryputnam8441",
            "text": "Korean food is supposed to be spicy ^-^"
        },
        {
            "author": "@BONNITALONDON",
            "text": "What season is this anyone ? Thanks in advance"
        },
        {
            "author": "@DuhDee",
            "text": "I hope you get the recognition you deserve Chef Michael 💖 your recipes are always so yummy, easy to make, and flavorful!"
        },
        {
            "author": "@EllieTheTrucker",
            "text": "Korean inspired dish 🥰"
        }
    ]
}