{
    "videoId": "amDpaG_BMpI",
    "totalComments": 21,
    "comments": [
        {
            "author": "@NicholasChanning",
            "text": "Not noah literally slipping off the counter- 😭"
        },
        {
            "author": "@HelloFam",
            "text": "<a href=\"https://www.youtube.com/watch?v=amDpaG_BMpI&amp;t=15507\">4:18:27</a> can sort of predict the ending with the duration of the video left T-T"
        },
        {
            "author": "@jaimemendez8098",
            "text": "Clickbait smh"
        },
        {
            "author": "@Weekend658",
            "text": "First off you’re inaccurate here. Gordon, showed a very soft spot for Nick as did Mr Joe Italiano Columbo 😂 <br>Nick was also 22 years old, not 21. <br><br>How you missed such key details makes no sense to me considering you can see how kind and gentle Gordon was to him compared to others who chose not to listen to his advice in the kitchen."
        },
        {
            "author": "@Mighteatacheesesteak",
            "text": "God and Jesus loves u"
        },
        {
            "author": "@FOURBEEZ",
            "text": "Are you a bot? This video is clickbait as hell. And you’re liking literally every comment roasting you 😂😂"
        },
        {
            "author": "@kingcrabroll",
            "text": "I CANNOT believe that they won the game keeping the doors closed most of the time… WHAT"
        },
        {
            "author": "@michellewalters4484",
            "text": "I always hoped he would win..."
        },
        {
            "author": "@DonnieDarko2584",
            "text": "So uhm where did he do what the title suggests? Dont mislead please"
        },
        {
            "author": "@kasjanJ",
            "text": "Click bait bs video"
        },
        {
            "author": "@martijndegroot6753",
            "text": "i don&#39;t mean this to be mean, but these people choose to go on the show and know the conditions of going on, if it was such a big challenge he could have gone home at any time"
        },
        {
            "author": "@SludgeBob",
            "text": "I liked the part where he stood up to Gordan Ramsay, such a brave, courageous man nobody has ever pulled off what he pulled in this video and will forever be respected for his incredible feat."
        },
        {
            "author": "@dev_theysleader3184",
            "text": "Sometimes, failure is the mother of success. Now nick is successful and has collabed with gordon!"
        },
        {
            "author": "@bradfauatea4312",
            "text": "Gordon yelling whatever but it’s all part of the act it’s all scripted"
        },
        {
            "author": "@javierofficialyt9867",
            "text": "Who came here after nicks newest video collab with Jordan&gt;"
        },
        {
            "author": "@TylerPCoyne",
            "text": "Idk how, where, and when he stood up to Ramsay, but I do know they are now pretty good friends today. They even worked together to break a world record recently!"
        },
        {
            "author": "@henrystyles69",
            "text": "The number of dislikes on this is past 6 times it likes"
        },
        {
            "author": "@armanabelino7517",
            "text": "Nick is my darling from the day one until Nick DiGiovanni with more than 10 million subscribers ❤❤❤"
        },
        {
            "author": "@markaguirre4753",
            "text": "Did I miss where he stood up?"
        },
        {
            "author": "@ericavila-0252",
            "text": "It happened until Dara Yu dethroned Whitney Miller from the first season to become the youngest winner at 20 years old"
        },
        {
            "author": "@emitzzed1733",
            "text": "How did he stand up to Gordon Ramsey then"
        }
    ]
}