{
    "videoId": "MdHLd9BamX0",
    "totalComments": 95,
    "comments": [
        {
            "author": "@interesting252",
            "text": "This is what I wanted to hear"
        },
        {
            "author": "@saimatahsin2233",
            "text": "R and d needs a lot of budget. Problem is we need foreign funding for it. And they will never do it. They will fund for infrastructures,  services,  but no. No r and d"
        },
        {
            "author": "@shiv1pl",
            "text": "These Pod cast Guus just talk and blame .. 😃. Indians studied in India are holding leadership positions worldwide . <br>Now Infosys and TCS is a multi billion dollar company . Did they promote their team to invent something like Facebook or Google ? <br>Engineers starting salary is equivalent or less than call centre guy <br>Every engineer knows technical work is tough and not appreciated in the Company so they go to non technical work"
        },
        {
            "author": "@madmax4831",
            "text": "We Indian lack good teachers, lecturers and professors. <br>Most Indian students and their parents lack maturity levels to understand vision, goal and perfection.<br>Most dangerous is chalta hai attitude of masses and we are sentimental fools that don’t maintain self respect and integrity."
        },
        {
            "author": "@ashwinanil7655",
            "text": "MBAs will make the existing process better and efficient but engineers will expand the horizon of improvement anf efficiency."
        },
        {
            "author": "@yashodhanjoshi5674",
            "text": "Innovation in India is held back by poor IP protection and enforcement, not a lack of talent. With over a million engineers graduating each year, it&#39;s clear the issue isn&#39;t skill or ambition—it&#39;s the lack of proper incentives."
        },
        {
            "author": "@techxjanak",
            "text": "very true.."
        },
        {
            "author": "@anshalmehta4273",
            "text": "Raghuram Rajan, the best RBI Governor ever said it the best where is India&#39;s Merck, Apple, Microsoft, Google, Tesla etc"
        },
        {
            "author": "@ADGroupOfArtMedia1",
            "text": "Meanwhile one community and some politicians are trying to defend Waqf board to run and spread more religion 😂😂"
        },
        {
            "author": "@rajahanthony3652",
            "text": "I agree with him 100 percent ❤"
        },
        {
            "author": "@shaileshchityala2787",
            "text": "R&amp;D funding.. rampant taxes .. Cronies Oligarchy is rampant in india"
        },
        {
            "author": "@anmolkapoor9595",
            "text": "Apart from that. The inspector Raj ruins the small scale industry"
        },
        {
            "author": "@Jay-br2ud",
            "text": "we need to setup an open source org specifically for india all without any strings should contribute to innovate things <br>like like minded engineers work on solving indias problem or invent new things <br>gov and others invest in it without any strings attached"
        },
        {
            "author": "@manuarya6538",
            "text": "Because you don’t reply on their LinkedIn messages."
        },
        {
            "author": "@piyushkumar517",
            "text": "Because every great company is sold to Adani and Ambani 🎉"
        },
        {
            "author": "@rahulmeena1402",
            "text": "In our college, the programming is still done on Turbo C++"
        },
        {
            "author": "@lalitSharma-vh7jl",
            "text": "Germany have only 2 companies in Top 100 companies they had 10 before Germany is loosing but guess who is winning USA let&#39;s not talk about number 1 economy"
        },
        {
            "author": "@Incognito61307",
            "text": "Engineering companies need engineers as leaders not MBA for innovation."
        },
        {
            "author": "@parasnathshah9666",
            "text": "Hey who told you this, just go and meet Mr. Laxmi Mittal, Mr. Damani, Mr. Adani, Miss Vinita, and many more."
        },
        {
            "author": "@madhumurali9498",
            "text": "Just a question to him that how much  this government is allocating their annual budget for R and D ? Im sure it will be very less compared to other developed nations. Then dont blame indians for not being ambitious enough. Indians are ambitious enough, its just that in India government should put policies and systems so that Indians dont have to go abroad"
        },
        {
            "author": "@sambhawdugar",
            "text": "Empty stomach thinks about food and shelter first.<br><br>Compare how many Indians are poor+middle class just making end to end with no house of their own Vs those in Germany. One event puts this vast population in India under huge debts which they keep repaying until their deathbed.<br><br>What kind of basic needs are taken care of in both the countries?<br><br>Unless the very basic security is available, only a few crazy risk takers will get into Research and not a mass of people and hence out R&amp;D will be limited to those minds and not inclusive/ widespread"
        },
        {
            "author": "@learnenglishwithash5383",
            "text": "Actually we love being slaved by Politicians, religious leaders or sometimes by parents and even by own thoughts and idleness. We just want Security so that we can overpopulate! 👨‍👩‍👧‍👦"
        },
        {
            "author": "@user-cd3ys6yq9r",
            "text": "Thats the problem when you have 50 billionaires controlling all marketshare in possible fields.<br>Why have they never questioned as to how tata group is there in so many <a href=\"http://fields.is/\">fields.Is</a> it through innovation or corrupt practices and killing sme for their gain.<br>You want innovation build industrial/commercial parks and give entrepreneurs chance to take risk with very little capital,free up the monopoly business and kill the big corporates stanglehold in all industries,including cars and motorcycles.<br>Why is maruti,bajaj and a handful of people control the auto sector in india,they arent even exporting to the west so their quality is also not good enough,all they cater to is india matket and south east asian countries and with an agreement with china run a prosperous business in africa.<br>Why are there not 100 companies in two wheelers and 100 comapnies in car industry.<br>You create scale,move to robotics and kill smes and then complain about jobs.<br>Sick and hilarious at the same time."
        },
        {
            "author": "@siddharth6505",
            "text": "Indian msme&#39;s dont setup in small towns because of local corruption in small cities, they are harrased by the local MLA and his men and by local state bureaucracy."
        },
        {
            "author": "@dipanshudon",
            "text": "Adani and Ambani are rent extractors. <br>India should be run by enterpreneurs and not family dynasts."
        },
        {
            "author": "@rahuljaiswal3148",
            "text": "If Government provides financial assistance for R&amp;D for innovation at various Example: Financial assistance in terms of salary payment 50% - 50% &amp; no GST or tax on purchase of equipment for research products. Israel has this policy so we can have too."
        },
        {
            "author": "@tejashpatel5976",
            "text": "In Germany people pursue engineering because they like it but In india people just do it for stability , parents and kuch samja nahi toh kar diya"
        },
        {
            "author": "@energetiic267",
            "text": "Indian engineering courses are 50 years outdated , and these people expect innovation..in last 10 years spending on education became 2 % of GDP from 5% .. What do you expect..?"
        },
        {
            "author": "@kaustubhgotmare2278",
            "text": "That&#39;s because of ur policies and education system sir"
        },
        {
            "author": "@mrholmes2855",
            "text": "Brahminical system is followed here in india that&#39;s why only caste based growth you can see in india because of casteism"
        },
        {
            "author": "@Nnivinkrishna",
            "text": "We do have research attitude engineers but the fear of return of investment and pressure from the investors. We are forced to create a volume based product instead of high tech."
        },
        {
            "author": "@The_WarriorsWay",
            "text": "Ok, what&#39;s the incentive does Indian gov is providing for R&amp;D. Maybe colonial era laws, corrupt bureaucracy is the incentive."
        },
        {
            "author": "@The_WarriorsWay",
            "text": "Before blaming companies, first ask why government and bureaucracy had made such a difficult environment for companies to operate, everybody wants a cut corruption is rampant, no power supply guarantee, 1000 of complies, and you caught in any legal matter for a minor mistake them judiciary will play there part to completely destroy you"
        },
        {
            "author": "@gauravpatnaik3118",
            "text": "Roasted the Indian family business clan A1A2 without mentioning any of them 😅"
        },
        {
            "author": "@durgeshpatel8753",
            "text": "Cause the government does not have foresight to remove reservation and change the syllabus."
        },
        {
            "author": "@sushru",
            "text": "We should be allowed to import Engineering tools without taxes . Update the syllabus and hire good lectures, who can teach with visual examples"
        },
        {
            "author": "@sreenivasannarayanan8439",
            "text": "True….every Engineering colleges lack R&amp;D in our Country. Now things are slowly coming up in India. I pity the Indian Education System."
        },
        {
            "author": "@m04d10y1996",
            "text": "Go through the history of industrial revolution in Germany and Japan and you will find that they started with very poor quality products but the continuous improvement they had is what we see now."
        },
        {
            "author": "@sowmyanr",
            "text": "What we look at is the trajectory of growth - where was the country 20 years back, 10 years back and now.  You can then extrapolate the direction of growth and rate.  <br><br>The author has compared an economy that had gone through similar growing pains and understood where to focus.  Government supported them and still support in the form of EU.  60% of German exports are to Europe and germany being in the EU and also the fact that Germany through EU offers loans and subsidies to other European states.  And guess what they buy - German products.  <br>So Germany has created a market by leveraging EU.  <br>The other key aspect here that we miss in these narratives is that, these German manufacturers as world leaders are all not the rocket engines part manufacturers.  A number of them are pen or pencil or screws manufacturers.  <br>But they specialised  and focussed on it. <br><br><br>The key thing to look out for as an example of how things are changing in India is the rapid expansion of start ups supporting space tech and military tech.  <br><br>This is where most of the manufacturers in Germany and USA started with."
        },
        {
            "author": "@arnabghosh8776",
            "text": "Fo they give reservation in those colleges"
        },
        {
            "author": "@AK-wn5ri",
            "text": "Govt should create a PSU which should be filled with MBA and industry leaders who are there to market, promote, advise small/medium scale industries for free. There are individuals who are doing it by taking products from villages and selling it in US/EU. But these are drop in the ocean. I think NE states are doing a good job of promoting and exporting organic products to the world. We should learn from their experience"
        },
        {
            "author": "@kotimoto",
            "text": "It takes 2 years for govt approval, lakhs of rupees in bribes to get approval to set up a factory here."
        },
        {
            "author": "@GopalSingh-gf4vm",
            "text": "Because indian know how to create IT.. Where narayan muthy wants youngster to work for 80 hrs per week and then paying them peanuts😂😂"
        },
        {
            "author": "@shibashisroy4212",
            "text": "This MBA is becoming a hoax"
        },
        {
            "author": "@cnk8766",
            "text": "Indian mindset inclined more towards servicing and earning money, it&#39;s in our culture to not spend a penny if it&#39;s not 100% success which R&amp;D is an example for😂"
        },
        {
            "author": "@ManojGuptahome",
            "text": "I am glad that someone inside the machinery is thinking about R&amp;D. It is a must that we address this issue in totality. Only one sector or educational structure cannot modify this mentality of business owners. <br><br>We can boost independent R&amp;D labs and invite private players.<br><br>Whether a service or industry, all need quality checks."
        },
        {
            "author": "@satyam-evajayate438",
            "text": "India is a self-sufficient nation (adequate availability of panchabutha for fulfilling basics of life) like any others in southern hemisphere, and most commercial innovation happens in northern hemisphere due to nature pressures (struggle for existence). Learn about North-South divide in geography for relatively better understanding of forces behind success."
        },
        {
            "author": "@blogsterstudio4316",
            "text": "Meanwhile or Culture......<br>Naukri aur Chokri......😅<br>But it wasn&#39;t used to be so......😔"
        },
        {
            "author": "@ankursingh1962",
            "text": "Indian&#39;s brain still operating on windows xp. Whereas, developed countries are operating on current generation. Additionally, despite being government entities how much indian PSUs are investing in R&amp;D, let alone private companies.<br>The electricity geneating turbines here are made under Germany license. Indians are frugal and want the best thing out of spending pennies."
        },
        {
            "author": "@rudrajana",
            "text": "Indian companies have never invested a single paisa on R&amp;D. Take the example of Metallurgical &amp; Engineering Consultants of India (MECON), Ranchi. It was started in the &#39;60s &amp; was the main contractor/ consultant for setting up Steel plants in India, but for every mill/furnace/melt shop which came up, these ppl collaborated with an intension Engineering company on a case to case basis, without developing anything on their own - in 60+ years of existence. Indian R&amp;D doesn&#39;t exist. Indian engineers who are good enough to come up with anything new are lapped up by foreign companies at X times their pay... Besides, in Germany, students are watched from initial years &amp; depending on their propensity,advised &amp; encouraged to take up a particular stream. In India, we have reservations."
        },
        {
            "author": "@PEDNEKAR1616",
            "text": "Beacuse they are professionaly managed. Unlike Indian propreitors who shy away from giving up control."
        },
        {
            "author": "@unitycatalog",
            "text": "Number of Nobel prizes in science by Independent India 0😂"
        },
        {
            "author": "@lololleza",
            "text": "yes it is true, our education system is designed to making us the “working class”.<br><br>the education of all the mps/mlas is reflection of who we all are."
        },
        {
            "author": "@rajashekarreddykomareddy9917",
            "text": "Why Tata and Mahindra vechiles don’t sell in USA???"
        },
        {
            "author": "@chromecast-m1u",
            "text": "glad we have a chinese situation, which is forcing us to be ambitious else we would I&#39;ve  been the same old."
        },
        {
            "author": "@rmallick07",
            "text": "R&amp;D in India is horrible. The Research Scholars in India have to sit for a strike to increase their stipend every 3 years, which has to be automatically done by DST. The funding situation is the worst."
        },
        {
            "author": "@Prashant_Pandey4",
            "text": "I hope Ola will do something , also Nithin Kamath are investing in some companies , hope more and more fund manages and early age investors will start investing in startups and we will see Google, facebook and uber like companies originating from India."
        },
        {
            "author": "@Prashant_Pandey4",
            "text": "most of Indian companies is family owned bussiness so they have limited room for innovation and just keep expanding on related bussinesses without excelling one , like Reliance, TATA, Birla,Bajaj,Munjal or any other Pharma companies all are just expansionist with little or no no innovation hence can&#39;t able to compete at global level."
        },
        {
            "author": "@smkvcp",
            "text": "Engineers in India are often undervalued, and instead of receiving fair compensation, companies seem to prioritize hiring cheaper labor, like ITI fitters, even for senior positions such as General Manager. Many Indian businessmen, with the exception of a few like Tata, exploit engineers and the workforce to increase their own profits. The government seems to support this by allowing businessmen to enjoy privileges, while the employees who contribute to the success of these companies are left behind. In sectors like IT, governments heavily invest in infrastructure, but without similar support for manufacturing, the country cannot grow. For the past 75 years, the Indian government has offered little motivation to the manufacturing sector. India cannot become a global superpower if it continues to neglect and exploit its manufacturing workforce while relying on borrowed knowledge and ideas. Real growth requires support, innovation, and proper treatment of the manufacturing industry and its workers."
        },
        {
            "author": "@ttmadhu",
            "text": "When we are not building a culture which talks about innovation. <i>___</i> ji ka beta IIT Kharagpur passed out 38 lacs package... <i>__</i> ji&#39;s kid...IIMC 78lacs package... I haven&#39;t heard single person talking..... &quot;my son passed from IIT Chennai filed 8 patents&quot;.. if this change happens. Kids will worry about innovation"
        },
        {
            "author": "@thebeautifulanimal",
            "text": "Lack of R&amp;D and our so-called &#39;fake capitalist society&#39;—we prefer blaming Adani and Ambani instead of supporting our own businesses."
        },
        {
            "author": "@innocentmushi3036",
            "text": "Indians companies doesn&#39;t need to invest in (R&amp;D) because they doesn&#39;t need to be creative they are protected by the government. They are shielded from global competition unlike Chinese companies. <br>TATA is much older than BYD but now TATA is nothing compared to BYD, TATA is investing in small business like salt, tea leaves etc. 😂"
        },
        {
            "author": "@bharatg.4110",
            "text": "R&amp;D is not priority for Indian government, look at budgets… we are spending very less then how can we expect from engineers!?!?"
        },
        {
            "author": "@vaibhavpatel6507",
            "text": "Indian are ambitious, but the problem is our education system, never teach us how to solve problems &amp; being <b>creative &amp; innovative</b> ..<br>Not top most companies like TATA / TCA &amp; reliance(despite of having enormous budget) also less focus on R &amp; D rather focus on providing services &amp; manufacturing &amp; <i>make money</i>"
        },
        {
            "author": "@sunshine-ms6wk",
            "text": "Lack of innovation, money, r&amp;d education and skills, too much taxes all money goes to govt jobs and all money put on political  welfare not focusing on production, excess of import over export, etc."
        },
        {
            "author": "@letitgo151",
            "text": "Many modern weapons are built by germans which made others to recreate it.."
        },
        {
            "author": "@Jain-dt6b3",
            "text": "American government support there businesses and indian government they don&#39;t even do they work properly how they support the businesses"
        },
        {
            "author": "@divyanshameta9516",
            "text": "Best example is Boeing, first operated by engineers now become a MBA bullshit"
        },
        {
            "author": "@msn4975",
            "text": "Because Tata, Godrej, Wipro, etc buys at the early stage and these guys won&#39;t allow anyone to become successful than them"
        },
        {
            "author": "@ulteriorwonderer3483",
            "text": "What he means by all that is, we Indians dont tey to create much, we just take existing technologies and use it in managerial roles or work for someone else. Obviously because creativity is not even wanted or inspired here by 99% pf people, parents or not. If you want India to get ahead then let your chuld create, make mistakes and learn things."
        },
        {
            "author": "@ashwink7384",
            "text": "Those who are ambitious enough want to just go abroad and settle there and help other countries grow."
        },
        {
            "author": "@shivamgupta6570",
            "text": "Well if you are reading this comment please note that Germany didn&#39;t built special towns for special industries. <br>Germany built large scale industries outside the cities and then gradually area around these factories became small town over time. Now, many big industries also collaborated and funded the establishment of universities which had special courses pertaining to that industry.<br><br>We in India think the opposite, we first want universities and then assume that industry will come up automatically, no wonder most of our degree holders are useless.<br>Also, we have a culture of hatred for industries which is a legacy of our Socialist past."
        },
        {
            "author": "@user-kl8xp7rd7r",
            "text": "This is just the motivation I needed ❤"
        },
        {
            "author": "@allangracias1",
            "text": "Innovations are a by product of a free market. We don&#39;t have a free market"
        },
        {
            "author": "@shubhamrajsingh6616",
            "text": "Germany led industrialization of Europe , initiated by Bismarck and nobody is close to Germany in innovation, exception can be Switzerland. And we are great at copying ideas like China 🇨🇳  because they do the same China is filing more patents applications on mobile phones . Japanese built tech after demilitarization ,  and india since independence has done UPI just to beat Likes of PayPal and Mastercard , Visa , etc. We haven&#39;t really built anything,  engines, or ... even needles since independence.  Even a small alarm clock or table clock ⏰️  sold in shops is made in China. We are really building a population that is not inclined to manufacturing"
        },
        {
            "author": "@mehul88",
            "text": "This is because the governemnt is creating a hindu muslim civil war. How can anyone produce anything then ?"
        },
        {
            "author": "@Divyesh44",
            "text": "Everything Innovation starts with R&amp;D but the govt. doesn&#39;t listen. They are more interested in manufacturing. With R&amp;D , there will be a lesser need to invite industry giants into the nation."
        },
        {
            "author": "@VikramSingh-fd9uj",
            "text": "Lastest example Adani Bidding for Airport in Kenya,<br>Indian political system opposing it.<br>Instead of creating positive sentiments, we Indians are doing opposite of it.<br><br>If country people opposes something, why the hell other country will respect it."
        },
        {
            "author": "@antibioticsOfWorld",
            "text": "Because its fed into our mind that we work for others and not we sell our product for others ...<br>Also u love R&amp;D when u love the subject ..but all u love is money then the company will close soon"
        },
        {
            "author": "@sakethravula",
            "text": "He is referring to Mukesh and family?"
        },
        {
            "author": "@ranjan8022",
            "text": "&quot;Company needs to be run by Engineers and not by MBAs&quot; - that&#39;s a great take as MBA focus on valuations only, they are not passionate about what they are doing.<br>Let the Engineers do what they do best.<br><br>(Engineers means people who passed out from reputed colleges like IIT and like, not hululu Engineering college in Every corner nowadays, that&#39;s the real curse of Indian Education system, every Tom Dick and Harry has a degree but lacks knowledge"
        },
        {
            "author": "@gagan1063",
            "text": "Yeah True Infosys and Wipro which have thier main basic in IT are not able to do"
        },
        {
            "author": "@Egon15",
            "text": "Engineering colleges have mugging up approach, it suck out all the enthusiasm and interest from students in 4 years of college."
        },
        {
            "author": "@deepkadamba7083",
            "text": "Sorry if Government just promotes cronies why blame Indians Indians have to Jugad to Survive."
        },
        {
            "author": "@jaibhoir1488",
            "text": "* Poor Education system (less practical more theoretical)<br>* Politics &amp; caste system reservation majorly everywhere <br>* Even if someone comes up with innovative idea, more restrictions/ compliants &amp; less opportunity he has<br>* Just for the sake of Made in India is running hovering everywhere but in reality system is shit<br>* To become world leaders in be it Manufacturing/ Servicing there should be less restrictions &amp; more simple way of doing business <br>* Just by collecting taxes &amp; not giving the service to the ppl is a looting system.<br><br>No offense, its just my own perspective ❄️"
        },
        {
            "author": "@xandercage6944",
            "text": "We Indians lack in R&amp;D. We are a services hub, not manufacturing hubs."
        },
        {
            "author": "@mohankrishna3597",
            "text": "Nice blame game. <br><br>When something not good in the country during Congress time blame their government but when something not good during BJP government blame people , what&#39;s kind of non sense is he .<br><br>Remember BJP came to power by talking so much bad about previous government and portraying whatever bad has happened Congress, Nehru had a role in it but it&#39;s utter nonsense now to blame people that is us for something not good happening ."
        },
        {
            "author": "@suji1103",
            "text": "India&#39;s R&amp;D spending is significantly lower, the govt spends 0.7% of GDP comparing to countries like Israel, the US, China, South Korea and Taiwan these countries stand at top 5 R&amp;D spending countries. <br><br>In simple words India and Indians will always depend upon another country.<br><br>Also, the culture unlike american companies Indian companies run by family. The family of that member will become CEO or director. In the US it can be from any country"
        },
        {
            "author": "@VivekBisht",
            "text": "Even if a innovation is started my me ..the moment i get a chance to sell it for good money i will sell it and most of you will too as most of us knows what being poor is in our country means. <br>Every small things contribute to this mindset, you roads, infra, law, civil rights and our civil duty ..you cant make that environment here without making those top class infra and law and order... But things are changing for good just for fast enough."
        },
        {
            "author": "@ShivaKumar-uz8sv",
            "text": "Many people in comments do not understand what he is trying to tell. Research and development (R and D) will get new innovations, and will make things easier, The truth is that not many companies in India don&#39;t invest in R and D. People will not agree because they don&#39;t know what R and D will get you."
        },
        {
            "author": "@uttkarshroy4923",
            "text": "It’s because Indian startups/ companies are just looking for valuation and want to be unicorn but they don’t know that business is about solving one’s problem or making life easier and get some benefit in that transaction - many companies just get funding and funding for shit thing rather then doing real work or solve real problem"
        },
        {
            "author": "@samuelmarndi",
            "text": "The environment for small companies to stay afloat itself is challenging what r&amp;d r u talking about. The investment ecosystem and nurturing environment is required so that everyone will at least want to take rosk and invest in r&amp;d. The business culture is very toxic in india. If one Stars to grow they are targeted by goons and government and exploited like hell. So a business will want to rather feed them with money to stay afloat or go out of business fighting them. Only huge companies with wealth to fight in court can do r&amp;d here."
        },
        {
            "author": "@pradheeshj5124",
            "text": "Just look at the current electronics syllabus. Its just mugging up 40 year old  microprocessors and microcontrollers"
        },
        {
            "author": "@surajraika7821",
            "text": "sir a Indian guy is making platform called texts to manage all text platforms <br>guess what <br>US company partnered with him and now he is in usa <br><br>i thing vc ecosystem is not yet matured yet in india <br>but gov can invest in that guy <br>but that&#39;s too much to ask in any democracy"
        },
        {
            "author": "@sujai1558",
            "text": "It&#39;s your government&#39;s job to nurture the ecosystem sir, it&#39;s easy to blame the people and say we lack mindset and blah blah"
        }
    ]
}