{
    "videoId": "gfm93K-K3WI",
    "totalComments": 325,
    "comments": [
        {
            "author": "@aks214",
            "text": "Per capita still back ...base yr still of 2011-12"
        },
        {
            "author": "@seranseran7762",
            "text": "Nothing"
        },
        {
            "author": "@akshayshetty1299",
            "text": "Lol in that case what is pappu&#39;s and congress plan for growth? <br>Any blueprints plan  ?😄"
        },
        {
            "author": "@tilakrajgolari1577",
            "text": "What He and BJP have done is commendable.<br>Thank you BJP"
        },
        {
            "author": "@diwakaranrsn375",
            "text": "Steal middle class tax money"
        },
        {
            "author": "@mndeep.626",
            "text": "Actually we done nothing different!<br><br>Just our population has increased from past 10 year and hence the size of economy.<br><br>If you really want to compare prosperity of nation look at its HDI and real GDP per capita with respect to world and other comparable economy!"
        },
        {
            "author": "@nandakishorpathak4155",
            "text": "big infra development ,high speed highways, wdfc and edfc will save oil, time to transport and  ill develop side by area rapidly"
        },
        {
            "author": "@AntrixFinancialEngineersPvtLtd",
            "text": "So you mean t to say the other countries are not compounding. We have grown faster by our infrastructure growth and getting a lot of business in main line"
        },
        {
            "author": "@user-jl9iz7hf2g",
            "text": "Highest number of Citizens giving up citizenship, moving illegally"
        },
        {
            "author": "@janardhanrangaiah982",
            "text": "Political system?"
        },
        {
            "author": "@navinraut5920",
            "text": "Even if India becomes the 1st largest economy, it doesn’t matter to 85% of common people in India. This largest economy narrative is horse shit. We need per capita largest economy."
        },
        {
            "author": "@altamashkhan4204",
            "text": "This man is funny. Everything else is bad in the country, but compounding"
        },
        {
            "author": "@vtnishadvt",
            "text": "Currently India using Nominal GDP not real GDP that&#39;s why such a jump <br>If there is real growth we like will feel it in our life.. here only figures no life change in a way of poverty, job low inflation etc...<br>Example:<br><br>If a country produced $1 trillion worth of goods and services in both 2023 and 2024, but prices increased by 5% in 2024, the nominal GDP for 2024 would be $1.05 trillion (reflecting both the quantity of goods produced and the price increase). However, the real GDP would remain at $1 trillion if we adjust for inflation, indicating no real growth in the economy."
        },
        {
            "author": "@vtnishadvt",
            "text": "Currently India using Nominal GDP not real GDP that&#39;s why such a jump <br><br>Example:<br><br>If a country produced $1 trillion worth of goods and services in both 2023 and 2024, but prices increased by 5% in 2024, the nominal GDP for 2024 would be $1.05 trillion (reflecting both the quantity of goods produced and the price increase). However, the real GDP would remain at $1 trillion if we adjust for inflation, indicating no real growth in the economy."
        },
        {
            "author": "@rocinantesh8391",
            "text": "what a joke"
        },
        {
            "author": "@goutham.r3824",
            "text": "How does India become 10th largest economy from nothing in last 60 years😂😂😂"
        },
        {
            "author": "@andyk4182",
            "text": "Oh wow! 5th largest economy with unemployment, poverty, inflation, communal riots, corruption? and with 205 lac crore debt? It’s just a hog wash, numbers are rigged! Stop glorifying the ruling party, they’ve failed us utterly!"
        },
        {
            "author": "@arvindjain6776",
            "text": "BC gdp bada hone se developed economy nahi banti. Income equality country ki development ka parameter hota hai. 40per of the ppl in India are below poverty line😢"
        },
        {
            "author": "@mihirtechneer4377",
            "text": "One nation One Law<br> is a need for present Bharat."
        },
        {
            "author": "@AkashRastogi-w8f",
            "text": "Why only India has been compounded in the last 10 years? You mean to say others were idiot and didn&#39;t know about compounding."
        },
        {
            "author": "@thereisnospoon123",
            "text": "Along with growth, jobs, opportunities and infrastructure.... We need civic sense too the most."
        },
        {
            "author": "@PiyushKumar-y6i",
            "text": "People saying in the comments that India is a rich country with poor people. This is true to small extent.<br>I have seen many people in my area with rashan card and labour card, are earning in lakhs/month and owning a big suv.<br>India is not country of poors<br>India is country of people pretending to be poor"
        },
        {
            "author": "@rrr8523",
            "text": "With growing economy inflation increases , value of rupee also increases, possibility of jobs and job creation,  startups also increases, new businesses and new business opportunities increase small scale industries increase and thereby more people are financially occupied....white economy increases, tax collection increases,  infrastructure spending increases multifold,  money rotation and compounding increases...and the cycle continues"
        },
        {
            "author": "@gpremkumar2015",
            "text": "People are struggling with all the taxes. The tax slab is very high and should be reduced."
        },
        {
            "author": "@harishetty4",
            "text": "Same way rahul gandhi will show us the power of corruption . How to go bk to 10th place in 5 years😅"
        },
        {
            "author": "@prabakaranraju5618",
            "text": "Youth working abd middle ckass buyibg capacity is very high"
        },
        {
            "author": "@ajaysveiw4771",
            "text": "Will any politicians children got govt schools and govt hospital."
        },
        {
            "author": "@deepanshusharma3275",
            "text": "Why not asking about failed Gdp we are having? Stop apple polishing verbose Government and their leader."
        },
        {
            "author": "@Nikunj_Bhuptani",
            "text": "Talk shit all you want. I have traveled in many countries and can proudly say that we have one of the highest ppp and inflation is a joke compared to most of the economies around the worls. Our food and water is too cheap."
        },
        {
            "author": "@aneesanu9285",
            "text": "😂😂😂India tok 160 lakh crore in 10 years and supplied to corperate as loan and now calulating GDP...<br>Fact is 90% of the GDP amount is from 03 to 06 person and rest india is pooverty...😂😂😂"
        },
        {
            "author": "@aritramondal6942",
            "text": "People fighting over GDP vs GDP per capita, as if we should focus on having more GDP per capita without trying to be 4th or 5th largest GDP.<br><br>To have a good GDP per capita, we need to have a GDP, which would be the 2nd or 3rd largest in the world (by current trends). And to reach there, we have to go through 5th, then 4th, and so on."
        },
        {
            "author": "@VijayKumar-io2xy",
            "text": "India i😊s 3rd largest economy if the black economy is included."
        },
        {
            "author": "@VijayKumar-io2xy",
            "text": "These GDP numbers don&#39;t include the Black money economy. That&#39;s also true economy. <br>If that&#39;s included Indian economy will be 8 trillion dollars.<br>That means we&#39;re THIRD largest economy."
        },
        {
            "author": "@faltubande9848",
            "text": "Why noone talking about per capita?"
        },
        {
            "author": "@rajmota18",
            "text": "No use of becoming 5th largest economy, where it will take us more than 75 years to reach just 1/4th of current GDP per capita of USA. 🤦🏻‍♂️"
        },
        {
            "author": "@N3tigen",
            "text": "A PhD man silently made India <br>$700 billion into $2 trillion economy in 1 decade nobody concern.<br>A feku campaign 5 trillion 5 trillion <br>Over a decade he drag 2- 3.5 trillion still we hope 5 year more to reach 5 trillion.<br>But who appreciate the PhD gold medalist economist who made India super power at that time"
        },
        {
            "author": "@AdvocateonRecord",
            "text": "Sab bakwas hae.... development my foot...just see broken road and broken footpath then you talk about compounding...by the way that potholes you ignore also have started compounding"
        },
        {
            "author": "@rameeshoe",
            "text": "The bog lie 😂"
        },
        {
            "author": "@user-ru8yf6sw5j",
            "text": "One of the biggest bhakt"
        },
        {
            "author": "@shafeequest7553",
            "text": "Indian GDP growth from 2003 to 2010 was 7 to 8.5 % repeatedly. the same growth is after the BJP government 7 to 7.50 %, it&#39;s not doubled, check the data ."
        },
        {
            "author": "@indian19992",
            "text": "Ds was all possible bcz of Sri Rahul Gandhi ji"
        },
        {
            "author": "@aksash5870",
            "text": "It&#39;s all with Ambani"
        },
        {
            "author": "@reshanees",
            "text": "India was the 3rd largest economy during Manmohan Singh tenure. If anything it got worse not better! Do you research well!"
        },
        {
            "author": "@nithinextreme",
            "text": "Economy and GDP means nothing when most of the youth are jobless, and per capita income is still the lowest. And wonderfully, the Economy is comprised mostly of very few people like adani and ambani. So we all know what modi did differently"
        },
        {
            "author": "@jokejoker4752",
            "text": "Most populated country happy for being 5th place of economy for whole world it means 2% for world economy when they represent 18% world population"
        },
        {
            "author": "@r.k.anilkumar5655",
            "text": "The only reason for growth I feel is <br>People started spending their money than preserving After Covid <br>The Covid changed people’s mind on money &amp; people perception on the way to live life with money 😅"
        },
        {
            "author": "@tiger3091",
            "text": "Paper money with pauper growth based on dubious n fudged numbers....that&#39;s India&#39;s growth story!!<br>N he has the balls to compare wid China!"
        },
        {
            "author": "@JASKIRATSINGH-dw1vb",
            "text": "Bro all is fake in reality all money going to rich people"
        },
        {
            "author": "@abhishekakodiya2737",
            "text": "indian economy is a stock market bubble"
        },
        {
            "author": "@churabhok2869",
            "text": "Only rich becoming rich....what is the use? Lowest per capita in the world"
        },
        {
            "author": "@prasannairuku882",
            "text": "may be but overpopulated,with unskilled cheap. labour,with more slum s(quality of life is low),more polluted with plastic and  high carbon fumes"
        },
        {
            "author": "@MrAchuuuuuu",
            "text": "Fun facts.<br><br>In reference to the  economic downturn known as the Great  Recession, India experienced relatively  minimal impact compared to other strong nations.  It is important to note that the Great  Recession occurred between december 2007  and June 2009.  <br>Additionally, the price of petrol in 2013  was approximately 70 rupees, while the  price of oil per barrel at that time  exceeded 100 USd. Currently, the price per  barrel is around 70 USD, yet consumers are  paying between 100 and 110 rupees for  petrol,  <br>It is commendable that citizens are  contributing to the nation&#39;s economy by  paying higher prices, as this helps maintain  the affordability of various goods,  including vegetables. It is worth recalling  that certain individuals organized protests  using bullock carts in 2013.  <br>Furthermore, the situation with gas  cylinders is rather amusing. While the  government provides free connections, the  cylinders often remain unrefilled and are  repurposed as chairs.  <br><br>Can someone make a video explaining the recent surge in Indian youth migration? Think School?  🤔 Is it because of the incredible job opportunities in our 5th largest economy? <a href=\"http://www.youtube.com/results?search_query=%23migration\">#Migration</a> <a href=\"http://www.youtube.com/results?search_query=%23economy\">#Economy</a>🎉🎉 <a href=\"http://www.youtube.com/results?search_query=%23opportunities\">#Opportunities</a>🎉"
        },
        {
            "author": "@sunillouis4911",
            "text": "Because he increased tax"
        },
        {
            "author": "@deepakshethia5420",
            "text": "Common man of India didnt know what is trillion before 2014,common public didnt know how many seats are needed for majority i.e 272+ like wise common man of India was kept unawared about all such things before 2014.They were just made to be like fish in pond.Just thinking of budget,rising inflation,poverty,reservation quota etc....hence common man was made to think about things going on round and round....."
        },
        {
            "author": "@mrconfident786",
            "text": "Why bringing FAKE chaiwahla GODI FIR SUCH DISCUSSION 😂😂😂😂😂😂NOW THINK YOU ALSO BECOME ANDHBHAKT ! 😊"
        },
        {
            "author": "@aadityauday3030",
            "text": "India Year 2014 vs 2024 <br><br>Global hunger index:<br>63 now 101<br>Passport index:<br>74 now 90<br>Human Development index: 130  now 134<br>Global happiness index:<br>111 to 126<br>Democracy index:<br>33 to 53<br>Press freedom index: 140 to 142<br>Fiscal deficit :<br>4.63% to 5.13%<br>Unemployment :<br>Age 20-24<br>22.41% to 44.5%<br>Public Debt:<br>39% to 49%<br>Trade deficit :<br>190 billion dollar to 263 billion dollar<br>Petrol 71.41 - 108.70<br>Diesel 55.49 - 98.00<br>Gas 410 -  1112<br>Dollar currency rate: 58 - 83<br>Petrol tax 9.2 to 32.9<br>Diesel tax: 3.56 - 31.8c <br><br>You will be shocked to see how India has changed in last 5 years 😱 <br><br><b>1.</b> India is now suffering from Highest Unemployment Rate in 45 years _(NSSO data) <br><br><b>2.</b> All Top 10 most polluted cities in world are now in India _(WHO data) <br><br><b>3.</b> Number of Indian Soldiers Martyred is highest in 30 years now _(Washington Post) <br><br><b>4.</b> India now has Highest Income Inequality in 80 years _(Credit Suisse Report) <br><br><b>5.</b> India has become world&#39;s worst country for women _(Thomas Reuters Survey) <br><br><b>6.</b> Kashmiri youth joining militancy is highest in 10 years _(Indian Army data) <br><br><b>7.</b> Indians Farmers suffered Worst Price Crash in 18 years _(WPI Data) <br><br><b>8.</b> Highest ever Cow related violence and Mob Lynchings on record after Modi became PM _(India Spend Data) <br><br><b>9</b> India is now World&#39;s Second most Unequal Country _(Global Wealth Report) <br><br><b>10</b> Indian Rupee is now Asia&#39;s worst Performing Currency _(Market Data) <br><br><b>11</b> India has become World&#39;s Third Worst Country in Environment Protection _(EPI 2018) <br><br><b>12</b> First time in history of India, foreign funding and corruption is legalized _(Finance Bill 2017) <br><br><b>13</b> Our current PM is the Least accountable Prime Minister in 70 years _(First PM to give 0 press conferences) <br><br><b>14</b> First time in history of India, CBI vs CBI, RBI vs Govt, SC vs Govt fights happened because Modi wanted control of all democratic Institutions <br><br><b>15</b> First time in history of India, 4 Supreme Court judges gave a press conference to say _”Democracy is in Danger” <br><br><b>16</b> First time in history of India, top secret Defence documents stolen from Defence Ministry office _*(Rafale)"
        },
        {
            "author": "@drsmmalik7049",
            "text": "16 lakh crore maaf nahi kiye hote toh abhi tak 4th spot hota"
        },
        {
            "author": "@DebrajMondal-q4o",
            "text": "Yes but what about risong unemployment , inflation....."
        },
        {
            "author": "@uurmishpatel8971",
            "text": "What economy !!!!"
        },
        {
            "author": "@rajinderjasrotia9253",
            "text": "Modi only does favors to the 140 cr people. He keeps the chest thumping. He has no responsibility 😭"
        },
        {
            "author": "@blackberryyyyyy",
            "text": "China and India were at par 60 years ago. Now China is 50x ahead of India."
        },
        {
            "author": "@kumarashwarya2185",
            "text": "Compounding what?"
        },
        {
            "author": "@user-mp1ph9iw6v",
            "text": "What about the per capita income ?"
        },
        {
            "author": "@AjitBhai-vw6my",
            "text": "Modi never forgot to take all credit 😂😂😂"
        },
        {
            "author": "@hemamberk",
            "text": "Others also compound na"
        },
        {
            "author": "@jeet778866",
            "text": "Me as an accountant and economic learner after watching this video, what and how does economy has anything to do with compounding concept (which is 99% used in interest calculations in real world or mathematical calcs) highly distorted and misinformation being spread."
        },
        {
            "author": "@hassangradhe8897",
            "text": "5th lagest economy  with lowest per capita income. India a conutry which is most unqual country around the world . today  india&#39;s  10% poulation  has 80%  of india&#39;s wealth and remaing 90 % population  of indian   has only  20 % of india&#39;s wealth. ."
        },
        {
            "author": "@renukarenu4519",
            "text": "Jobless growth bro"
        },
        {
            "author": "@divyanshrathi6969",
            "text": "What about income Inequality only richer class are creating wealth and adding to Indian GDP nd economy, Middle Class is only fighting for Survival"
        },
        {
            "author": "@strengtheningdemocracy-awa7016",
            "text": "Basically they did nothing , Mathematics did !! 😂"
        },
        {
            "author": "@rumaisashaikh2137",
            "text": "They why indians leave india and dont want to return back"
        },
        {
            "author": "@sanjayprasad8734",
            "text": "What happened to the other 5 countries. Were they not compounding with a higer principle!"
        },
        {
            "author": "@EnnilaMandala",
            "text": "Why there lot illegal immigrants at USA and Uk borders"
        },
        {
            "author": "@rajeshnitturu9980",
            "text": "I would rather put it this way <br>It&#39;s UPI and GST made white money,rather than great economic growth"
        },
        {
            "author": "@EnzoEnzo-it7vt",
            "text": "Despite modijis efforts he only got 2 likes"
        },
        {
            "author": "@JeshneelSharma",
            "text": "What about gdp per capita . It will benefit whole population and improve the standard of living not just making latest economy since india has most population in world now"
        },
        {
            "author": "@josephif",
            "text": "dosnt matter even if its the  5ht largest economy but its still categorized as a developing country <br>what do you thing the reason is &quot;The Rich get richer the poor gets poorer&quot; <br>that how dum modi and the people are."
        },
        {
            "author": "@avinashjain2808",
            "text": "I dont know if compounding applies to GDP or not, but does thaf mean that if India doesnt do anything going ahead and sit on the basis of compounding, then too the GDP will grow?<br>And China did not wait for compounding, they have done everything in terms of trade, infrastructure, manufacturing hub because of which they are here today"
        },
        {
            "author": "@thunder_bolt0741",
            "text": "What&#39;s the rank of India in GDP Per capita?"
        },
        {
            "author": "@jaffersharief23",
            "text": "Per capita income of india is not up to that range only GDP has been growing. The poor people are becoming more poor and rich people are becoming more rich. Indian is messed up now."
        },
        {
            "author": "@vimalpani7161",
            "text": "I am cannot it is correct but i can understand about your economy after 2014. Bluff masters"
        },
        {
            "author": "@navneethfuntrickes1087",
            "text": "Green hydrogen revolution with usage in fertilizers manufacturing, steel manf,transportation also usage of  renewable energy india will be growing 10% GDP is posdible."
        },
        {
            "author": "@Looserno.7",
            "text": "Nothing"
        },
        {
            "author": "@Letstalktruths",
            "text": "More taxes on middle class can get you anywhere."
        },
        {
            "author": "@rakeshr9187",
            "text": "We are bullshit compared to the work chinese do"
        },
        {
            "author": "@aggregor_gaming",
            "text": "What about per capital 😂😂<br>Largest population thats why economy seen heigher...."
        },
        {
            "author": "@dagapriyanshu187",
            "text": "In 10 years, quality of life for 140 crore people cannot be improved. We almost wasted the initial 50 years after independence. Now we should work on ourselves, upskill and help ourselves and our country"
        },
        {
            "author": "@Green_Earth6233",
            "text": "Communists Are The Biggest Threat To Indian Economy"
        },
        {
            "author": "@TheKingofsnake",
            "text": "Oh great good explanation but where is middle East countries why rupee down fall 😂😂😂😂😂 facts is just pass knowledge like multilevel marketing this all are myths 😂😂😂"
        },
        {
            "author": "@vijayrajan5792",
            "text": "Modi bhakti is rubbish. People have become poorer under Modi.<br><br>By PPP, India was the 3rd largest economy in 2003."
        },
        {
            "author": "@madhusudan_6924",
            "text": "Extending Tax 😂"
        },
        {
            "author": "@imranbava-g1o",
            "text": "In the name GDP race we will Indians are really suffering under BJP govt"
        },
        {
            "author": "@PRAJWOLBHUSAL-lh8ys",
            "text": "all economy boomed due to birth of adani as a result of support of government."
        },
        {
            "author": "@hemja3362",
            "text": "Which rank or we on happiness ranking"
        },
        {
            "author": "@sameershahbaz9652",
            "text": "And still we have to susbsidize and provide rationa in subsidy to about 80 CRORE people in India"
        },
        {
            "author": "@Dawali19",
            "text": "We should be proud that India is a fifth largest economy but  still our per capita income is only 2410$"
        },
        {
            "author": "@mohdirfan4665",
            "text": "5th largest economy but no proper toilets"
        },
        {
            "author": "@jerry_the_lover_boi",
            "text": "By selling everything ✨️"
        },
        {
            "author": "@ranjeettiwari6770",
            "text": "We are too much near to touch the 5 trillion economy."
        },
        {
            "author": "@Sai-msdian",
            "text": "Nothing else modi done credit goes to india"
        },
        {
            "author": "@kiranpawaar5",
            "text": "Not past 10 bhak .... After 1991 what we do right"
        },
        {
            "author": "@SagarKumar-yn9if",
            "text": "Tax lag do bus sub per  education"
        },
        {
            "author": "@japleensingh7842",
            "text": "Why think school has became Godi media?"
        },
        {
            "author": "@yogeshnegi4007",
            "text": "5th largest economy 40% unemployment"
        },
        {
            "author": "@Ayonokojikiyotoka",
            "text": "Boycott congress and waqf"
        },
        {
            "author": "@AyushmanGupta4302",
            "text": "per capita gdp of india is 2700 dollars . india ranks 100+ in terms of per capita gdp ."
        },
        {
            "author": "@SandeepSingh_500",
            "text": "What did it take to go so low in hunger index and income equality ?"
        },
        {
            "author": "@shivangipatel7989",
            "text": "Job growth doesn&#39;t attract me much<br>Poor are getting poorer richers getting richer<br>Poor labor force participation of women <br>Our worse situation in HDI and per capita income<br>And there are many more to count<br>Yes we&#39;re 5th biggest economy in world but we middle class is the backbone of this country<br>57% in this economy is coming from consumption<br>We&#39;re not manufacturing hub or anything big<br>....... Log yahi sun k khush hain k oooo my god we&#39;re the 5 th biggest economy bro we&#39;re on top in population it&#39;s all coming from consumption<br>No job no skill no growth nothing"
        },
        {
            "author": "@AdiD-kb7mu",
            "text": "People in the comments section breeding 20 kids from 4 wives shouldnt talk about economy"
        },
        {
            "author": "@Funyboyys",
            "text": "Also ask him to maintain peace and don&#39;t compete on Hindu Muslim agenda , the real Culprit is behind hindu Muslim crisis is Bjp"
        },
        {
            "author": "@Mr.Roy4",
            "text": "Pom pom it is 😂"
        },
        {
            "author": "@veer3800",
            "text": "Modi govt should focus on per capita income rather than gdp"
        },
        {
            "author": "@srijan1210",
            "text": "GDP IS NOT A GOOD INDICATOR OF SOCIAL WELFARE"
        },
        {
            "author": "@OpScop",
            "text": "5 th largest economy ho ke kya fidaa hai poor become poor rich become richer,"
        },
        {
            "author": "@tylert9875",
            "text": "Compounded interests in a country like india is meaningless statistics.<br><br>For a poor country, any real way for GDP to go up is either through bump in aggregate production (poducing newer things) or through inflation (consumers paying more for essential things). Latter has been the case in recent times."
        },
        {
            "author": "@tylert9875",
            "text": "Inflation"
        },
        {
            "author": "@predeto7462",
            "text": "Yeah &amp; our debt has increase twice + as much in his ruling tenure mention that too . Poverty,illeteracy, unemployment &amp; inflation are all time high . This is how they have done it ."
        },
        {
            "author": "@pranup7383",
            "text": "That&#39;s fake"
        },
        {
            "author": "@666madhusudhan",
            "text": "Nonsense  bravado. We need to increase per capita income to US level . Then we can talk"
        },
        {
            "author": "@umairahmad1004",
            "text": "He meant Modi hasn&#39;t done anything different. It&#39;s all congress efforts in the past that have compounded to reach 5 trillion. <br>What Modi did in the past 10 years will surely take India to 10 trillions even sooner."
        },
        {
            "author": "@selvarang",
            "text": "Nothing... just an inflation....."
        },
        {
            "author": "@gauravgogoi5240",
            "text": "But Indian government is looting in short term and long term capital gains; poor government just loots us😢"
        },
        {
            "author": "@sreecharanya3333",
            "text": "Awesome Mr PTR please hear this. Simply having population will not increase your economy."
        },
        {
            "author": "@RS96096",
            "text": "Nothing much congress is not in power that’s it"
        },
        {
            "author": "@Ucicivvilbkv",
            "text": "Love compounding ❤❤❤"
        },
        {
            "author": "@user-yf2yz8zm4i",
            "text": "Keep on talking India. A few highways is not great<br> China got bullet trains all over their country. Making bullet trains all over the world. How will this help the majority indian the very poor. Rural India so backwards no electricity no toilets Omg. Rich getting richer poor getting poorer. All projects given to his gujarithes friends Adani Ambani. India cannot improve just by bullshit only. 60% of India is very poor."
        },
        {
            "author": "@gamingforleisure4427",
            "text": "Let&#39;s not use Instagram reel edit format for YouTube shorts. <br><br>Great edit I don&#39;t mean to offend or make a judgement I hope I can jus give my observation as a  social media algorithm analyst.. <br><br>Soo back to the point .. YT and Insta are two different platforms when we use the same edit for all the platforms it messes up all the view cuz the YouTube has enhanced over time the algorithm to push the videos that does have the Tik tok logo in It. Same goes to the editing styles hey if you love to drive more traffic your YT page just use the <a href=\"https://www.youtube.com/watch?v=gfm93K-K3WI&amp;t=556\">9:16</a> format from today on you might see a difference over time cuz YT have weird rules in there algorithm like they push some channels that use to push shorts we&#39;ll only reach a certain audience it&#39;s like a &quot; hit  the ceiling kinda thingy &quot; I&#39;m really sorry is this was too long and complex. Cheers 🥂"
        },
        {
            "author": "@mr.redwind6723",
            "text": "How come so much lie in one video"
        },
        {
            "author": "@puneethchalla6634",
            "text": "Don’t be so proud of that feat. It is just the super rich who became richer. Focus on per capita income"
        },
        {
            "author": "@moviemaava4815",
            "text": "Lavdaji took away all the saving from the poor people"
        },
        {
            "author": "@alam_badrul",
            "text": "Nothing except Reproduction"
        },
        {
            "author": "@IslamDeenulhaq",
            "text": "It tricked another question in my mind, What exactly have we done so differently in the past 100 years that the population increase is more than it was in 1000s of years???"
        },
        {
            "author": "@SomeshChavhan7777",
            "text": "It’s not a big deal. India’s economy would be in the top three no matter which government was in the power because India growth rate was about 8 % even before Modi."
        },
        {
            "author": "@azhagaaa",
            "text": "Straight answer would be, govt levied tax on savings, basic life support and especially on middle class people. So we became 5th largest economy. Compounding is not at all in the picture."
        },
        {
            "author": "@Golden-Horse",
            "text": "Collect more tax from people so you will be 10 trillion dollars economy, stop this godi chanting"
        },
        {
            "author": "@mohankumar1826",
            "text": "Compounding, yes when you keep invested but s if you meddle and mess with, it takes a dive down and that is  not happening in Modi&#39;s time."
        },
        {
            "author": "@prashantshah1396",
            "text": "5th largest economy by GDP which is what we all soend to buy stuff( inflation itself takees care of this food  education, healthcare and GST) and not by income of individual. So hiw this 5th largest economy help 140 crore people? In 2011 we became 3rd largest in twrms of PPP which is much better way of getting bigger. Well well this gentleman needs a lesson in economics that the population is the only reason why we are at this GDP."
        },
        {
            "author": "@saketgaikwad3561",
            "text": "It&#39;s kind of same as bamboo sampling"
        },
        {
            "author": "@piyushdeshmukh5578",
            "text": "There is no point even if we are at no 1 economy in the world because this is jobless growth richer are getting rich and poorer getting poor and we are at 140 th rank in GDP per capita stop fooling people on the name of 5 th largest economy this economy still growing in future because of the population of our nation."
        },
        {
            "author": "@sanjaypawardhar1136",
            "text": "Dont look at economy. Look at how economy is growing by just the growth of 5% Rich people in India or 1% ultra Rich people."
        },
        {
            "author": "@bulp9893",
            "text": "Middle class tax eaters"
        },
        {
            "author": "@isshiomi6364",
            "text": "Quality education ( from Primary to Grad) &amp; healthcare services affordable to every Indian is the key to become a true &#39; Vishwaguru &#39;....Mere few billionaires, trillionaires  not going to make us Vishwaguru...you see migration of HNIs...We need richest , more than that we need more middle class people...Waiting to see those 80 cr Indians who get 5 kg / month into upper middle class...."
        },
        {
            "author": "@snaveenkumar3920",
            "text": "Compounding doesn&#39;t work with every country, well india has put a lot of effort to work that compounding"
        },
        {
            "author": "@vxn_shetty",
            "text": "I don&#39;t know just rich are getting richer middle class are getting poor. We have to talk about this also when talking about Economy. No one wants to talk about inequality in Economy"
        },
        {
            "author": "@ashilpsaji9524",
            "text": "Faking economy"
        },
        {
            "author": "@theindianrationalist6560",
            "text": "3rd largest economy during man mohansingh"
        },
        {
            "author": "@rajsharma2023",
            "text": "It&#39;s just a gradual process..... In 2009-10, china was around 5 trillion, now suddenly u see, in 10-12 yrs china 19 trillion....that too when it&#39;s growth rate slowed down in recent past.....Hence its per capita income also tripled.... <br>It will also happen with INDIA, and believe me, if china with 140 billion population can become developed, then surely by 2047 INDIA will be there<br>INDIA has walked those hard yard now, and with robust macro economic situation, it surely will.... Given there be some political  stability in next 15 yrs😊❤"
        },
        {
            "author": "@alokbaggavalli6063",
            "text": "Collected TAX."
        },
        {
            "author": "@joelsanjiv",
            "text": "Gst collection kiya hai bass"
        },
        {
            "author": "@rajeshkumar-id4vg",
            "text": "Fifth Economy, fifth economy bla bla bla. 75% Indians earn less than 5000 rupees per month, 15% earn 20000 rupees per month. 800 million are surviving on free 5 KG ration.😂😜😋"
        },
        {
            "author": "@Wherearemykez",
            "text": "😂 it takes 100% increase in efforts from all major sectors, the engineers, sales, marketing, foreign investments etc, real people 9-5, to get 10% growth year over year.<br>He just says compounding. <br>Indian logic💯🎉😂"
        },
        {
            "author": "@bathayijanathaparty9993",
            "text": "Economy ,it&#39;s not economy.😢"
        },
        {
            "author": "@m_khaute2609",
            "text": "These are just scams"
        },
        {
            "author": "@kishoregowda7871",
            "text": "Guess, i have answer to this. <br>Taxes<br>Increase taxes <br>Increase taxes on everything."
        },
        {
            "author": "@vinay82kaul",
            "text": "Chidambaram beautifully explained the concept of power of compounding in Parliament."
        },
        {
            "author": "@sparkextrugen7997",
            "text": "Just check the deposits of banks"
        },
        {
            "author": "@afzalpb3025",
            "text": "Nah, it became fifith coz... most countries dropped in the coronavirus"
        },
        {
            "author": "@roshandsa4995",
            "text": "Looking at India&#39;s condition, unemployment, high taxes this 5th largest economy bullshit doesn&#39;t make sense."
        },
        {
            "author": "@santafenm1",
            "text": "India is also the world&#39;s largest population. The percapita GDP is still in the bottom layer, close to where Bangladesh is. 😂"
        },
        {
            "author": "@mithilvyas223",
            "text": "What about gdp per capita?"
        },
        {
            "author": "@SatyaGhatnaKahaniDarrKi",
            "text": "😂😂😂 subtle propganda to build image"
        },
        {
            "author": "@argongamer8986",
            "text": "India will be $5 trillion economy but still people will have no jobs"
        },
        {
            "author": "@TabIsh90",
            "text": "China jesa quality of life and infrastructure b hona chahye"
        },
        {
            "author": "@kishorparihar6410",
            "text": "India is growing but not Indians as they need to"
        },
        {
            "author": "@Timepass_shorts95",
            "text": "Just imposed more taxes on middle classes😂"
        },
        {
            "author": "@sinnaanoep",
            "text": "Jai Modi.<br>Modi is the best <br>🇮🇳🇸🇷🇳🇱"
        },
        {
            "author": "@TheSyedalam12",
            "text": "Godi youtubers cleverly mixing nationalism with modi bhakti."
        },
        {
            "author": "@mr.bot......9428",
            "text": "Govt we will 5th economy <br>But we don&#39;t provide anything to our citizens <br>Increased tax <br>No improvement in health and education system <br>Killing middle class stability <br>Corruption is at peak <br>  Richer getting richer poorer getting poor"
        },
        {
            "author": "@Aviator77186",
            "text": "Compounding... Eighth wonder... We didn&#39;t even realise about the leap will be achieved progressively by compounding"
        },
        {
            "author": "@madjack9283",
            "text": "What&#39;s compounding"
        },
        {
            "author": "@JaiBheem..",
            "text": "People complaining that not just becoming wealth powerhouse asking for the improvement of quality of living and showing hygienic conditions as examples. You must remember that it primarily comes from citizens first. How much u r contributing for the cleanliness of ur community. Simply, how many of u knows n follows the domestic waste management rules."
        },
        {
            "author": "@PVAR1983",
            "text": "I heard from the school that the Indian economy will reach 5 Trillion by 2020 but now the year is 2024?😊😊"
        },
        {
            "author": "@PVAR1983",
            "text": "You are saying india will achieve 5 Trillion dollar exonomy by 2027 lets see as i heard form school that Indian economy will surpass USA by 2020 and i hope you guys are still living in dreams😊😊"
        },
        {
            "author": "@PVAR1983",
            "text": "5th in overall GDP because india have the 2nd largest population but you both guys don&#39;t know nothing,we should calculate the per capita Income.😊😊😊<br><br>The percapita Income is for India is 185 among 220 country rankings😄😄😄"
        },
        {
            "author": "@reidevanson181",
            "text": "Let me tell you the real reason: 1.5 BILLION people. 20% of ALL PEOPLE on earth are Indian. India has a per capital gdp of $2700 usd which is 137/191 out of all countries,"
        },
        {
            "author": "@PVAR1983",
            "text": "Useless debate..manipulated GDP ,Printed more money and now the overall economy in 5th position😊😊<br><br>The india population is 2nd and overall economy is 5th..Doesn&#39;t make any sense😊😊"
        },
        {
            "author": "@talk2regi",
            "text": "What is compounding? How did it help us"
        },
        {
            "author": "@rahulguptha3131",
            "text": "Modi only thinks about rich people getting richer where middle and poor suffering from mistakes done by corrupt businessman and politicians modi is one of the worst adminstrator in the economy management and destroyed south india future growth"
        },
        {
            "author": "@SayHelloDude",
            "text": "India has expanded the scammer business multiple folds."
        },
        {
            "author": "@Kumarmanojmani",
            "text": "india was third largest economy when modi came in power in2014  it is still 3rd largest after 10 years on the basis of purchasing power parity........just a small information for u"
        },
        {
            "author": "@prabhakar0076",
            "text": "Compounding works bcos of working /spending population"
        },
        {
            "author": "@paulabhilash5852",
            "text": "BJP made Indians more poor than ever they are making our lives  hard to live in India"
        },
        {
            "author": "@siddheshjadhav",
            "text": "People also forget, unemployment, decrease Foreign investment, farmer problems, and education issues. No one is giving awards for the 5th largest economy."
        },
        {
            "author": "@officeofsatish",
            "text": "So true. For this compounding to blow in recent years, the investments must have happened some 30-40 years ago....by likes of Manmohan Singh probably"
        },
        {
            "author": "@gauravsisodia8550",
            "text": "But sir earlier we used to pay 50rs for petrol now 100rs, i am happy in 10th largest economy rather than 5th largest economy"
        },
        {
            "author": "@AtharvaSasture",
            "text": "In which school they teach compounding?"
        },
        {
            "author": "@positive.vibes314",
            "text": "Compounding on taxes 😂😂😂"
        },
        {
            "author": "@positive.vibes314",
            "text": "Sir I don&#39;t understand,  weather India&#39;s population is compounding or per capita income is compounding..."
        },
        {
            "author": "@FarazSyed-ke2cv",
            "text": "The us banned Chinese products"
        },
        {
            "author": "@jonnalakiranreddy6364",
            "text": "Through taxing middle class and poor bhai, please don&#39;t even dream of comparing with china bhai 😮"
        },
        {
            "author": "@conrad.k9371",
            "text": "GDP hardly matters what matters is the GDP per capita and the quality of life of citizens. If you ask any ordinary Indian if they would rather stay in India or move to New Zealand, Singapore,  Isreal , Luxembourg or simple UAE, Qatar many would say yes without a blink . Even some African countries like Mauritius🇲🇺, cape Verde🇨🇻, Botswana🇧🇼, Namibia🇳🇦 all have higher quality of life than India. To actually matter on the global stage you need to have a good GDP and good quality of life for its citizens. The bad infrastructure, the indian caste system will always way India down. Something that china never has to worry about"
        },
        {
            "author": "@smartoont7184",
            "text": "BJP mouthpiece"
        },
        {
            "author": "@kushaljain3767",
            "text": "Finally someone said it!!!!"
        },
        {
            "author": "@harshag1335",
            "text": "Its bcz of tax payers n gst😂😂"
        },
        {
            "author": "@krishnac5191",
            "text": "This is the most disguised Modi bhakt channel on youtube. They cant even make a thumbnail without Modi’s face no matter what the topic is"
        },
        {
            "author": "@matthewtamang6591",
            "text": "Population increase"
        },
        {
            "author": "@Noneofthese.",
            "text": "Ye compounding khangress kr time kaha chali gyi thi"
        },
        {
            "author": "@saravanakumardharmar8122",
            "text": "Its not get last 10 years .that seed put  congress now harvest."
        },
        {
            "author": "@mdnadeemakhtar9601",
            "text": "GOOD👏🏼BUT WHAT ABOUT MAIN THING, PER CAPITA GDP 🤯😤👎🏼🇮🇳"
        },
        {
            "author": "@karanbhau",
            "text": "From 2004 to 2014 gdp grew from 700 bn to 2.1 tn more than 3 times from 2014 to 2024 gdp grew from 2.1 tn to 3.8 tn not even double....so our growth have decreased.....since vishwaguru took over...."
        },
        {
            "author": "@fatirabbas7276",
            "text": "What do you mean compounding 😂 no other country is compounding? If you don&#39;t have answer, Kuch bhi pel do English me 😂 we&#39;re a country, not a bloody SIP. <br>Answer the damn question man"
        },
        {
            "author": "@rskumar0701",
            "text": "Only factual information needs like this"
        },
        {
            "author": "@subhaschandraboseparvatane6617",
            "text": "What does he mean by compounding…?? Can anyone explain…??"
        },
        {
            "author": "@amittghosh",
            "text": "Bro if India is fifth largest economi then why Modi is giving ration to 80 core people. Bro Modi for Ambani and Adani. That is the difference between congress and bjp<br>Please don&#39;t oiling Modi."
        },
        {
            "author": "@monganguly4539",
            "text": "Consumption of Alcohol is very important 😐"
        },
        {
            "author": "@mandarbathkal1996",
            "text": "Do you know brother in indonesia there are 96% muslims and 2% hindus yet 11000 mandir because there is no RSSS"
        },
        {
            "author": "@hometv-sr",
            "text": "Yukkkkkk. This has become a godi YouTube channel now. Unsubscribing now. This is how you kill your YouTube channel. Do exactly opposite of what made you grow so big. This when you don’t know who your audiences are and what they want. Shameless."
        },
        {
            "author": "@Trendy_Content_Hub",
            "text": "Contribution 0 by putting so much tax for everything more after manmohan singh whomever comes india goes to 3rd thats al whoever comes it can&#39;t go 2 or 1st"
        },
        {
            "author": "@ADIVASIJAGRUTI",
            "text": "And the cronicapitals eat flesh of working class"
        },
        {
            "author": "@varunbanthia1318",
            "text": "Why didn&#39;t power compounding worked for others?"
        },
        {
            "author": "@WORLDCITIZEN2004",
            "text": "Inflation is high India"
        },
        {
            "author": "@WORLDCITIZEN2004",
            "text": "What is GDP per capita?"
        },
        {
            "author": "@sagarmore5717",
            "text": "Big leap: No dude it&#39;s Compounding 😅"
        },
        {
            "author": "@sajiths5538",
            "text": "For those saying manmohan singh&#39;s name . His only contribution is taking credit of a forced LPG reform. Nothing more than that."
        },
        {
            "author": "@yugalparmarofficial",
            "text": "The credit goes to the people of India and no one else."
        },
        {
            "author": "@Gon12e",
            "text": "Ive been hearing this same shit of india being one of largest economy, meanwhile nothing has really changed, I mean literally nothing."
        },
        {
            "author": "@teagrower",
            "text": "With $😊 2.5K per capita we are no match to China, discuss the facts"
        },
        {
            "author": "@mehul88",
            "text": "Lol grew at 8% under MMS now we grow at 5%"
        },
        {
            "author": "@ooruthendy6502",
            "text": "I didn’t understand what these figures made changes in common people’s life , I can not see any difference , only difference is people are more familiar with internet , Rich becomes more rich  , middle class got more burden of taxes"
        },
        {
            "author": "@rohitmridultigga5135",
            "text": "Income inequality at its peak<br>Unemployment at its peak<br>Loans at peak<br>Per capita income difference <br><br>A lot more"
        },
        {
            "author": "@ShivmRaj1",
            "text": "Also compounding  the inflation in the country"
        },
        {
            "author": "@srvn6383",
            "text": "Everything bcoz of IT Industry which pulls in USDs from west.<br>But there is no special or bettrr infra for them.<br><br>Main reason is their parents, who worked hard for children&#39;s studies"
        },
        {
            "author": "@abhishekasthana1911",
            "text": "Basically he is telling that this is the effect of good fundamentals of India over a period of last 70 years and we are viewing the results now ....."
        },
        {
            "author": "@muralirsk",
            "text": "Why asking him??  Ask me. I work hard and pay taxes to govt and fill business people pockets. Where I am still a middle class. 😂😂😂"
        },
        {
            "author": "@vaibhavpatel6507",
            "text": "It&#39;s great that we headed to 5th place but our population is largest among all. <br><br>Purchasing power , Median income, affording power with inflation should be also considered. <br>The gap between Poor middle class &amp; rich to be noted. 🙏 <br><br>Income inequality is insane in india !<br>India has 11.09 million (1 crore) vacan flats in urban area !  I could not believe, on otherside middle class is struggling to buy 50 lack of 2 BHK in tier 2 cities ! (Putting saving of half life) !"
        },
        {
            "author": "@shailen6669",
            "text": "Shame on you think school you are no different than any other YT content creators"
        },
        {
            "author": "@vishal_saini3629",
            "text": "One&#39;s Einstein said.... Compound interest is the 8th wonders of the world...."
        },
        {
            "author": "@DanishMsd",
            "text": "Doubt can you compare the development rate of india with congress and bjp.<br>Mainly compound  rate.<br>Don&#39;t try to fool us with words."
        },
        {
            "author": "@wiper123ful",
            "text": "We should look at GDP per capita not only GDP"
        },
        {
            "author": "@victorvelo",
            "text": "Why are we beating our chest in pride? Per capita income Kab badhega? When will the public services improve? Jobs Kaha hai?"
        },
        {
            "author": "@SankethS-fh8zl",
            "text": "Podcast hosts should be more intelligent and should study the subject and topic before asking questions...."
        },
        {
            "author": "@souvikadhikary9429",
            "text": "Modi he to mumkin hoga"
        },
        {
            "author": "@satish4cs",
            "text": "OMG, I never applied compounding to GDP ..this thought can be a starting point for many things ❤"
        },
        {
            "author": "@swapnilpatil4545",
            "text": "India was 6th largest economy in 2014"
        },
        {
            "author": "@SandeepSingh-uf2kh",
            "text": "How many India families say bye-bye to India million dollar Rich family"
        },
        {
            "author": "@reggi4206",
            "text": "China&#39;s success is not just about compounding. They started off at the right time. Being at the right place at right time is important. India started late and the ball game is much different than what it was during the rise of China. India will take much much longer and ten times more effort for us to reach where China is today. Say another 40 yrs at the least!!!"
        },
        {
            "author": "@Lezilanto",
            "text": "All chamchas ..Don&#39;t even know that..we have suffered due to Demo and GST..otherwise we would have been higher than what it is now.."
        },
        {
            "author": "@arjunsingh97767",
            "text": "May be by hiking all prices...also people spend by taking debt..."
        },
        {
            "author": "@Khaaliboat",
            "text": "Some People seem to have lost touch of these realities<br><br>1) we&#39;re the most populous country in the world.<br><br>2) we&#39;re still dealing with the aftermath of COVID like any other country and now the wave of AI taking up most of our jobs.<br><br>3)Despite the war tensions and economic crisis among our neighbours we&#39;re doing far better than all of the developed countries put together, if not great !<br><br>Running a country like India,the largest democratic nation with such diverse culture,is no joke. And I don&#39;t fanboy around any of the political parties one might want to associate me with but honestly, you can take your criticism anywhere but here."
        },
        {
            "author": "@abhijeetchatterjee4129",
            "text": "Very unclear as to what he means by compounding."
        },
        {
            "author": "@SIDEWAYS1.0",
            "text": "Taxes will get us there"
        },
        {
            "author": "@behzadibrahim4408",
            "text": "a bigger economy doesnt mean a better economy"
        },
        {
            "author": "@guitarfreekin",
            "text": "Thats half truth, compinding also creates inflation, that is also why shanghai is literally unaffordable to middle class as are most cities in china, at this rate india will become unaffordable for all middle class, the very class that paus 90% of tax!! So much for modis dumb economics!"
        },
        {
            "author": "@abhishek001ghosh",
            "text": "Yes, and still, people are opting overseas for jobs and education. The 5th largest economy doesn&#39;t mean anything when the mass is still uneducated and poor, unemployment persists,  horrible work culture, hierarchical superiority at its peak,  no security for women and kids, etc. So stop bragging.  It means nothing."
        },
        {
            "author": "@pranov.radhakrishnan",
            "text": "Sir but ex rbi cheif already said we wil still be poor even reach 3 economy...?"
        },
        {
            "author": "@Radiologyresources",
            "text": "We have more people now"
        },
        {
            "author": "@SantanuProductions",
            "text": "This is a bullshit logic. In that case, every nation&#39;s wealth should grow. Indias economy is growing faster because of the perspective change among western investors. Indian manufacturing is still there in its 80s grapling with, dilapidated infra, huge tax burden and average markets."
        },
        {
            "author": "@truth7653",
            "text": "Slums of Bombay Calcutta Delhi and Madras, 85crores living on govt. free food, health service for an ordinary man non existent, education for the poor not there, no social security. India’s progress is just big talk."
        },
        {
            "author": "@sasd570",
            "text": "Compounding, what?"
        },
        {
            "author": "@arunm6727",
            "text": "Nothing much it&#39;s because of debt.non biological chuitya has tripled our debt within 10 yrs 😂"
        },
        {
            "author": "@narsingrao345",
            "text": "Poor remains poor and becoming more poor no employment no new industries no new companies no jobs in 10 years then how it become 5th largest economy I don&#39;t understand"
        },
        {
            "author": "@user-el7qm7pb3h",
            "text": "In this achievement what is the contribution of north India..?"
        },
        {
            "author": "@imamruta",
            "text": "Ok compounding what? Interest rate on cc bill taking money from general middle class people? Or India loaning money to other countries and getting compound interest? Just compounding don&#39;t make sense. Probably need to watch full episodes for more info."
        },
        {
            "author": "@rafiahmed21",
            "text": "Modi, Only Lies spreading.. Irresponsible Lies.."
        },
        {
            "author": "@Rajesh1622",
            "text": "It&#39;s a shame 5th largest economy doesn&#39;t have basic needs like 24/7 electricity and water supply.. 🤡🤡 4 trillion GDP doesn&#39;t mean a sh !t"
        },
        {
            "author": "@kvijayp2785",
            "text": "😂😂😂😂😂 10 years back India currency 40 rs one dollar today 83 rs one dollar 😅😅😅😅😅"
        },
        {
            "author": "@AbhijitZimare",
            "text": "The only measure of progress is GDP per capita and HDI index"
        },
        {
            "author": "@sibyeapen3716",
            "text": "Taxation is one of the secret ingredients."
        },
        {
            "author": "@kradhakrishnan4879",
            "text": "Hey it is not ecoNomy!! It’s eConomy. Get your basic pronunciation corrected. But ecoNomics! Get your basics right it is important."
        },
        {
            "author": "@anupamdein",
            "text": "Modiji is fooling people. We are not looking at GDP per Capita. We remain poor.China&#39;s per Capita income is 6 time that of India. In India all the benefits of growth is going to the super rich.India still has the highest number of the poorest people in the World.Even after almost 80 years of independence we haven&#39;t been able to solve this."
        },
        {
            "author": "@uddiptabarman334",
            "text": "But per capita income still at the bottom of the ladder. We need more development because compared to our population even 5 trillion is not enough."
        },
        {
            "author": "@majeeshtp593",
            "text": "By looting the tax payers. They get rich..😂"
        },
        {
            "author": "@amardeepchanda4880",
            "text": "Modi is fooling his andhbhakts"
        },
        {
            "author": "@HarishBhatia-z7l",
            "text": "Can I have talk with your Guest as I have goal to start world largest Asset Management Company but our raising of funds is totally different and can digest $9/-  Trillions Dollars per month for next 30 years, let&#39;s talk"
        },
        {
            "author": "@fayazasif1538",
            "text": "Purchasing power parity remains same all throughout these years.india was 3rd in PPP then india was 3rd in PPP now"
        },
        {
            "author": "@anshalmehta4273",
            "text": "Wages and Salary hikes are stagnant, Cost of Public Education and Public Healthcare has become more expensive, <br>Thanx to climate change in which Western countries contributed to more carbon emissions countries like India will have more cyclones, floods and extreme weather events, water crisis will add on to agrarian crisis, AI will lead to further job losses in the millions, already due to AI less people are being hired, even if India becomes the  largest economy on earth it will be a country of the rich not paying their fair share of taxes, middle class being overburdened with taxes and poor people being divided in the name of religion and caste and when they demand jobs shut them up with freebies 😢😢😢"
        },
        {
            "author": "@prashanthyeprash9838",
            "text": "Modi has done nothing to become 5th largest economy .it just happened because of population and a policies implemented by Man Mohan Singh"
        },
        {
            "author": "@saurabhsharma2319",
            "text": "Modi ji did nothing is exactly right....no schools , hospitals , roads but that too with poth holes....also no improvement in judiciary and very important jobless youth."
        },
        {
            "author": "@kaushiksharma1327",
            "text": "Increased taxes and revenues of government 😂"
        },
        {
            "author": "@raghavendra1988",
            "text": "Government must introduce population control bill or it&#39;ll go out of hand already resources are low but birth rate is unabated where will you fit all of them how will you provide healthcare and education to those who want to study please increase manufacturing"
        },
        {
            "author": "@deepakoneonly",
            "text": "If we don&#39;t have Modi ji, we would be far ahead then now..."
        },
        {
            "author": "@fareed240",
            "text": "Think school to think bjp"
        },
        {
            "author": "@lakshmanabheemarao7395",
            "text": "Come what may, INDIA will be super power"
        },
        {
            "author": "@Bliss-pt2np",
            "text": "I agree with whatever he is saying but Affordability matters …"
        },
        {
            "author": "@sriecek",
            "text": "By lootong middle class with more tax more gst..with new increased tax we can become no one also..😂"
        },
        {
            "author": "@sachinbisht5920",
            "text": "Talk about per capita income"
        },
        {
            "author": "@rajasharathchandraacha9542",
            "text": "What is compounding? We all know that it&#39;s just compounding. Who and what is responsible for the compounding is what we are asking."
        },
        {
            "author": "@shivammalhotra4328",
            "text": "and still millions die off hunger in our country. that&#39;s a shame"
        },
        {
            "author": "@xerox-f1p",
            "text": "Jobless economy... Only high tax no good living providing"
        },
        {
            "author": "@uTube00789",
            "text": "5th largest. Right. Where&#39;s that incoming going though? Ambanis and Adanis?<br>Common public income per capita is still as good as Bangladesh&#39;s."
        },
        {
            "author": "@aakashnandi8202",
            "text": "Think school is just another gov&#39;t propaganda machine like Palki Sharma. Why don&#39;t you all about the world Bank /IMF debt."
        },
        {
            "author": "@Just_forfun9140",
            "text": "Percapita income is a better measure for comparison with other advanced countries, it shows the difference. Smaller countries may not have huge GDP, but the Percapita income could be very high."
        },
        {
            "author": "@harshitmithreja8861",
            "text": "Reducing CA Audits and making the country more into a huge bubble of fraud.  That&#39;s what happening here guys. Believe me ease of doing business is a scam."
        },
        {
            "author": "@pramodap4691",
            "text": "Our beloved PM is an NRI PM who dance and does photoshoot, is really enjoying his life using our tax money, we have to vote Rahul for a change, because under bjp minorities are suffering the brunt"
        },
        {
            "author": "@ravisankar5297",
            "text": "I would say, we are slowly becoming a capitalist country from being a communist for past 70 years..."
        },
        {
            "author": "@SajjadKhan-nv2td",
            "text": "Is the concept of compounding that this Fundu master is giving only reserved for India?? What happens when our $4 trillion  compounds twice the rate as compared to China&#39;s $18 trillion??<br>We will still take more than 5 decades to catch up!!! And with the mad assumption that China&#39;s growth rate is half as compared to ours..😂<br><br>Pl stop misleading..<br><br>Our citizens are drowning more in the streets, not in rivers, lakes or ocean.."
        },
        {
            "author": "@suji1103",
            "text": "I wish our country maintains good infrastructure especially city town and village roads and cleanliness. This will put India at par with foreign countries"
        },
        {
            "author": "@god_stark001",
            "text": "We were already 2.7 trillion dollars gdp in 2014 and 6 th largest economy behind UK<br>In 2016 we surpassed UK and become 5 largest economy with 3 trillion dollar gdp<br>So actually give thanks to Dr. Manmohan Singh who made this happen"
        },
        {
            "author": "@ashokjaishankar7704",
            "text": "The world paved way for India in disdain. They got sick of 3 %,so for a change de accerelated their own growth to help India catch up. Theory of pupponomics"
        },
        {
            "author": "@manan-543",
            "text": "5th largest economy with almost 140th gdp per capita. India is a rich country with poor people. If india keeps ignoring this part of the population and keeps favouring the rich we will never reach the level of usa and china. We should learn a few things from china on how to best use their large population"
        },
        {
            "author": "@deepakberry3235",
            "text": "So as per him it has grown on its own or it was destined to become the fifth largest economy even if the Government just sat back and relaxed and despite the Pandemic for more than a year!!!<br>Respectfully disagree with him. The Government policies and the push have a major role to play in this."
        },
        {
            "author": "@Kspreddy",
            "text": "Bro started following huge content and then Lot of pieces<br>Something called machine gun strategy right..!"
        },
        {
            "author": "@shubhakantnayak1458",
            "text": "By . Exploiting middle class people"
        },
        {
            "author": "@snap1444",
            "text": "This is the the problem with BJP . Trying to claim success when they are nowhere near success. I am a supporter of BJP , but. The results need to speak instead of these media bytes. Just go to China and then compare India. Even in 50-100 years, India can nowhere be close to China in i in infrastructure, quality of life, technology advancement, etc.  BJP, stop boasting success"
        },
        {
            "author": "@ahmadkhan5236",
            "text": "Sir woh …. GDP per capita ?"
        },
        {
            "author": "@HavishG",
            "text": "Simple and powerful lesson that they don&#39;t teach us at school"
        },
        {
            "author": "@Conqueror25",
            "text": "5th largest se koi faayda nahi agar we don&#39;t have several others stats to back it up. Countries like Vietnam, Japan, Singapore &amp; Germany are much stronger and resilient economically despite not being the largest economies (except Germany &amp; Japan)"
        },
        {
            "author": "@pranavsharma5101",
            "text": "People also forgot that we are  expanding as a jobless economy"
        },
        {
            "author": "@Krishabh_Agrawal",
            "text": "What kind of comparison is that?<br><br>Do you know that we have over 150 crore people and even if they earn ₹1000 more, collectively gdp number will look good?<br><br>Do you know top 50 families hold 30% of India&#39;s wealth?<br><br><br>Sabka saath 50 ka vikas se desh ke logo ki condition acchi ho jaayegi?"
        },
        {
            "author": "@ILDG86",
            "text": "This guy is giving credit for India’s economic growth on a math concept and suggest India has exclusive right to Compounding and nobody else ? 😂😂😂😂😂"
        },
        {
            "author": "@nirmal886",
            "text": "Yes because of inflation.. Cost of decent house in metros are un affordable"
        },
        {
            "author": "@AsmaKhan-nv7ye",
            "text": "Meanwhile India&#39;s GDP per capita 😅😊"
        },
        {
            "author": "@shamakrai3310",
            "text": "Wrong, answer is High taxes.<br>Many economists don&#39;t consider GDP as real growth because high taxes give high GDP numbers. Instead GVA or HDI should be considered as growth indicators."
        },
        {
            "author": "@bhagwanmokate7436",
            "text": "Yes.. 5th largest economy where middle class is bearly surviving, farmer protest wrestler protest manipur violence is neglected by government, major exam papers like neet get leaked, election officer gets caught on camera while damaging non bjp votes and 2 crore jobs every year jumla turns into internship jumla.<br>Shame on you to create biased content."
        },
        {
            "author": "@jackiecooper9439",
            "text": "Such a non-answer. Bruv was given a chance to say the accomplishments and basically said we just stood and watched it grow on its own."
        },
        {
            "author": "@rvs99",
            "text": "So its clear that Modi has not done anything more than he is at the right time as PM. <br><br>Actual work has already done by past governments which has significant impact in today’s India’s place which Modi never highlighted and appreciated."
        },
        {
            "author": "@Kumar.saravana09",
            "text": "Economy increased for who?? Guys like had grown up but majority are still same."
        },
        {
            "author": "@suryakiran4722",
            "text": "how, give more debts to padani and pambani and let them have as debts as possible they keep on expanding as much as possible"
        },
        {
            "author": "@mystifyingdude",
            "text": "5th largest economy is nothing. It’s gimmick"
        },
        {
            "author": "@allwinmoirangthem3353",
            "text": "gdp per capita is Fucked up"
        },
        {
            "author": "@raghuramkondapuramraghuram5158",
            "text": "Nothing extraordinary . You borrow and sell assets y get economy but this is rubbish. Need to get contributed by every Indian to oncrease per capita gdp and income. This way we can never be able to catch h up with China."
        },
        {
            "author": "@harzzz2375",
            "text": "Lol nobody talks about gdp per capita"
        },
        {
            "author": "@watchyourjet",
            "text": "⬆️ economy <br>⬇️ sanitary"
        },
        {
            "author": "@varunshivan9569",
            "text": "Tbh, gdp position doesnt matter as much because it doesnt represent our public&#39;s condition. Considering 1.4 billion population, being 5th or 3rd  looks like we are a very poor country. <br><br>Modi wants our focus to be on that for his political campaign but our focus should be on public condition such as per capita, quality of life, corruption, infrastructure, healthcare, etc. basically HDI."
        },
        {
            "author": "@mk-mq1od",
            "text": "Wise people laughing on the video"
        },
        {
            "author": "@mrgz999",
            "text": "Question should be How much has the quality of life improved?"
        },
        {
            "author": "@Navyadurga-pu4qt",
            "text": "Thank you"
        },
        {
            "author": "@skinny_bruh_shorts",
            "text": "it&#39;s hard to crack exams like JEE ADVANCED,NEET,CA &amp; UPSC etc and exams like ILETS GRE etc are too easy for Indian students.<br>My dental college batchmate had dropped a year to crack ug neet but cleared ILETS with ease(she prepared for 15days).<br>And also cannada will soon be a 3rd world country <br>Uk will be broke soon❤"
        },
        {
            "author": "@Vict-nu4id",
            "text": "It’s not modi it’s we Indian have done and the politicians are enjoying on our name"
        },
        {
            "author": "@amaldavid5492",
            "text": "Compounding because of Manmohan Singh ji."
        },
        {
            "author": "@HARSHDHV1",
            "text": "News<br><br>Opinion<br><br>Columns<br><br>P Chidambaram writes: Under 6 per cent is uninspiring<br><br>P Chidambaram writes: Under 6 per cent is uninspiring<br><br>The record of the BJP/NDA government in the last 10 years has been uninspiring. Against the UPA’s record of 6.7 per cent under the new series (it was 7.5 per cent under the old series), the NDA government has been able to register a growth rate of only 5.9 per cent over ten years<br><br> Indian express. 25feb24"
        },
        {
            "author": "@HARSHDHV1",
            "text": "The host forgets that the growth rate of GDP  of NDA govt is lesser that of upa govt."
        },
        {
            "author": "@user-mm1wj8il4n",
            "text": "So explain why are a majority of Indian citizens are sending their children overseas to Canada and United States to get a college education with hopes of getting a visa citizenship and high paying job to be able to pay back their parents and possibly bring them over away from India 🇮🇳? Make it make sense please?"
        },
        {
            "author": "@SAY-jf3hy",
            "text": "Spitting facts"
        },
        {
            "author": "@srikarthikeyan7304",
            "text": "Numbers will not tell you the full story"
        }
    ]
}