{
    "videoId": "rPkT8OvjyDU",
    "totalComments": 213,
    "comments": [
        {
            "author": "@vedgupta1686",
            "text": "Very well said, redirect to Sanjeev Sanyal"
        },
        {
            "author": "@Freespeech5257",
            "text": "When will you have the guts to admit that you&#39;re a godi😂😂"
        },
        {
            "author": "@akshayshetty1299",
            "text": "Now they have started blaming that state and country failed some got-dammit corrupt dynasts 😄"
        },
        {
            "author": "@shortx3144",
            "text": "A pure Bakht"
        },
        {
            "author": "@nihalojha99",
            "text": "Nehru blames Hindus for his blunders<br><br>Rahul Gandhi blames the election commission for his losing.<br><br>It&#39;s a family thing"
        },
        {
            "author": "@behuman3869",
            "text": "If the state makes a failure out of Nehru, then you can’t blame a whole state. It is a politicians job to make things work. Sure it was a tough time. But the state cannot progress on its own. So it will need competent ppl to run it. <br>Therefore this debate makes no sense."
        },
        {
            "author": "@pkbalram640",
            "text": "Nonsense. Call a spade a spade.<br>Hindus or non Muslims don&#39;t have to grow the population to take over, only Muslims does. Wake up."
        },
        {
            "author": "@princeofheaven19",
            "text": "But Nehru was not Hindu"
        },
        {
            "author": "@user-ps1fc9pt4i",
            "text": "The 85% corruption was not by Nehru but by Hindus (bRahmins) of India who were looting India and Indians."
        },
        {
            "author": "@user-ps1fc9pt4i",
            "text": "Hindus failed to beat the British"
        },
        {
            "author": "@ashyjager",
            "text": "Meanwhile Modi ji.... I blame Nehru for the failure of India&#39;s economic growth  😎"
        },
        {
            "author": "@vasistas.b.9140",
            "text": "We have embraced capitalism in 1992. It has been 30 plus years. There is a civilisational problem attributed to the failure of our economy. <br>For example: our management practices in the MSMEs are so unorganised and lack order. Lack of cleanliness, quality in our infrastructure are still the reasons why our businesses are perceived as inefficient. Although the term Hindu - religion, could have been avoided, civilisational failure is a truth that no one can say otherwise. <br>Secondly, why are the bhakths so offended? Don’t you guys consider Hinduism as not some religion, but in fact everybody who resides on the south of Hindu Kush mountains. According to you, it is a geographical identity right. That means practising Muslims are also a part of it. <br>Why are you guys butthurt ??"
        },
        {
            "author": "@turnonage",
            "text": "Irony is Out of that 85 leakage...gandhi himself took 50😂..remaining 35 distributed ...."
        },
        {
            "author": "@vrindavanguj7361",
            "text": "Now Adani/ Ambani growing since 10 years. 1000X"
        },
        {
            "author": "@dufus360",
            "text": "Whenever BJP wants to win election such terms suddenly pops up and nehru blame game takes a course 😂😂😂😂.<br>Congress vs Hindu narrative getting build once again."
        },
        {
            "author": "@hariompathak7395",
            "text": "Muslim rate of growth in pakistan"
        },
        {
            "author": "@oneup7775",
            "text": "Now we have the Hindutva rate of growth 💯💫🏁🏁🏁"
        },
        {
            "author": "@nagabhushanar.s6113",
            "text": "It was not Hindu rate of growth. It was nehru rate of decay."
        },
        {
            "author": "@shamakrai3310",
            "text": "That&#39;s actually true. If our culture was not so much backward, we would be now competing against USA like how China is doing currently. That&#39;s because China became an autocracy and have a big cultural shift.<br><br>Even today, china has 100% female participation and we don&#39;t even had 33%.<br><br>Yes, our culture has both positive and negative things, but we hold on to the negative things very much. Which ultimately caused our nation to losses.<br><br>Even now, the disease of casteism only exist in India and what are we doing to eradicate it ? Nothing."
        },
        {
            "author": "@yj9032",
            "text": "When something good happens: praise Hindus<br>When something bad happens: blame nehru<br><br>Got it"
        },
        {
            "author": "@yj9032",
            "text": "When BJP something bad: Don&#39;t blame Modi, blame Ministers<br>When Congress does something wrong: Blame Nehru 😂😂<br><br>Hindus should stop playing victim card and own up their mistakes."
        },
        {
            "author": "@rohitnunna5545",
            "text": "This MC talking about Nehruji failure 😂"
        },
        {
            "author": "@pkochujpkochuj",
            "text": "Stupid naration by Congress &amp; lootians"
        },
        {
            "author": "@bibekanandmishra6933",
            "text": "Hindu Rate of Growth is 80%of population that is Hindus are paying 90%of tax"
        },
        {
            "author": "@shahidchaudhary52",
            "text": "Everyone knows corruption has doubled, under BJP government if not tripled, but no one gonna question bjp , because apparently bjp is whole Hinduism and modi is the devta ......😅😅😅😅"
        },
        {
            "author": "@freedom3040",
            "text": "Pakistan is going through Muslim rate of debt crisis and growth"
        },
        {
            "author": "@drsmmalik7049",
            "text": "These two will open Boeing like company after this discussion 😂😂"
        },
        {
            "author": "@downtown2994",
            "text": "Blame nehru for everything 😂"
        },
        {
            "author": "@anishmurali874",
            "text": "He still didn&#39;t answer the qstn... 😂"
        },
        {
            "author": "@prateekgodara7090",
            "text": "Blaming the victim is also what the current government is saying."
        },
        {
            "author": "@JoeB2825",
            "text": "Don’t forget Gandhi who brought this plague called Nehru, things would have been better if we had rightful Prime Minister Sardar Vallabh bhai Patel"
        },
        {
            "author": "@piyushkumar517",
            "text": "Chacha any policy is better than whole nation working for two people Policy 😂"
        },
        {
            "author": "@piyushkumar517",
            "text": "All these IIT engineered and IIM graduated kids on Salary of PSU employee father talking about Failure of Nehru economic policies."
        },
        {
            "author": "@binavinu",
            "text": "Present politicians are failing to govern for middle class and poor rather pimping for the super rich. So for eye washing the public to hide the loot they blame Nehru"
        },
        {
            "author": "@beindian4508",
            "text": "Don&#39;t blame any government. Electing PM n government is the reflection of voters mentality at any given time. So blame citizens but not government"
        },
        {
            "author": "@harisankart7970",
            "text": "Still rotten congress is double strong in indian politics"
        },
        {
            "author": "@viveksingh526",
            "text": "This person is biased. The anchor."
        },
        {
            "author": "@akhiltyagi6141",
            "text": "Muslim rate of growth is 900%"
        },
        {
            "author": "@user-qz3to7gd5l",
            "text": "Now Pakistan is growing with &quot;Muslims Rate of Growth&quot;"
        },
        {
            "author": "@yugmathakkar4023",
            "text": "It should&#39;ve been called the secular rate of growth."
        },
        {
            "author": "@sayedasadulla",
            "text": "You get a country with remains of a loot, recovering from pain of partition, lack of institutions &amp; infrastructure....and you lead it to a hopeful generation leading global companies and now even countries with with PM&#39;s of Indian origin. <br><br>On the other hand we have a govt which has all the infrastructure and motivated youth yet instead of chanalizing this energy to complete with so called western Elite, We are made to hate our own country men and compare our selves with our failed neighbouring countries to give us a sense of false Pride. <br><br>All this will reflect on India/ Bharat of the future which is waiting for its competition (China, Russia etc) to fail rather than improve itself and become a 1st world country. We can&#39;t be No.1 by merely being a service provider to the 1st world countries of the world. Empowering fellow countrymen and unity alone can achieve this feat. That has been biggest failure of the current govt which rides on propaganda and image building alone without any core substance. <br><br>Empires came and went so will this phase of India/ Bharat. What could have been achieved in our generation will now be delayed by another 2-3 generations and in the whole process if world falls into WW3 then this will just be a dream unfulfilled."
        },
        {
            "author": "@deviduttamohanty-ibm3258",
            "text": "At least someone acknowledged. Baharatiya Jumla Party of which the speaker polishes shoes 24*7 never acknowledge their failure."
        },
        {
            "author": "@alburaq3290",
            "text": "Nehruvian Socialism was a curse for India. His entire dynasty has been a curse."
        },
        {
            "author": "@lavanyashrees2745",
            "text": "Let me tell you something guys, if other religion people are put outside India they have many other Islamic countries. But for a Hindu, India the Hindustan is the only place. Its high time folks"
        },
        {
            "author": "@MegaDon000",
            "text": "Rajiv gandhi was right about corruption and thank god we got modi he wioed oit corruption in just 5 years and replaued it with bhakchodi...which is leagalised corruption....nothing has changed now police politicians govt sevants take more bribes govt takes more tax and declared india vishwaguru is what god knows"
        },
        {
            "author": "@akshaykumarak8735",
            "text": "He is acknowledging and still doing nothing to change that, congress was shameless"
        },
        {
            "author": "@jitesh86u",
            "text": "Wah . Now to country has to evolve to be at level of PM 😂😂😂😂. What a thought change the team not the leader."
        },
        {
            "author": "@RonBhattacharya",
            "text": "This guy is a PhD in BS!!!"
        },
        {
            "author": "@vivek5881",
            "text": "If a person as a state head selects the policy that doesn’t suit the people of the state it’s his failure and not the state’s failure <br>For years they just copied from constitution to policy’s to defence everything was copied <br>The then leaders were incapable as they did not develop anything indigenously for the indigenous population of India <br>And just translating the existing constitution written by the British raj to the native Indian language was the worst mistake coz the British wrote the constitution to benefit them and not the native people"
        },
        {
            "author": "@ashwinisankpal6965",
            "text": "Why don&#39;t they focus currently on economic growth.... Blames won&#39;t fix..Yes .Mistakes can&#39;t be corrected..But it&#39;s just used to spread hatred."
        },
        {
            "author": "@Kumar.saravana09",
            "text": "What is north india rate of growth vs south india rate of growth"
        },
        {
            "author": "@tsParamesh",
            "text": "Sir,yes,he failed bharat,and it&#39;s people always!😮"
        },
        {
            "author": "@yashwanthreddy9676",
            "text": "Congress takes Credit for Independence but here blames People of this Nation for The party’s &amp; their policy failures...Wow <br><br>This Guy is nothing but a Congress Chamcha simple 👍🏼"
        },
        {
            "author": "@debasishraychawdhuri",
            "text": "The real &#39;Hindu rate of growth&#39; should be used for the growth rate when a Hindu party is in power, like now."
        },
        {
            "author": "@sandeepmukherjee990",
            "text": "So are you saying Modi not doing socialist policies in fact it is doing more freebies then previous government"
        },
        {
            "author": "@rameshbrahmadathan2792",
            "text": "The Hindu rate of growth is to not remain fixated on money and wealth. Human life is above all that."
        },
        {
            "author": "@Sheril-cx8ip",
            "text": "These 😂 people don&#39;t even understand the contributions done to india after independence by congress. Every policy in india is introduced by congress. <br>Now they just change the name and repost it with come colorful Ads."
        },
        {
            "author": "@aviralog09",
            "text": "Did he answered the question?"
        },
        {
            "author": "@playerraja2483",
            "text": "Useless Fellows Congress party and Gandhi Family"
        },
        {
            "author": "@ps-gh3hu",
            "text": "one thing that shook me was gold in the USA grew by 5 times, in the last 35-40 years, whereas in India it multiplied at 25 times. everyone has turned a blind eye. but we are *ucking up the Indian economy so bad. In the future, even millionaires won&#39;t be able to afford decent homes and living in India. no actual goods or services are being produced here, people and govt just selling bull sh*t here."
        },
        {
            "author": "@gangadhernarakatla6901",
            "text": "Do not call this kind stupid people fot padcast"
        },
        {
            "author": "@gaurav21885",
            "text": "I just wish we had a better alternative of BJP. In my life time, I&#39;m never going to vote for congress for what they have done and for how they have treated hindus."
        },
        {
            "author": "@Aiveingyaan",
            "text": "Guys I used to respect you, but again you’re also doing Chaatukarita"
        },
        {
            "author": "@shashankmisra1433",
            "text": "That&#39;s time building things was necessary. Today&#39;s all the growth came from selling the property made by Nehru.  All the money is in market and massive loan and not  even 8% growth"
        },
        {
            "author": "@musicandmartialarts9930",
            "text": "This term was given by Delhi University economist professor Raj Krishna,, who was a Moist in ideology, he believed that religions are cause of all inequalities but he himself supported Jihadi radicals and Catholic missionaries..."
        },
        {
            "author": "@deveshkumar-vm7bb",
            "text": "Also Raghu failed even at predicting simple GDP nos. We r growing 8.2%NSO FY24 7.0% EXPECTED minimum IMF FY 24.<br><br>So yeah Raghu ko bolo bharat ghumo."
        },
        {
            "author": "@whatsuptrends2936",
            "text": "It simply because we have a cast system in India which religiously think it&#39;s there right to cheet Indians 😂😂."
        },
        {
            "author": "@visheshupadhyay7775",
            "text": "Why make a policy that&#39;s not for Indian people?"
        },
        {
            "author": "@kiripkalita3812",
            "text": "It was coined by Raj Krishna or someone I don&#39;t know"
        },
        {
            "author": "@nitishcarlin1926",
            "text": "The 2nd &amp; 3rd Abrahamic faiths aren&#39;t the minorities they claim to be... Their population is huge..."
        },
        {
            "author": "@SudhirSingh-rk1jk",
            "text": "I used to watch you regularly as a learned &amp; intelligent orator, but lately your shows have titled towards the current dispensation and you are loosing your objectivity!"
        },
        {
            "author": "@abd.x8156",
            "text": "Nehru ji was a suberb visionary leader."
        },
        {
            "author": "@peterghai2466",
            "text": "What is rate of growth for politican looting"
        },
        {
            "author": "@peterghai2466",
            "text": "Where is the rate of  politicians looting"
        },
        {
            "author": "@Indianlogic",
            "text": "Rajiv Gandhi was too honest to openly call out corruption today they will never admit wrong even when their party president was caught taking cash bribe on camera on national TV. They managed to make people forget their biggest shame incident."
        },
        {
            "author": "@ZLQ90",
            "text": "I&#39;ll give an advice...Start worrying about yourselves instead of looking at muslims ."
        },
        {
            "author": "@AA-ug6bp",
            "text": "From past 10🤣🤣 years in amrit kaaal.. hindu/sanatani growth rate reached heights.. many hindus left India after looting wealth from India sorry Bharat"
        },
        {
            "author": "@remo1985ify",
            "text": "Isn&#39;t it a truth in that case that has been acknowledged and not a narrative . How would you think a country&#39;s roots or culture failed his appointed representative.  It&#39;s a clear case of nehru literally not knowing what the ground reality was , absolute oversight, and lack of skills"
        },
        {
            "author": "@user-pz5xm4hn1j",
            "text": "who is he?"
        },
        {
            "author": "@personal1229",
            "text": "I don&#39;t know how you are speculating the data over related population since there is no census from last 10 years"
        },
        {
            "author": "@arifbaigmohd",
            "text": "Stop being chamcha of Government <br>Stop taking money from govt to market them.<br><br>U never questioned any government policy"
        },
        {
            "author": "@vinay82kaul",
            "text": "One day BJP government will also acknowledge the blunder did in Vajpayee government to end pension of government employees."
        },
        {
            "author": "@flashbotai262",
            "text": "Really guys...this is what u guys have"
        },
        {
            "author": "@saq3329",
            "text": "I think more we can call it a hindutva rate of growth with a supremacist govt in seat"
        },
        {
            "author": "@TFL19823",
            "text": "Rahulji’s wants to bring back Hindu rate of growth with his Taka Tak scheme which he wants to take it to US and Europe"
        },
        {
            "author": "@syedatif8806",
            "text": "Yes narratives created by Modi."
        },
        {
            "author": "@rosewater6778",
            "text": "It&#39;s not Hindu rate of growth. It&#39;s Congress rate of failure."
        },
        {
            "author": "@sre-gp4vj",
            "text": "Calling names on our own is shameful."
        },
        {
            "author": "@SpringMusic",
            "text": "You change u r channel name as BJPschool😂😂😂😂"
        },
        {
            "author": "@cyril4n",
            "text": "It&#39;s bcoz govt appointment wrong 😂"
        },
        {
            "author": "@maheshg6594",
            "text": "Senior Dhruv Rathee"
        },
        {
            "author": "@sudhakashyap9697",
            "text": "That cursed family will ruin the nation must never allow them to come to power especially Rahul with his diabolical agenda to destroy and divide the nation"
        },
        {
            "author": "@Shockwave99-c2r",
            "text": "The saddest thing is that the bhakts will never realize the truth and they will silence the one who speaks the truth. Its a political loop which will never let the country grow"
        },
        {
            "author": "@prashantshah1396",
            "text": "Exactly what is happening now. Modi has failed us but we are blamed as Jai chands and we failed modi."
        },
        {
            "author": "@prabasgoudhakatla9658",
            "text": "Ok where is the growth now if the stock market increases (god now&#39; s how) means the Indian economy increases, where the increased cost of living and there is no scope for income growth for 95% of the population."
        },
        {
            "author": "@sirchakoo6172",
            "text": "I think it was Manmohan Singh who fixed the Hindu Rate of growth"
        },
        {
            "author": "@classyproducts4335",
            "text": "Nehru was not a good leader 😂"
        },
        {
            "author": "@ashash7223",
            "text": "Congress , nehru and gandhi were curse on bharat"
        },
        {
            "author": "@harish966",
            "text": "Typical"
        },
        {
            "author": "@Samcarter_Boss",
            "text": "Policies designed to support the culture. Culture don’t change for policy"
        },
        {
            "author": "@Ras-al-ghul250",
            "text": "I heard this term from my Prof during MBA first session.. I was shocked and  in muffled voice said this is very derogatory and asked are there similar term for other religion.. Academia is full of such baises."
        },
        {
            "author": "@Sensible_human123",
            "text": "The hate congress have for Hindus is so heart breaking. It’s their land. They have preserved it for thousands of years. Let them stay safe and healthy. Lots of love to all the Hindus in India from Australia. We love you guys Australia 🇦🇺 loves India ❤"
        },
        {
            "author": "@ck3289",
            "text": "Tamilnadu and Punjab hate bjp and love congress even after the history of both the states suffering at the hands of congress! This is how easy it is to fool Indians!"
        },
        {
            "author": "@bharaninathkomandur6330",
            "text": "It is funny, they did not say &quot;Muslim rate of growth&quot; or &quot;Christian rate of growth&quot;.  The KhanGress&#39; anti-Hindu propaganda in full swing."
        },
        {
            "author": "@ltkhongsai5827",
            "text": "Even the interviewee is missing the point"
        },
        {
            "author": "@vikranth1270",
            "text": "It would have been named as muslim growth of rate , because during that time muslim population increased rapidly ane govt spent lot of money on second majority......"
        },
        {
            "author": "@thenishantsaxena",
            "text": "Lets talk about muslims growth rate"
        },
        {
            "author": "@ShyamKumar-hq5bq",
            "text": "Han so his narrative is what we should belive eh"
        },
        {
            "author": "@chandrasenanbr9681",
            "text": "Ohhhh, so that is Hindu rate of growth...."
        },
        {
            "author": "@Tradinggrow-d",
            "text": "<a href=\"http://www.youtube.com/results?search_query=%23khangress\">#KHANGRESS</a> HATAO aur UCC NRC lao"
        },
        {
            "author": "@tylert9875",
            "text": "After 400 years of slavery (that is what ritualised casteism is), attacks, plunder, Mohammedan rule, British rule, for a self ruled independent India, learning to walk on its own, and grow without being colonised again bu outsiders, 2-4 percent growth is still impressive. It was higher than most countries in the world at that time in Asia, Africa and South America."
        },
        {
            "author": "@drrahul_1986",
            "text": "Imagine the outrage if someone used Muslim rate of growth?"
        },
        {
            "author": "@allangracias1",
            "text": "Socialism does not help the people. It is meant to help the elite and controls the masses. We mist get out of this mindset and go towards Free market capitalism and unlock the creativity of our Indian people"
        },
        {
            "author": "@MINTRADEINVEST",
            "text": "great visionary nehru failed india , give land to china ❤"
        },
        {
            "author": "@HLHVH",
            "text": "Congress has humiliated us so many times. We have such short term memory. Such parties should never come into power."
        },
        {
            "author": "@SatyaGhatnaKahaniDarrKi",
            "text": "So basically brotherhood and harmony (Nehruvian Policy) was  all bad, and hate, anger superstition (RSS Policy) was the underdog that was always misunderstood and wasn&#39;t given the chance. Interesting that the channel name is Think School."
        },
        {
            "author": "@harshalmirge3485",
            "text": "He is slowly shifting from being centred to right. You can&#39;t unsee it now. The way he is narrating the thing. I used to admire him for his content but now.....nope🙂"
        },
        {
            "author": "@gauthamp4050",
            "text": "Muslims pop will outnumber Hindus by 2050 easily"
        },
        {
            "author": "@MsRakesh49",
            "text": "policy should be accordingly to the culture not the culture according the policies"
        },
        {
            "author": "@meenuvirmani5599",
            "text": "Hindu only busy in earning money"
        },
        {
            "author": "@madhusudanbhardwaj4729",
            "text": "India was as corrupt it is today maybe more corrupt"
        },
        {
            "author": "@diadon5674",
            "text": "So they created narrative that india&#39;s failure is coz of hindus. Congress hates hindus to its core .raul vinci trying to destroy hindus is continuity of congress policy"
        },
        {
            "author": "@tejassuresh8221",
            "text": "What are we supposed to call the jobless growth now and the vast majority having jobs not commensurate to their qualifications"
        },
        {
            "author": "@veenjharmemon8097",
            "text": "GDP per capita abhi bhi only $2,000 hai. Modi hasn&#39;t improved anything."
        },
        {
            "author": "@christyjosecherian",
            "text": "Same happening nobody blaming modi on demonetisation or GST or higher tax rate"
        },
        {
            "author": "@namishabothra6683",
            "text": "I think it&#39;s not about who&#39;s or what failures led to the delay in growth of Indian Economy.. every economy would have its fair share of trial and error but when it comes to nomenclature.. terming it as &quot;Hindu Rate of Growth&quot; particularly to tag it in a negative way by design is really not a &quot;secular&quot; move."
        },
        {
            "author": "@biasedboy8829",
            "text": "Arvind kejriwal has successfully revived suicidal socialism in india."
        },
        {
            "author": "@Abhishek-gr7rp",
            "text": "That&#39;s the key.. Never admit your mistakes.. Be like Modiji"
        },
        {
            "author": "@lakshrampal2970",
            "text": "Haven&#39;t heard a single sentence from the Vedas, in my 29 years of existence. The birth of the best inventions on Earth, the whole world acknowledges. What Hindu rate of growth?"
        },
        {
            "author": "@dbkooper",
            "text": "Still there is so much corruption and nepotism everyhwere.. reservations is also a kind of nepotism"
        },
        {
            "author": "@aakashchauhan109",
            "text": "Like abhijit chavda sir says “ it’s nehruvian rate of growth not hindu rate of growth “"
        },
        {
            "author": "@ravijha5355",
            "text": "The Hindu rate of growth has nothing to do with religion Hindu . Learn some economics and then talk"
        },
        {
            "author": "@srinivashram110",
            "text": "I really miss the old, &quot;informative and educational think school channel&quot;.. nowadays it&#39;s deviated totally.. disappointed from tamilnadu"
        },
        {
            "author": "@girish5856",
            "text": "That&#39;s Nehru or Congress rate of growth."
        },
        {
            "author": "@user_nxc7a-9900",
            "text": "❌❌❌❌❌❌❌❌❌❌❌❌<br>This is purely biased and misinformed statement. Hindu rate of growth was coined by Raj Krishna for the growth rate of whole India generally. It was not meant as it was the problem of Hindus. Historically India was called different names such as Sindhu civilisation, Sindhi etc. Even today in Arab countries, they call every Indians hindi, hindi. They say he is a Hindi. People were not that hatred minded in the the 70s. This is pure hate propaganda spread by a group of right wing groups. Think school is giving them a platform is such a shame!!!"
        },
        {
            "author": "@reggi4206",
            "text": "What narrative are u trying to project?? Same shit different pkge"
        },
        {
            "author": "@asn3348",
            "text": "Put something we can understand please"
        },
        {
            "author": "@WarriorOG-ql7gv",
            "text": "It was Nehru rate of growth.<br>Always Congress was anti Hindu.<br>But before attacking congress, we need to get rid of their woke voters.<br>Woke aka naxals are the real enemies"
        },
        {
            "author": "@SHIVAMUDDINCHISTI",
            "text": "The dumbness in the comment section omg even how the godi podcaster tried to act smart lol😂"
        },
        {
            "author": "@Lezilanto",
            "text": "The biggest disaster has happened in last 10 Ys by Nehru? Shame on these idiots who don&#39;t even understand what they do ..they live in ignorance.."
        },
        {
            "author": "@xxxx4xyx",
            "text": "Congrees  socialist policy bring india to its knees"
        },
        {
            "author": "@mallikarjunahiremath8649",
            "text": "Blaming Nehru for every Problem in India ???   As if India was heaven before Independence?"
        },
        {
            "author": "@SnehaSingh-qw2id",
            "text": "Post election this channel is going ultra left and tilting towards woke."
        },
        {
            "author": "@nipunkothare",
            "text": "Hindu rate of growth is what we are seeing since 2014"
        },
        {
            "author": "@aryavijay410",
            "text": "So for Modi the equation works opposite ?"
        },
        {
            "author": "@rah651",
            "text": "2Rs credited from bjp"
        },
        {
            "author": "@MR-le5fc",
            "text": "Try islamic rate of growth that we are seeing in pakistan and Afghanistan"
        },
        {
            "author": "@truth7653",
            "text": "Nehru’s time of indigenous growth of country with five year plans, self dependence, educational institutions created."
        },
        {
            "author": "@alimehdi7000",
            "text": "Yes blame everything on nehru.. when now modi is being incapable of doing anything 😂"
        },
        {
            "author": "@rocky49able",
            "text": "Whatever Nehru&#39;s faults, he wasn&#39;t a third rate scoundrel like Modi"
        },
        {
            "author": "@Entertainment-sq6wx",
            "text": "What is muslim growth rate? Since you brought up Hindu rate of growth. In Bangladesh and Pakistan, Hindu&#39;s are persecuted just because majority Muslim. Laws would be more favourable towards one religion when majority is there. Past and Present points Pakistan, Bangladesh, Iran, Iraq, Taliban, Afganistan, etc more conflicts are there."
        },
        {
            "author": "@srisadananda",
            "text": "What rubbish is he talking about? Nehru is considered to be the architect of modern India."
        },
        {
            "author": "@SyedAli-cj2js",
            "text": "I feel the leaders of that time at least has the courage to acknowledge their mistakes. <br>Now every political party is running behind faming themselves and least bothered about Citizens"
        },
        {
            "author": "@suhail_69",
            "text": "Lol people are made fools in the name of religion 😅"
        },
        {
            "author": "@prasannadubey9516",
            "text": "Hindu by nature want to live in austerity and simplicity hence despite money no expenditure use to happen then west term this as Hindu rate gtowth"
        },
        {
            "author": "@neetha1153",
            "text": "Yes we all should blame  ourselves for &quot;caste system&quot;"
        },
        {
            "author": "@rhutvikpatel8135",
            "text": "They just anti hindu"
        },
        {
            "author": "@cheersonsamuel2446",
            "text": "Why poor India&#39;s dept 3 triple in last 10 years"
        },
        {
            "author": "@roshan7041",
            "text": "Developing India from zero infrastructure &amp; broken economy. And developing India from improved  economy &amp; reasonable infrastructure makes lots of difference. Its like taking credit for the fruits without planting the seeds."
        },
        {
            "author": "@roshan7041",
            "text": "Now the scenario has changed. For every 1 rupee of development shown to people, 3 Rupee is already pocketed before arriving at 1 Rupee."
        },
        {
            "author": "@VishnuM793",
            "text": "No buddy, bush policies failed India."
        },
        {
            "author": "@bharathkashyap4435",
            "text": "Nehru gave false information to people that Hindus make 10-12 children per house. Moving forward, indian population will burst. But the Hindu population was having only 3% since then. Now, hindu population came down to 1.5"
        },
        {
            "author": "@Winnerhunk-b3s",
            "text": "Nehru did blunders that India is suffering even today... Basically he don&#39;t know how to deal with foreign affairs...He just stuck up with his ciggerate, women and many such things..our country is ruined as a result!"
        },
        {
            "author": "@मृदुलशर्मा",
            "text": "it should be called Congress&#39; Rate of Growth"
        },
        {
            "author": "@ayushverma4094",
            "text": "The same way modi govt is failing and blaming congress for it."
        },
        {
            "author": "@iamIndigenous",
            "text": "Its the bastards congress rate of growth"
        },
        {
            "author": "@kumarsharma9920",
            "text": "Somehwere among the religions, humans have failed."
        },
        {
            "author": "@wramper",
            "text": "It is NOT THE HINDU RATE OF GROWTH!!! <br><br>It is the NEHRU OR CONGRESS RATE OF GROWTH!!!"
        },
        {
            "author": "@pam4840",
            "text": "So if a secular project fail name it only hindu..."
        },
        {
            "author": "@ayanmishra2186",
            "text": "&quot;India is a secular country we will fight to protect it.&quot;<br>India sees 0% real growth for years<br>&quot;See we told you India has always been Hindu Rashtra.&quot; <br>Nehurism is institutional racism."
        },
        {
            "author": "@dxk2466",
            "text": "85% leakage in sending money top to bottom...I am wondering how much leakage money going from bottom to top"
        },
        {
            "author": "@rajivdhulipala6966",
            "text": "India would have been in a far better position if bose was alive during independence and patel lived for another 10 yrs ."
        },
        {
            "author": "@abcd51849",
            "text": "Actually Nehru policy helped India all across many fronts be it science, education etc...IITs, IIMs and AIIMS, AFMC, ISRO, DRDO"
        },
        {
            "author": "@LhnAran",
            "text": "Its not politics, it is bigotry against Hindus"
        },
        {
            "author": "@videomagazine3718",
            "text": "Former Prime Minister Nehru Ayya founded IIT ( Indian institute of Technology) and IIM ( Indian Institute of Management) to save India from poverty and unemployment but now many think it as a route to get citizenship in rich countries."
        },
        {
            "author": "@anubhavbhrigu",
            "text": "Out of that 85p most of it comes back to congress....."
        },
        {
            "author": "@strangerop8318",
            "text": "Is desh mein utne gadhe hain jo kabhi history khol ke dekhte nhi phir koi gyan deta hai to chomuho ko mirchi lagti ki haaye please ,ove on from nehru. It has cost a lotttt because of congress party mentality. Reading jistory can really help to understand what there brilliant leadwr did in past"
        },
        {
            "author": "@PVAR1983",
            "text": "Could you please explain what moodi government achieved??Nothing..<br><br>Only Adani and ambani grow 😊😊😊"
        },
        {
            "author": "@pawanhirani512",
            "text": "There is never a bad Soldier only a bad general."
        },
        {
            "author": "@suji1103",
            "text": "No matter whichever govt comes to power India will never have good infrastructure like china or the west. <br><br>Till this date municipal/city/village roads are put in such an away that they get washed during monsoon and the state keep on overlying roads again and again. <br><br>In India roads are being laid for the benefit of local MLA&#39;s, contractor&#39;s and govt administration&#39;s not for the benefical of people"
        },
        {
            "author": "@raun881",
            "text": "Muslim rate of growth is negative growth, so Hindu rate of growth is much better, atleast we were not going backwards."
        },
        {
            "author": "@RahilKhan-t1o",
            "text": "Nehru and Gandhi’s have made India the beautiful progressive and democratic country that it is.   Watch out for Rahul Gandhi now. He will be the BEST PRIME MINISTER INDIA had ever had ❤. Mark my words"
        },
        {
            "author": "@Mukesh-oq8dx",
            "text": "dude, move on from Nehru"
        },
        {
            "author": "@nabarkachoudhury4005",
            "text": "Maybe Nehru&#39;s intentions were good but with horrible executions.<br> Be it<br>1. Indus valley treaty with Pakistan, <br>2. Giving UNSC Permanent seat to China, <br>3. Declining the US Nukes during 1962 which would have completely change the war results with China and maybe Pakistan wouldn&#39;t have dared to go to war with India in 1965. <br>4. Creating POK by including the UN during 1947-48 war with Pakistan, as Indian forces would have easily captured POK, but due to Nehru&#39;s ceasefire agreement, we have don&#39;t have POK 😊.<br>5. His Socialist approach which rejected the Private Companies and destroying the already destroyed Indian economy. <br>6. Gifting Coco Island to Burma without the permission of Parliament <br>7. Rejecting Gwadar Port from Sultanate of Oman<br>8. Denying merger of Nepal with India. <br>9. No Uniform Civil Code <br><br>Still he is our Chacha Nehru 😂😂😂"
        },
        {
            "author": "@mowiththeflow4446",
            "text": "It should be called the Nehru rate of growth"
        },
        {
            "author": "@RajTilak-oh7vf",
            "text": "We better of nehurian social reforms in current date than this communal corruption now"
        },
        {
            "author": "@ECENithyarajGP",
            "text": "If Sardar Vallabhbhai Patel was our 1st PM <br>Bharat will be a way better than now<br>He didn&#39;t hesitate to take hard decision for the sake of Country unlike Nehru<br>For me Nehru is the failure now Bharat has to face<br>POK, Aksai chin, Reservations etc"
        },
        {
            "author": "@shubhamgeography530",
            "text": "It&#39;s constitution problem that&#39;s failed us from our cultural roots."
        },
        {
            "author": "@madhavrekwar3552",
            "text": "Hindu rate of growth 32% of world gdp...its a proven fact..we are not near hindu rate."
        },
        {
            "author": "@adityachaturvedi3978",
            "text": "Losing Indian territory, failing Indian army, failing economy, growth of citizens and whatnot; then some call him the best leader."
        },
        {
            "author": "@navinraut5920",
            "text": "&quot;When you fail, you blame the victim&quot;. This is exactly what is happening in India"
        },
        {
            "author": "@vivekanandapanda9166",
            "text": "everyone now a days are giving lecture , which is not happened , i am surprised with out any solid proof they gibing their shit through your audience, which is crazzy"
        },
        {
            "author": "@rahulmig35",
            "text": "Yet, India remained at par with China till 1990...despite china liberalising in 1978...the points these guys raise ignore this comparitive fact"
        },
        {
            "author": "@fasihuddin6309",
            "text": "What a bhakt page this is turning to be man."
        },
        {
            "author": "@InfoPanel7902",
            "text": "Finally someone mentioned this in mainstream. A channel who can&#39;t be said baised by any leftist"
        },
        {
            "author": "@raghunandanraghavachari3188",
            "text": "The Hindu rate of growth is still valid now, as you see the enormous amount of inequality that is there today, as usual, the top 10 percent of popuation being super rich, and today leaving the country after making enough dough, and the low percapita income of the remaining 90 percent which is less than average percapita,perhaps of the Hindu Raj today , and the richie rich is always dear to Modi, consider the invitee to Ram Mandir Pratisthan, and Swearing In Ceremony of the MPs in the New Lok Sabha. And this is the result of Capitalist policies of the present government. The govt does not even pretend to be socialist, but is blatantly capitalistic, unlike the socialistic policies of Nehru and the Cong."
        },
        {
            "author": "@FoxtrotIndia",
            "text": "So how does it become &quot; Hindu&quot; It is consecutive Congress govt. Failures."
        },
        {
            "author": "@munishmahajan002",
            "text": "It&#39;s correct. If one see analyse states where socialism is comparatively stronger and people have socialism in the back of their mind. There are more freebies available. People don&#39;t want to work at all. Because they think it&#39;s the responsibility of state to sustain people. And sustenance is not responsibility of an individual even to the mildest extent."
        },
        {
            "author": "@ChristieDsouza",
            "text": "Bhai roj ka khana parivaar ke liye bohut mehnga ho gaya hai, our public infrastructure is crashing, women safety hai nahi, aur bohut sare issues hai country me, ye kya discuss kar rahe hai. 😢"
        },
        {
            "author": "@shylajanaidu9858",
            "text": "Did he really answer the question"
        },
        {
            "author": "@SathyaswamyS",
            "text": "Yes. If Modi was pm in 1947, India would have been a superpower now."
        },
        {
            "author": "@Manoj_Kumar_Singh",
            "text": "The comment section is full of hindsight bias like this podcast."
        },
        {
            "author": "@shanblues7257",
            "text": "Enough of this Nehru thing already. He did a number of good things. He did a few mistakes. But this hindsight bias needs to stop. Everything could have been done better. Take any country, any leader and analyse the outcome of their work today, you&#39;d see how they could have still done better. We simply credit other forces for the good that came out in this country and blame Nehru for all that is wrong with it."
        },
        {
            "author": "@tejasjoshi8840",
            "text": "Khangress has always been good at narrative creation... Right from the time of  Mohandas"
        },
        {
            "author": "@007_Sun_Tzu",
            "text": "How dare Ra&#39;goo&#39; Rajan the lapdog of Congress mention Hindu word before his pathetic theory of Indian economy losing steam.?"
        },
        {
            "author": "@unfortunatewitnessX",
            "text": "This is crazy! I honestly didn&#39;t even know that this is a real, terrible thing! 😢"
        },
        {
            "author": "@ylio60",
            "text": "When you fail u blame so what that is bjp is doing"
        },
        {
            "author": "@ylio60",
            "text": "Hmm 😂 per capita growth is now happening"
        },
        {
            "author": "@as9499",
            "text": "And I still didn&#39;t hear any proper explanation citing &#39;Hindu Rate of Growth&#39;"
        },
        {
            "author": "@sajalpratapsingh2057",
            "text": "India would have been much better than current time if we more free market economy than Nehruvian socialism."
        },
        {
            "author": "@Saint_Crocodile",
            "text": "It&#39;s not even a question to ask now it&#39;s a fact that because of that chacha we let go of many important opportunities which would have made India a global powerhouse till now really sad for this nation that he existed and was made pm ..."
        },
        {
            "author": "@mohankrishna3597",
            "text": "For a moment I thought Ganesh as Dr Pal"
        },
        {
            "author": "@sureshrao2695",
            "text": "This is term invented in 1978 by red economist Prof Raj Treacherous Krishna. Actually it was the Nehruvian rate of growth ( rog) or Indira rog or Socialist rog or secular rog"
        }
    ]
}