{
    "videoId": "LiFA4CBDYDs",
    "totalComments": 231,
    "comments": [
        {
            "author": "@dr.ravishankarpolisetty2820",
            "text": "Extremely bad idea!<br><br>The idea of using YouTube videos and AI tools like ChatGPT to replace traditional lectures in tertiary education may seem convenient and cost-effective, but it misses a crucial aspect of learning—the <b>*human connection*</b> between teacher and student. Education is not merely about delivering information; it is about the <b>*exchange of energy**, **passion**, and **intent*</b> that happens in real-time during a lecture. A recorded video may convey facts, but it cannot replicate the spontaneity, emotion, and personalized guidance that a teacher offers in the moment. The <b>*aura*</b> of the teacher—their tone, body language, and enthusiasm for the subject—plays a significant role in making complex ideas more understandable and memorable. The way in which a teacher adjusts their explanation based on the immediate feedback from students or engages them through lively discussions creates a dynamic learning environment that goes far beyond passive consumption of content.<br><br>Furthermore, while AI tools like ChatGPT can be incredibly helpful for answering questions or providing supplemental information, they cannot replace the <b>*mentorship*</b> and <b>*personal touch*</b> a teacher brings to the classroom. Teachers inspire, motivate, and challenge students to think critically, question assumptions, and explore new perspectives. These human interactions foster intellectual growth and emotional resilience in students—skills that are essential in life, not just in academics. The role of a teacher is not only to impart knowledge but also to **shape character**, nurture curiosity, and instill confidence in students. Thus, reducing education to recorded videos and automated responses undermines the rich, transformative experience that a true teacher-student relationship offers."
        },
        {
            "author": "@SujithS-i6e",
            "text": "If we are stop learning.teacher were become unemployed"
        },
        {
            "author": "@saimatahsin2233",
            "text": "No sir AI education is not very interactive. Engaging and thought provoking. Yes its accesible for people without access but i Dont think my money is wasted in a university.  Also jobs of teachers, reaserchers, thinkers is important.  Yes it can unload a lot of burden on tewchers. They can focus more on application works than classroom works."
        },
        {
            "author": "@modellocomotiveworks2215",
            "text": "In India we are hungry for money only.<br>So everything is profit and loss statement for us<br><br>That&#39;s why everybody lives for these 4 dreams - <br>MBA from IIM a<br>Medical<br>Btech from top iits that too in IT ( because IT OFFERS FAT PAY CHECKS)<br>And upsc civil services <br><br>Our main focus is on money without work . We don&#39;t care about innovation and research,  we want more return on lesser investment.<br><br>That&#39;s why our startups are mostly service oriented or copy pasted.<br>Like food delivery, grocery delivery etc.😂<br><br>We call the west materialist, but we don&#39;t ask ourselves"
        },
        {
            "author": "@poornimar3552",
            "text": "Now education is business"
        },
        {
            "author": "@hyu3407",
            "text": "I don&#39;t agree. Most of the holistic learning a person has after coming out of high school at the age of 18-19 is in college directly or indirectly like working in labs, interacting with prof, playing sports for college team, hanging out with friends and many other things. Study is not just the only metric. In India it is especially not suitable because it is easy to fool parents who are having expectations from you and are not from the same background of studies. What if you are watching some random YT video but you pretend in front of them, which affects a person&#39;s personality in the long term  when it comes to commitment and responsibility. In college,the hectic classes, regular exams at least give you no choice of skipping it otherwise you will fail. Harvard, Stanford lectures are still freely available for those who have a clear goal but not the majority of students have it. Also the most important thing as a fresher in a company after undergrad is to communicate, if you are only studying from YouTube in a room for 3-4 years of bachelor and have no human to human interaction on innovations, research etc. definitely you will have panic disorders and social anxiety in a corporate world where there is daily standup meeting, knowledge sharing sessions and a hell of other things. So young people should not be MISGUIDED. Classroom study definitely needs improvement but shouldn&#39;t be completely cancelled."
        },
        {
            "author": "@Raghu-b8w",
            "text": "Why indian diplomat and above chief secretary not working properly only talking <br>India different __ artificial intelligence ministry and education"
        },
        {
            "author": "@PranavTambat0",
            "text": "This person say my heart words."
        },
        {
            "author": "@kumarasrr3379",
            "text": "Does he mean all the engineer&#39;s should be learning through youtube no need of labs and practical knowledge <br>I think he is from modi WhatsApp university"
        },
        {
            "author": "@shristisomaya3927",
            "text": "Here those people who are saying that college is for exposure, interacting people one thing you should listen carefully that he is saying college should be for research so when Students will go for research they can do all of these things"
        },
        {
            "author": "@user-lt9my8ue6p",
            "text": "I totally agree I have cleared my college from India&#39;s top university  exam via studying through online and using ai."
        },
        {
            "author": "@s-qc9ns",
            "text": "yes we can improve currently present swayam platform."
        },
        {
            "author": "@saraladhikari",
            "text": "I am studying bachelors in civil engineering. Our teacher while still try to give ample knowledge in class. I can&#39;t pass my final exam without small explainers and numerical solver videos on You tube"
        },
        {
            "author": "@sscian_priyo",
            "text": "I am a working professional and along with that I am doing my graduation from IGNOU. Absolutely no regret about college life specially when the learning experience is considered. It not only enables me to prepare the subjects all by myself at my own pace but also saves my precious time. This makes me a firm believer of the distance learning concept. One can really utilise his or her potential very efficiently and productively if he or she is enrolled into something like this."
        },
        {
            "author": "@melroydsouza5148",
            "text": "I absolutely agree with that"
        },
        {
            "author": "@jatingupta7154",
            "text": "Ai will f up education more it is still biased. And unstable &amp; how to resolve doubt, but i agree about Using YT Because college done update their curriculum"
        },
        {
            "author": "@LivesOnEarth09",
            "text": "Abe phele taxation to sahi karlo"
        },
        {
            "author": "@Genie890",
            "text": "This is the problem with policy makers …. They will try to draw a picture with a wide paint brush. That way one can only achieve a simplistic cartoon version.<br><br>Classroom teaching and one to one interaction will always be necessary at all levels because different students have different levels of intelligence and YouTube lectures can be made keeping only a particular level of intelligence in mind. Especially in Science and technology fields"
        },
        {
            "author": "@sushmarathi8819",
            "text": "Thw worst thing ever introduced to indian education system is Raatna<br>Making useless practical files which we dont even have to remember and juat write and submit and to write save trees like slogans on paper"
        },
        {
            "author": "@debranjanibasu9544",
            "text": "Absolutely agree"
        },
        {
            "author": "@lavin7513",
            "text": "Par yeh education minister nahi hain"
        },
        {
            "author": "@Ankita0202",
            "text": "No value for college days nostalgia, no place for the emotion of going colleges without uniform for the 1st time in our lives, no class bunk, no falling in love for the 1st time especially if one is from girls/boys school in particular, no fest, no canteen, sharing notes, no place for emotion! Is this what India is going to be?? We are one of the developing countries, but culturally the richest one. We are not just to born and earn. India is not Japan. <br>I&#39;m proud of my college days and my Bharat. ❤ Jai Hind. 🇮🇳"
        },
        {
            "author": "@mutum25k",
            "text": "Education is so little about lectures. It’s about interactions with peers, teachers and the overall environment. It’s also about practice. What this guy is saying is already there in higher education in India through the platform like SWAYAM."
        },
        {
            "author": "@swrserwerwr9137",
            "text": "Automation after a certain point just kills economy"
        },
        {
            "author": "@best_from_bottom",
            "text": "I absolutely agree with his ideas. Being a medical student, I find it&#39;s unnecessary to stay in the class room for 5 to 6 hours for theory classes. Because all the students have already attended these classes online. Rather our applied aspect classes and practical classes should be 5 to 6 hours instead 3 hr."
        },
        {
            "author": "@user-ob7ti7us2v",
            "text": "Tertiary education is complete bullshitting in India at least. No practical, vocational, real life, experimental knowledge just cram this that books. This can be done through YouTube 100%. Why to waste this much land, building, money, jobs. We should be more focused on real engineering or basically advance knowledge, application as a population."
        },
        {
            "author": "@quiet-watcher_",
            "text": "Not sure if the host has done some research before making such statements..! Don’t you think government has given a thought about this earlier? Why do we have NPTEL?"
        },
        {
            "author": "@tejaspatil6421",
            "text": "My College still teaching C in Turbo C 😢"
        },
        {
            "author": "@WebDevSid",
            "text": "The computer world moves so fast the books are 15-20 years old. Most people that pass out have difficulty finding jobs and have to struggle during internships/ first job. If you are in college try to build projects during your college years so when you pass out you will have some practical knowledge."
        },
        {
            "author": "@chwinner5535",
            "text": "I don&#39;t know the context, so his comment may not be complete but if AI can clarify any doubts, it can also do any job. Then what is the point of learning this stuff after all?"
        },
        {
            "author": "@RCTIZ",
            "text": "No no.. absolutely no.. we saw what happened during COVID.... Student don&#39;t even know basics"
        },
        {
            "author": "@mixgaming7600",
            "text": "Then can some one tell me how many jee aspirants get into IIT with online classes"
        },
        {
            "author": "@thadagathbollabathini4590",
            "text": "Couldn&#39;t agree more!"
        },
        {
            "author": "@IshanWayne",
            "text": "Exactly 👍🏻😑"
        },
        {
            "author": "@user-nk1nk4gt8s",
            "text": "Sir education is a thing which need interaction what we need to change is good system not changing classrooms"
        },
        {
            "author": "@manjunathdonur4183",
            "text": "Great thought 😊"
        },
        {
            "author": "@manjunathdonur4183",
            "text": "Great though 😊"
        },
        {
            "author": "@rajaramroy4158",
            "text": "Very much Agree 👍💯 Too much needed for such knowledge acquring system for Humankind and Religious Hippocrates world"
        },
        {
            "author": "@sanskartiwari2996",
            "text": "Can’t agree more"
        },
        {
            "author": "@economics.guru1",
            "text": "😂you don&#39;t know rural India... Very sad😢"
        },
        {
            "author": "@kartaaham",
            "text": "Please someone convince him stick to economics and history where he&#39;s good<br><br>This is embarrassingly terrible"
        },
        {
            "author": "@ranaarjun10",
            "text": "WHEN CEO HAS NO KNOWLEDGE OF GROUND WORK...."
        },
        {
            "author": "@dr.kiranchauhannarang9324",
            "text": "May be one perspective but i dont agree n reasons are many. 🙏 first n foremost is that education must be an interactive mode if we want to have produce youth n future generations with creative n scientific minds and temperament. This needs to be inculcated at very young age if we dont want to produce robots."
        },
        {
            "author": "@yatharthvaidya2742",
            "text": "Dr. Sanyal, every class, every individual, every next YouTube lecture is unique with either knowledge, information, style or anything. Even this podcast will be unique next time even with the same person. <a href=\"http://www.youtube.com/results?search_query=%23economics\">#economics</a>"
        },
        {
            "author": "@gowrisankarp3538",
            "text": "Primary school education is mandatory before pupil can watch out internet"
        },
        {
            "author": "@rddinesh4",
            "text": "True<br>We can use NPTEL<br>Students and teachers can discuss problems and focus on research"
        },
        {
            "author": "@0001vipin",
            "text": "Human interaction in its originality and effectiveness will remain more reliable than AI. Only logics, algorithms will make everything ------"
        },
        {
            "author": "@GKS55SKS",
            "text": "In the world of science.. the current system are like zhuggi zhopri of a city.. but remember they r your manual cheap labour resources.. balancing the cost of outcoming products n services"
        },
        {
            "author": "@msan8888",
            "text": "Colleges should focus on Research, robust and innovative testing or grading for it&#39;s students, imparting social and people skills!"
        },
        {
            "author": "@ankursingh1962",
            "text": "Yeah, obviously, automation seems prudent in a country with 1.4 billion people where they are struggling to get a job."
        },
        {
            "author": "@PraveenKumar-xx1vq",
            "text": "Next generation eduction is not just about Information, something more."
        },
        {
            "author": "@dibakardarjee334",
            "text": "I agree on this front..educational institutions like colleges and universities should focus more on research and forwording more recent advanced knowledge..not just old lectures..still I believe, majority of the students of our country (tier 2 &amp; 3 college) can&#39;t be dependent on cloud lectures as it is a self serving process..and in tier 1 colleges, students are forced to attend lectures and classes even when its giving no addional value to some students..like in my college, CA students were forced to come to college even when they already had already learned all the chapters they were being taught in college though CA coaching classes.."
        },
        {
            "author": "@Aerrow62",
            "text": "It&#39;s not the same lecture and not the same class. His his biggest fallacy is that he thinks people actually learn simply by listening. The issue is individual attention. Thats why small classes with low student teacher ratio is needed. AI can&#39;t empathize with you or make that personal touch. We have so much content on the Internet but people choose reeels. YouTube is not a substitute for classroom and classroom lecture is not a substitute for individual readings and comprehension. What about labs? You want everyone to spend millions on personal labs. This is the issue with Indians where they think education is just theory and books and end up unemployed despite top scores and knowing everything about every equation in 5 books of each subject.<br>If lectures don&#39;t happen, who will pay the college for conducting research? He is finance advisor and throws such a lame argument. No wonder there so much unemployment."
        },
        {
            "author": "@ibrahimhanslod",
            "text": "Its nice Idea but networking is biggest positive outcome of college/University. Many business built on network. Many opportunities created on network."
        },
        {
            "author": "@darkwolf2275",
            "text": "This is dam true"
        },
        {
            "author": "@lolhello947",
            "text": "Interesting."
        },
        {
            "author": "@babajoshi",
            "text": "Right close down IIT and IIM immediately"
        },
        {
            "author": "@adarsh7378",
            "text": "Sahi bola h Banda , it is indeed a waste of time and money"
        },
        {
            "author": "@mrmohanram1",
            "text": "Yaar r such people called intelligent??? <br>College is not only a place where we learn academics.. <br>it is much more than that.."
        },
        {
            "author": "@harrisnaren4364",
            "text": "Finally someone has a spine to speak out loud...😂"
        },
        {
            "author": "@dunamis8639",
            "text": "The point of giving education face to face is to interact and develop tolerance to ideas, share and also develop mutual consensus and harmony.. Just not to acquire information. But if this kind of education is not given then better switch to online recorded videos. <br>I agree with Chief Economic Advisor to some level but he missed the part where it&#39;s very important and that is co-development of ideas, tolerance and interactions..and not just information."
        },
        {
            "author": "@grapeshott",
            "text": "Need interaction with teachers and peers"
        },
        {
            "author": "@kaddu2178",
            "text": "Thats what the whole caste system is about Mr Sanyal : &quot;knowledge hoarding&quot; . 😅😅😅😅😅😅😅😅😅😅😅😅😅 ."
        },
        {
            "author": "@subhadiptudu899",
            "text": "I told this to my teacher and to my friends... the laughed so hard., I just felt foolish. <br><br>One my opinion is that,- The lectures of IITs and IIMs should be uploaded on a free online portal open to the public, it will be very useful of anyone who want to get some tertiary level of knowledge in a particular field."
        },
        {
            "author": "@parthibanspace",
            "text": "This is what I&#39;ve always thought."
        },
        {
            "author": "@prasanthreddy0999",
            "text": "Education provides information, not intelligence."
        },
        {
            "author": "@user-pm9yu2kv7t",
            "text": "no. absolutely wrong.. YouTube and AI should be viewed as  assisting tools, we need schools.."
        },
        {
            "author": "@adityaandytiwari",
            "text": "In the past, I also thought the same, but now I understand that Offline Class provides Great exposure, experience, interaction, proper routine, physical activity, meeting new people and the memories u create. Offline and Online both should go hand in hand."
        },
        {
            "author": "@TK-vu8bn",
            "text": "Each individual has unique hearing, listening, learning, mental, and concentration abilities. It’s unrealistic to expect a single lecture or session to address these differences fully. Achieving effective education requires years of practice and adaptation. Institutions should leverage technology to develop hybrid models that enhance both teaching and learning. Education is a process of energy transmission aimed at improving the world, and we must explore multiple approaches to achieve its highest quality."
        },
        {
            "author": "@nishantupadhyay01",
            "text": "The issue is- those lectures don&#39;t exist. I&#39;ve been a Zoology graduate from a 2nd tier college, and i know the pain of not being taught by those dull professors. Had no other option than self study as online lectures weren&#39;t available."
        },
        {
            "author": "@atchutram9894",
            "text": "Colleges can provide laboratories and perform manual evaluation of students."
        },
        {
            "author": "@bharat_vell",
            "text": "The way colleges select students through tougher competitive exams same should be done for lecturers also (especially in private engineering colleges)"
        },
        {
            "author": "@nilnull5457",
            "text": "Many profs during my undergrad studies used PPTs and videos with minimal change over time. Could make their classes the same way what edx does. Much better to spend time in hands-on research than learning information of often questionable application."
        },
        {
            "author": "@prakashth",
            "text": "Bro killed entire education system in 30 seconds 😂"
        },
        {
            "author": "@SultanMH33",
            "text": "Your talk is complete waste of time👎🏻"
        },
        {
            "author": "@sarabdeepsingh7149",
            "text": "That&#39;s good for skill development or knowledge accumulation but not holistic education which involves interactions, discussions, student-teacher relation and cohort learning."
        },
        {
            "author": "@srikantrawat6281",
            "text": "CORRRRECT!"
        },
        {
            "author": "@spotoncam3640",
            "text": "The human interactions will be lost,  college days memories, romance, etc 😂"
        },
        {
            "author": "@vamshibaina789",
            "text": "bro forgot social skills, practical learning for engineering &amp; medicine and completely forgot about college experience with friends…"
        },
        {
            "author": "@kushagrabhardwaj1",
            "text": "When you have a 1.5 Billion people looking for the same resources located in such a small country as in India. We are talking about tertiary education being made free.The fact that we are talking about AI in Education in a country as untrained and unskilled as India. Wow! The number of times Free has been sold as a way of a better future in my country , I would look at at Stalin and his Great Archipelago..."
        },
        {
            "author": "@musa7868",
            "text": "Modiji is so lucky he didn’t have to go thru the bad lectures he is talking about."
        },
        {
            "author": "@iarpanbose",
            "text": "Like farmers didn&#39;t want agriculture reforms similarly education mafias will not allow reforms to take place in education."
        },
        {
            "author": "@alap1983",
            "text": "Modern Schooling has NOTHING to do with Education, learning, and Questioning.<br>It is about Maintaining Hierarchy, Order, Rote Memorization, and ABOVE ALL.... Money."
        },
        {
            "author": "@princeyadav-iw6bx",
            "text": "Ha ha Manta huu lakah kamiya hai abhi kee colleges ke andar aur YouTube par ussee achhe lecture hai par jo growth regular colleges me Jaa ke.sports khelene, see friends bannane, seee ,co-curricular me bhag lene see and many more see hoti hai oo YouTube par nahi hoo sakti"
        },
        {
            "author": "@Abhishek-Sharma_979",
            "text": "Higher Education should be very very expensive if it becomes so cheap that every body can afford then that Education will not have any value."
        },
        {
            "author": "@elexanderstark",
            "text": "But it will impact job&#39;s of teachers &amp; professor . Which is happening &amp; some places teachers are protesting. It&#39;s good for students but , on other side it will impact teacher ."
        },
        {
            "author": "@senthilprasadh7536",
            "text": "Best automation is write a good book or a good powerpoint presentation. Then why do we need lectures? Writing good Book is the ultimate automation"
        },
        {
            "author": "@HariHaran-rg5xg",
            "text": "He didn’t understand the reality. NPTEL helps but does not eliminate the need for teachers. Learning is a not a one way path. You should communicate and interact. What about non-tech skills like leadership and communication. Being an IITian myself, I firmly believe that sometimes you just need one good professor to change your life."
        },
        {
            "author": "@Shortgunss",
            "text": "Why we need you also. This advice can be done by AI. after few days this conversation also will look stupid.😅😅😅"
        },
        {
            "author": "@marinanoeva0",
            "text": "The system he describes is very similar to how we study in Sweden (for free) in universities. You sign up to the course, get the list of literature, find it, read it, and sit exams. Distance courses may or may not have interim assignments, both distance and non can have recorded lectures, non-distant ones tend to have normal lectures as well but not compulsory, group work and seminars to recap knowledge."
        },
        {
            "author": "@ishan2543",
            "text": "Gatekeeping culture of education system is a worldwide issue."
        },
        {
            "author": "@ashishnety4814",
            "text": "But in this case how will Educational Institutions will earn money? That’s the catch. Most of them are aware of how to improve education. But will it happen anytime soon, I don’t think so…"
        },
        {
            "author": "@Samarthfx",
            "text": "Which podcast name is it ?"
        },
        {
            "author": "@suriyanarayananr9652",
            "text": "Looks idiotic.. When you give lecture for n number of times and x number of students are listening to it by the glance at students a teacher can understand whats the majority background of audience so he can give appropriate examples to make them understand also the lecture gets different perspective and understands the concept better when repeated in different environment.. and when you have physical class you have personal connect as well. People think themselves smart and think stupid and confidently say it in public and if anyone oppose their opinion then tag the opponent as stupid.. 😏"
        },
        {
            "author": "@Naraharisettiraviteja",
            "text": "Motivation and discipline is obtained which helps to become wise besides gaining knowledge, Professionals  should be motivating , Institutional motivation should be  earn by build and innovate. then everyone will prosper."
        },
        {
            "author": "@chachasingh4864",
            "text": "Will you hire anyone who learnt everything from YouTube??<br><br>Degree give credibility.West still have colleges and they are almost 200 year old, still running."
        },
        {
            "author": "@_psychopath_5623",
            "text": "Is chomu ko pehle tare zameer pe dikhao.<br>To put it simply, each kid, each student is different. Everyone has different concentration capacity. Alot of times, you need to force the student to study. There are so many aspects in it.<br>Being an English professor, I can give my example, let&#39;s say I am explaining a poem, each year the poem will be taught differently as students have changed, as current issues have changed, even I am changed so interpretation of the poem will be different each time."
        },
        {
            "author": "@dr.sandeepchitreddy796",
            "text": "First of all knowledge is available in the internet , that does not mean that everyone can deciper the knowledge. Every student is at different level of understanding. A teacher only understands this through dialogue and interaction. He adapts his pace and covers basics if needed for the student. Also practical experiments can only be done by physically being in the lab. Handson can happen only while we are physically available.<br><br>A video can only be a fixed content without any adaptation. We can have online live classes. But that too create human fatigue and does not allow to have face to face dialogue and also miss many expressions. Videos can only be a supplementary material after classes but cannot replace a physical class."
        },
        {
            "author": "@somalapuram",
            "text": "Completely agree ❤"
        },
        {
            "author": "@palanigowrinath4871",
            "text": "You tube lectures and gpt do not give knowledge on life ,skills, giving respect, discipline, maturity, interaction with different people and real time experience ect...."
        },
        {
            "author": "@dibyajyotidas5239",
            "text": "My Man. Resonated with me."
        },
        {
            "author": "@DibyajyotiDas",
            "text": "It&#39;s true. Current government has made college education shit by hiring incompetent (bjp/rss backed) candidates. Nice to see that they are fulfilling the promise."
        },
        {
            "author": "@voltgaming2213",
            "text": "Yes agree,self education with the internet and books and AI and course should be the from of education after that colleges should conduct certification and testing system then give the best students time with industry research and projects"
        },
        {
            "author": "@debojitrabha2502",
            "text": "Right education is a blessing. But most education institutions are scams. I have met teacher who you would pass as thelawala and rikshawala if you met them outside. So useless."
        },
        {
            "author": "@bhargabrajmedhi315",
            "text": "Not applicable for every stream...."
        },
        {
            "author": "@prateekgodara7090",
            "text": "This is actually rubbish. At primary level how many kids are wise enough to use the internet properly. In fact how many adults are able to fight the temptations of using social media. Do a survey and find out what percentage of population is using internet for their benefit rather than just wasting time.<br>Schools are required to more than ever before to train them about everything. Yes thier modus operandi should change but they are required. Now I have realised what they mean by people making policies in their ac rooms without any idea of ground level."
        },
        {
            "author": "@adhithyakalidas6918",
            "text": "This is very brave!!! But I still believe college is the place of learning collaboration and finding one&#39;s purpose in life"
        },
        {
            "author": "@user-es2lz7qo1k",
            "text": "His thilinking is wrong completely. Not all human beings are same. Teacher should be there to correct one. This is nonsense lecture by this guy."
        },
        {
            "author": "@chromecast-m1u",
            "text": "I remember of very similar model once  attempted in AP, taking one model college, they had to conduct entrance for UG to find such bright students who could learn on their own. but it could not take off. the main problem lies in the primary/school education system."
        },
        {
            "author": "@shashankashekhardey8786",
            "text": "so much of wrong and sad thoughts in the comments. sad that we lost all the hopes of creativity and went only into the technicality of why colleges are important. it&#39;s not only about the degree or efficiency or placements. for the ones who truly wanna learn interactive sessions are what important. the validation from the peers the praise from the professors the feeling of knowing something the feeling that you have capabilities to create something, a platform to show your skills a platform which gives opportunity to shine in every class rather than a specied event the feeling of livelyness. the physical exposure to outer world and lot more"
        },
        {
            "author": "@shashankashekhardey8786",
            "text": "so he wants machines now? efficient production of corporate slaves huh. he never understood or even tried to understand whats the problem efficiency is definitely not the problem. creativity is the problem."
        },
        {
            "author": "@sanjoy1504",
            "text": "Apparently it may sound genius but in reality  its a disaster. Ai is not that much capable to answer most of the time their answers are wrong. Critical thinking will vanish. Rather we should encourage Critical thinking."
        },
        {
            "author": "@AfritBagani-w2d",
            "text": "Even the Economic Adviser to the PM is complaining against Indian Education System 😂. Then you is going to fixed it up. You are the management, you are suppose to fix it not to complaint. You have the highest power."
        },
        {
            "author": "@techunboxed5641",
            "text": "What he is saying is kind of correct. College should only be for interactions, collaboration, research, certification, social experience and sports."
        },
        {
            "author": "@RohanSingh-pj8js",
            "text": "College ke professors vaise bhi formality karte hain. Sirf attendance k liye time waste karne jate hain vahan. Padhai online hi hoti hai.."
        },
        {
            "author": "@shrutidixit5485",
            "text": "What about employment??? Sir"
        },
        {
            "author": "@sadhnadixit1065",
            "text": "The reason is perspectives. When human interact with others they build perspectives and not rote. <br>Good teachers tend to help in the process."
        },
        {
            "author": "@wlf9971",
            "text": "Bro u don’t understand how things work in ground stage. Going to school and college is not for only learning purposes it teaches us friendship, teamwork, and startup ideas that r born with some people. Those are not available in prerecorded videos on online. Actually being isolated will slow ur rage to learn and do things"
        },
        {
            "author": "@darkstar9540",
            "text": "Its a humble request that If it is feasible for you then please bring short documentaries that give a detailed analysis in a highly interactive way about the economic problems faced by india and its potential solutions which can be implemented at the grassroot level<br>For example as most of the working rural population of india is in agricultural sector so how india can make everyone who is working in or associated with agricultural sector have financial stability and also how india can increase the per capita income of every indian with the strategic use of its current available resources and also on problems like how Indian government ,state governments can collaboratively can ensure that government of india and state governments can create an environment at the grassroot level where the best minds around the globe can come to india for opportunities and also how can those people can contribute greatly to the prosperity of india and indian society and also how india can make its private defense industry equivalent to that of usa as if its get done then it would make india a military super power and how india can make economic alliances with other nations like european union  etc and one more important topic is how India can ensure that all the politicians who are in politics are worthy of running a government and serve people of india in the best possible way and is there a way by which politicians can be accountable in a much more better way than it is now"
        },
        {
            "author": "@whisky00072",
            "text": "Otherwise (ai) it will be serving advts to believe"
        },
        {
            "author": "@whisky00072",
            "text": "Chatgpt replies wrong even simple mcqs"
        },
        {
            "author": "@lakshaysingla168",
            "text": "Are chacha education is more about being networking"
        },
        {
            "author": "@dr.o.s.nirmalghosh4363",
            "text": "All education systems are scam.."
        },
        {
            "author": "@samuelmarndi",
            "text": "in todays day and age if anyone complains about education its their fault 100%. there are so many resources available for free and now ai and u just want excuses. suffer then. i wish i had such advanced technology while i was in school and college. todays students have no right to complain."
        },
        {
            "author": "@debajyotichanda4741",
            "text": "Agree 100%. Colleges are medium to be used solely for practical training and research work, not for time consuming lectures that would not serve any purpose for graduates who are seeking the jobs for the skills required by the company...the very skilss which cpuld be better taught at colleges to train them. Industry connect programs, internships, vocation training, skilld evelopment programs, research oriented projects should replace traditional ways of teaching."
        },
        {
            "author": "@satyamsatpute6084",
            "text": "Different lectures is to keep up with the upgradation of the technology day by day and it changes by 20-40% every year ie the syllabus and to ensure non repetitions of the same questions 😂😂"
        },
        {
            "author": "@alibabagroup3433",
            "text": "If there is a need to give good lecture once on internet What about soft skills such as socialising, communication, body language expression, negotiation, discipline, moral values etc..."
        },
        {
            "author": "@evensaj",
            "text": "I agree with him , why should colleges charge so much fees while the whole courseware from iit and mit is free on internet"
        },
        {
            "author": "@dronutube6698",
            "text": "Don&#39;t put this guy in education system. Please. Do rest what you can from outside. You letting human ethics leave soul."
        },
        {
            "author": "@dronutube6698",
            "text": "Because YouTube is not mode of education. Watching doesn&#39;t let you only learn. It&#39;s makes life miserable different and you can&#39;t make human just by watching. Nature or tv or internet or 5g. School is utmost important. Yes picture learning can be added instead of theories. But ten grades are necessary for basic human mankind to let earth revolve. <br><br>Testing and certification can be increased instead of theoretical concept you not wrong. But school can&#39;t be closed."
        },
        {
            "author": "@dhonddevameya2362",
            "text": "By this logic, we can also argue that well educated parents should not let their children go to school...They should teach their children at home without wasting much time.... But the catch here is, only few people on the planet are self motivated to concentrate at only learning and keep other things on second priority....other people desperately need a proper environment for learning(many times, this is not possible in online lectures....students may get easily distracted while learning at home)....We should always remember that learning is not limited to following chapters and solving exercises...It is also about solving our problems with the help of fellow students and teachers...Learning by helping each other is prominently possible in school/college environments...In corporate, there will be no standard textbook for learning work...One has to reach out to numerous people to solve basic problems and doubts...So habit of asking right doubts at right time is also a part of self improvement and ultimately learning....Online resources may help a lot when we dont find proper medium to understand a perticular thing...But school/college environment shouldn&#39;t be replaced by online lecture...School colleges are the basic building blocks of domain knowledge as well as personality development(including soft skills)."
        },
        {
            "author": "@PragyaTripathi-q1r",
            "text": "Ugc says after cancellation there will money refund but pvt college asking for full money to give my tc back and just 1 day after I ask for cancel .they are said this is their policy<br><br>Whole system is scamm chorrr"
        },
        {
            "author": "@BeingNewUser",
            "text": "I’m enjoying the series on Zero1! I appreciate your effort on presenting worth watching financial videos! 👍 to entertaining scripts!"
        },
        {
            "author": "@vansh_2016",
            "text": "Industry: AI , automation , cloud computing<br>College : 8085 processor 🤡🤡💩"
        },
        {
            "author": "@abhinavsarkar8354",
            "text": "People who know nothing about education should not be giving opinions about education.<br><br>Its true that most colleges are just degree-mills giving no value to the student. But that doesn&#39;t there is no value of a good teacher or a good teacher can be replaced with AI."
        },
        {
            "author": "@KuldeepSingh-bw1er",
            "text": "We’ll use AI and videos to help with understanding the basics. For advanced levels, students will work on live projects, discuss them, and collaborate on research. They’ll share knowledge and ideas while working together.<br><br>Ofcourse it will take atleast 15-20 years"
        },
        {
            "author": "@mrgz999",
            "text": "Good Observation.. <br>Is this why students go abroad for further studies?  Brain Drain"
        },
        {
            "author": "@hrishikeshgore3186",
            "text": "Even lectures are useful little bit but the assignments and writing part is worst thing possible on planet Earth"
        },
        {
            "author": "@searchingforstuff8578",
            "text": "Bullshit…its like watching how to impress girl on youtube.. when you are super shy and hesitant in person"
        },
        {
            "author": "@xtremeworld2005",
            "text": "Sir what about employment generated by teachers and profesor jobs."
        },
        {
            "author": "@ZUBAIRMOHSIN",
            "text": "Agar education, specially school education online ho jaye aur offline school na rahe to 30 to 50 percent Indian population illiterate reh jaye gi. Most students don&#39;t have the luxury of owning a smart phone and phones are not designed for online classes"
        },
        {
            "author": "@Indianabhishek7",
            "text": "Videos can never replace Classroom. Classroom and college education is still relevant. Yes colleges should improve their quality and ways but videos is just videos..."
        },
        {
            "author": "@signvi",
            "text": "Wow this guy should be the education minister."
        },
        {
            "author": "@vihang300788",
            "text": "Just go and teach in an undergraduate class once. Then say this."
        },
        {
            "author": "@PragyaTripathi-q1r",
            "text": "It can never be happened in world of money , small state college even update their syllabus and take money which never refunded, totally wastage of money and making fool to their oun country students"
        },
        {
            "author": "@AdityaKumar-sx6qk",
            "text": "education system is not a scam it is a business no one want to teach any one any thing for free everyone has family desires they want to fullfill and no one take free stuff serious. Is not this true why should anyone give their time to others when their is nothing to gain."
        },
        {
            "author": "@chandrupalaniappan1369",
            "text": "Very good idea. Our education system should change soon."
        },
        {
            "author": "@Jk-trp",
            "text": "The best, the best approach. Seriously, why should college spend time on same content."
        },
        {
            "author": "@Rohitkumar-vg5xi",
            "text": "Ohh really, why should people go to school/college even for research,exam,test ..<br>1 good researcher is enough,1 good student who can score more is enough to write exam..<br><br>Even we can fill our hunger by watching 1good cooking youtube video..😂😂"
        },
        {
            "author": "@asimdaruwala303",
            "text": "Finally someone gets the obvious 😂"
        },
        {
            "author": "@PoojaSharma-ze1uj",
            "text": "How about different set of questions by diffrrent intellectual students. Peer to peer comunication &amp; finding great intellectual friends ?"
        },
        {
            "author": "@akshaykubagh9930",
            "text": "I can see many people in the comment box are saying that if a student would not go to school/college ,there will be no moral development of the student. But i think they are missing one point here. He didn&#39;t say that students would not go the school/college rather he said that theoretical portion should be uploaded in the media platforms like you tube, where a student can access it for free and the schools/ colleges must focus on research and practical knowledge . Which means students would still go to school/college but this time for practical knowledge and since they are going to school/college then according to your doubt they are getting the moral development too. And earlier education institutes could not manage the overall development of the student because of the burden of theoretical portion but now they are free from this burden and now focus on the practical knowledge and moral development of the student. But  he also believes that atleast upto primary level school/college should provide theoretical lecture in class and after that a student is mature enough to access the theory uploaded on media platforms like you tube for free."
        },
        {
            "author": "@deepkadamba7083",
            "text": "Sorry AI cannot be human. In Indian context it is better to give Survey collections and election duties to AI. <br><br>Do you know why Vedas Survived. It was Guru-Sishya parampara."
        },
        {
            "author": "@userBharatiya",
            "text": "YouTube video lectures do not get updated by themselves <br>And they just give explanation but don&#39;t inter connect with other subjects <br>They don&#39;t teach social behaviour and moral education"
        },
        {
            "author": "@curiousabhishek2009",
            "text": "Interaction is very important . This guy is wrong . These days everyone thinks they can speak bullshit in podcast with some motivating music and get immortal ."
        },
        {
            "author": "@iscifion7122",
            "text": "I agree<br>Because even thought I&#39;m in college but that&#39;s exactly how I&#39;m studying in college.<br>YT+AIChatbots(ChatGPT,Claude or Gemeini )"
        },
        {
            "author": "@AbbyRCToys",
            "text": "You need to interact and learn the aspect of becoming  social qhich children get taught from primary classes...yes but I agree colleges are not a must"
        },
        {
            "author": "@playhard719",
            "text": "This is exactly what I thought, this also allows every one to became teacher and bring back masters/student system"
        },
        {
            "author": "@sunilkumarprakash5077",
            "text": "Where is the full interview?"
        },
        {
            "author": "@vivu7289",
            "text": "I partially agree with him. Only the 20-40% learning/repeated lessons can be made recorded and Gen AI can be a catalyst but we still need colleges for subjects discussion, debates on different opinions, personality development, practical training, networking etc. On Job training kind of module can be introduced in Universities. The world is changing so rapidly and every subject is getting updated every six months, so recorded lectures won&#39;t work. But again, this is an agenda from the government. They can&#39;t handle the budgets well, when questions are being asked for the lower budget for education in spite of collecting so much Education cess, but instead of opening up those new training, research and infrastructure facilities, they are now  eyeing their cost cutting drive on University lecturer&#39;s salary which is huge by volume. I wonder when will they find the expense of free AIR tickets provided to the MPs/ MLAs as unreasonable."
        },
        {
            "author": "@pushanpore8365",
            "text": "The assignments you do staying up late at night teaches you how to handle time and pressure"
        },
        {
            "author": "@sarthakskshirsagar9458",
            "text": "Sir if they will make it free then the professors will be unemployed and college may not earn money as it was done by donation,etc"
        },
        {
            "author": "@Mayank0303",
            "text": "100 % agree on this. Many National Colleges in the name of digital education shows content of YouTube to students. Their should be focus on building industry ready skills which make students job ready Instead of giving useless degrees and marks."
        },
        {
            "author": "@kartikeytyagi9271",
            "text": "Sir you are the government, why don’t you do something about making education curriculum more industry friendly? Why are we not able to downplay the aura of civil services like IAS and IPS? This is destroying our youth and our country. We are losing billions in our economy because of these overhyped jobs."
        },
        {
            "author": "@SAY-jf3hy",
            "text": "Bro , i literally made a video cut of this partiçular segment amd spread it in 5 of my college groups.<br>The responses were mediocre though"
        },
        {
            "author": "@gowthamanjaiganesh3210",
            "text": "NEP 2020 when will it be implemented?"
        },
        {
            "author": "@SuperSAIMADHAV",
            "text": "Very good... But as CEA to Govt of India.. I think... Your words should also reflect your actions in the form of POLICY MAKING..."
        },
        {
            "author": "@_Sayan_Roy",
            "text": "An offline lecture has the advantage of interacting with the teacher . Online lectures are just a one way method."
        },
        {
            "author": "@aksgalaxy2745",
            "text": "I oppose it, how will you replace the practical education given in engineering and medical colleges, will you also provide it online? <br><br>Study is not only equal to lecture"
        },
        {
            "author": "@_Johnny_BRAV0",
            "text": "But wat abt the elementary engg lectures.. they have to be in college facility."
        },
        {
            "author": "@tvythevideosforyouth4997",
            "text": "I can&#39;t agree more on this ❤. <br>Most needed"
        },
        {
            "author": "@hardikbhandari0097",
            "text": "It&#39;s an impractical thing to do so. UG courses aren&#39;t simply easy that one can understand by watching YouTube and ask to AI. I personally being a UG at IIT know the amount of mentorship required to master a subject. Stuff like Quantum Mechanics, Advanced Mathematics Computation Theory etc cannot be easily understood just by the means of some YT video lecture and AI. It needs human interaction with someone who has good experience in teaching it so that they can tackle the question from multiple dimensions of the same concept, which a machine clearly cannot do.<br>I have used AI to solve my queries (not HW), we being a social creature will eventually get bored of typing our doubts and the kind of inhuman interaction with a ChatBot. And this machine is only limited to the words you type, it cannot understand the subconscious emotion why someone will ask such doubts, only a Human teacher can address these things in a magnificent way."
        },
        {
            "author": "@Infoworldlko",
            "text": "Because the education sector creates lots of jobs, which are needed by the people of india,<br>If education becomes automated then India will fall,<br> First we need to create a lot of jobs apart from education sector, then we can"
        },
        {
            "author": "@SanAntonioDean",
            "text": "This guy is talking about a concept that was being discussed 10 years ago. 2013 was a year of hype for MOOCs (massively open online courses). Great big numbers and great big hopes were followed by some disappointing first results. But the head of edX, Anant Agarwal, made the case that MOOCs still matter -- as a way to share high-level learning widely and supplement (but perhaps not replace) traditional classrooms. Agarwal shared his vision of blended learning, where teachers create the ideal learning experience for 21st century students."
        },
        {
            "author": "@sumandas3225",
            "text": "Is in the world everyone talk in same language???"
        },
        {
            "author": "@darkwarrior_agentj3879",
            "text": "Joblessness will be at its lowest after this😂"
        },
        {
            "author": "@RAHULTIBREWALA",
            "text": "Education is free even today.<br><br>For most of the subjects, lectures by some good professors are available online for free, same is with books.<br><br>The fees in tertiary colleges are for giving them the certificate. Certificate saying that now this student is branded by us. And the student can take the certificate in interviews. This is a big advantage, which cannot be outsourced to AI."
        },
        {
            "author": "@sarveshjewalikar9921",
            "text": "Boi boi modern college isnt academia, it is cram school 😂"
        },
        {
            "author": "@anupnadkarni9569",
            "text": "Somewhat True unless n until the ecosystem n social mindset is structured tht way.."
        },
        {
            "author": "@jagadeeshr4387",
            "text": "Made a excellent point...i completely agree with him..imagine harvard classes made online for free.."
        },
        {
            "author": "@unexpectedwe6697",
            "text": "This is stupid, education doesn&#39;t mean only listening to lectures"
        },
        {
            "author": "@F_A_R_U",
            "text": "The education industry is more than 100 billion dollars industry. Do you really think education mafias and politicians will allow so called &quot;tertiary education&quot; for free 😂😂<br>If we need to grow in our life we need to learn by oneself and not believe in any lol system"
        },
        {
            "author": "@Gwen00712",
            "text": "They should become places for research and innovation and places for testing line is so accurate like actually lectures are real waste of time most of the students i know in college learn from youtube 1 week before exams, no one really focuses on learning from lectures  just there to complete 75 attendance criteria."
        },
        {
            "author": "@tanmaybhayani",
            "text": "This is the perfect take 👌"
        },
        {
            "author": "@cosmic_369_amk",
            "text": "We do not have YouTube yet😅 but that&#39;s a great idea..."
        },
        {
            "author": "@apexLWC",
            "text": "It&#39;s not about education nowadays! we don&#39;t want to produce robots in society. In primary education usually students learn from their friends they communicate , interact and compete with each other."
        },
        {
            "author": "@anterperuner",
            "text": "Yes college is only for having fun you can nothing learn from there"
        },
        {
            "author": "@shilpagujiri4532",
            "text": "This is so true, i learn most of my undergrad lessons from internet. I hate the college lectures, they&#39;re so out of touch with reality and ancient, instead, i just study foreign authors and publishers and it feels more fulfilling.<br><br>There are many courses, you can get for free, if you don&#39;t want tge certificate, and you can learn way more than in a classroom"
        },
        {
            "author": "@ruturajyadav5130",
            "text": "What I learnt during my engineering was how to study the basics of the entire subject in a month (before the exams) and I know even today after 18 years it has helped me in the field I am now. It&#39;s not just about the technical knowledge you receive in the engineering college it&#39;s about the contacts and the relationships that you form the stress that endure... There is a lot more to it. You develop leadership skills and interpersonal skills... Without colleges it&#39;s like trying to swim by reading a book. <br><br>Yes there are deficiencies in education system but the countries that have taken a lead in innovation are following the same college model - just that their teaching methods are different."
        },
        {
            "author": "@vijayraju5699",
            "text": "Every thing revolves around money education become a good business they think in business aspect only"
        },
        {
            "author": "@vaibhavkarv",
            "text": "He’s somewhat right but then he’s assuming that college kids would be mature enough to learn on their own via online training platforms. College kids will not spend time learning unless they are asked to sit in classrooms. If they are not in classroom they will do avara gardi and become an unproductive member of society."
        },
        {
            "author": "@surajmishra3731",
            "text": "Because Company wants degree they won&#39;t hire you unless you have relevant degree forget hiring they won&#39;t even interview you"
        },
        {
            "author": "@parthapratimkalita1906",
            "text": "1000% true. I am a master&#39;s holder in computer science...the professors did not have a clue about the latest advancements in the CS world and were giving notes that they made for themselves in the 80s..."
        },
        {
            "author": "@aaryanjadhav2822",
            "text": "Using AI (aka LLMs) for learning is like playing PUBG to understand war. LLMs are great but also can give you wrong information."
        },
        {
            "author": "@sutthaamuttha",
            "text": "And AI can answer?? I wonder if you even have used AI properly. AI can answer but not to all the questions and moreover it’s not entirely reliable. When students are learning something new, it’s important they get the right and reliable information not the highly probable falsified version generated by AI. Moreover interaction would go “astray” and students will not get a chance to hear different perspectives from their peers which is possible in a classroom environment which is not likely in a YouTube style teaching. <br><br>Major issue in India is not enough infra for students to learn things practically which makes it difficult to remember things they learn."
        },
        {
            "author": "@adhavanerode2164",
            "text": "BS. AI is not good. This guy is lobbying for AI"
        },
        {
            "author": "@g.senthilkumar4491",
            "text": "Yes 💯 Right this is the system followed by foreign countries"
        },
        {
            "author": "@Twitterrrr",
            "text": "Youtube... after 2nd video. <br><br>An unwanted video with girls dancing on trending song."
        },
        {
            "author": "@AmanGupta-ci1ik",
            "text": "I think physical education is important for everyone."
        },
        {
            "author": "@harikrishnanchandramohan4209",
            "text": "Meanwhile, all the Hermiones of the world. There is nothing like attending a live lecture from a legendary Professor, making friends in the campus like in Hogwards, marketing to everyone that you went to an IVY league. As long as you have shameless self- promoters, these Scam Institutes will thrive."
        },
        {
            "author": "@vaibhavpatel6507",
            "text": "Colleges should be place of discussion, debate, research, skill development, project &amp; direct work , R &amp; D. Problem solving &amp; creation should be part of it.<br>Class room education needs improvement regarding today&#39;s tech &amp; necessity.  Class room edu is better than online, just my opinion 🙏."
        },
        {
            "author": "@aachalyadav1503",
            "text": "No it&#39;s not, we have experienced that during covid the level of focus in children is reduced recent reports show the data... That is how children n college students are going into deprivation due to technology"
        },
        {
            "author": "@mothish.",
            "text": "Colleges are already a place for research and development but are very less to find in India and only privileged are getting access don&#39;t super amplify things"
        },
        {
            "author": "@PrachieJain",
            "text": "School and colleges don’t primarily focus on just students academic part but also they work on their holistic development which they might not get while learning only from some YouTube educational video."
        },
        {
            "author": "@HavishG",
            "text": "That&#39;s exactly what even i believe. And that&#39;s what even i plan to work on"
        },
        {
            "author": "@gourabmondal7692",
            "text": "It sounds like the CA Exams that ICAI conducts. Classes can be done from YouTube and the institute only provides necessary soft skill training and exam facilities."
        },
        {
            "author": "@prabhuar1989",
            "text": "Why don’t you implement what you speak and believe"
        },
        {
            "author": "@aditya_baser",
            "text": "I sort of disagree. While self-study along with minimizing plagiarism are crucial, my offline college experience taught me that the most valuable aspects were building lifelong connections and learning to navigate real-life interactions. Offline education is truly irreplaceable, and we should focus on finding ways to integrate AI while preserving the benefits of an in-person learning culture."
        },
        {
            "author": "@jackiecooper9439",
            "text": "Education lobby won&#39;t allow reform. Our &quot;representatives&quot; are weak"
        },
        {
            "author": "@coldstone87",
            "text": "Frankly speaking most people join engineering and MTechs only because of placements and not learning. Almost everyone knows to use chatgpt these days"
        },
        {
            "author": "@factbyabhishek",
            "text": "Correct 💯"
        },
        {
            "author": "@esportbaazlive3810",
            "text": "An institution has many job opportunities including teacher support staff as well as many indirect job ... ..."
        },
        {
            "author": "@agrikiruba",
            "text": "💯 true, this is the future"
        },
        {
            "author": "@sanjulatadas2438",
            "text": "Obviously. Current education system throughout the world is a scam<br>And Indian one is a massive scam..😢"
        },
        {
            "author": "@acemaster-es8bq",
            "text": "Could&#39;ve done the short edit better"
        },
        {
            "author": "@shriniketlangote676",
            "text": "Reality missing 😢"
        },
        {
            "author": "@vikhyatsharma17",
            "text": "If tertiary education is made free, then how will these institutions make a huge amount of money they are making now?<br><br>Research and practical knowledge should be the focus as we move higher in the education level but this requires huge reforms in the education system in India which is not possible now."
        },
        {
            "author": "@liamneesan9712",
            "text": "Lecturing will create a discipline. 60 Students used to sit and listen to the professor at a time without diversion and have a q&amp;a among students and staff. Whereas if you listen to the youtube lecture out of 60 may be 6-8 ppl will watch others don&#39;t. There is no q&amp;a. So students used to listen only, it will be like radio, it will be fixed in our mind that we cannot make interrogation,  no Q&amp;A, no discipline.<br>Youtube and chatGpt are highly helpful to get deep knowledge, BUT AFTER LECTURING."
        },
        {
            "author": "@suvinaypisaldeshmukh",
            "text": "This will increase unemployment"
        },
        {
            "author": "@harshgoswami8805",
            "text": "Telegram= modern education"
        },
        {
            "author": "@curlyaudichya25",
            "text": "Student need discipline which they get from a proper offline system this is the reason sir"
        },
        {
            "author": "@anandapatmanabhansu",
            "text": "Interaction is the most important part of education, that is not happening properly."
        },
        {
            "author": "@anandapatmanabhansu",
            "text": "Main this in a lecture is we can ask questions, that is most important, that cannot be done in youtube."
        },
        {
            "author": "@mohankrishna3597",
            "text": "Let me be short and crisp .<br><br>Actually most of the state government provide free education and even affordable schools are available but the quality is pathetic in terms of teaching , syllabus and lack of practical oriented and labs .<br><br>But state governments spend huge money on education which must be properly managed such that we must provide a world class education.<br><br>PS. The schools which get fees over 50k+ or  few lakhs don&#39;t give quality education and my comment doesn&#39;t mean that 0.001% of school who could have a world class education ."
        },
        {
            "author": "@vasu_devan",
            "text": "If this has to happen, colleges need to have a stringent selection system for teachers pay above par to teachers n work on solving tmrws problems of industry,society"
        },
        {
            "author": "@BilalKhan-cq6mn",
            "text": "To matlab ab teachers bhi berozgaar hone wale hai?"
        },
        {
            "author": "@turansahab",
            "text": "Great Idea"
        },
        {
            "author": "@me1sunil1yadav",
            "text": "All talk or some future actions??"
        },
        {
            "author": "@OmKumarSingh-gx1ns",
            "text": "For those interested - havard and other top universities upload their computer science classes online. So if you want to try what he said. You all can use YouTube and try if this is much better."
        },
        {
            "author": "@sleepingiv",
            "text": "No link between Institution &amp; Industry."
        },
        {
            "author": "@pranavsharma5101",
            "text": "Our entire education system is total scam. We&#39;re wasting our time learning information which is available to us on our fingertips but are devoid of skills which are needed in job market"
        }
    ]
}