{
    "videoId": "IG36kWLgM6c",
    "totalComments": 222,
    "comments": [
        {
            "author": "@Geniere10",
            "text": "Do we need to even go into these reasons of why rape is bad? Isn’t it horrifying enough by itself?"
        },
        {
            "author": "@srajansoni4467",
            "text": "we think issue is of particular field but in reality it is always multidisciplinary economy, polity, society, psychology!!"
        },
        {
            "author": "@oxnious2026",
            "text": "My sister also didn&#39;t joined a rural namudoi bidyaloi school as a psychologist."
        },
        {
            "author": "@rahulkumargiri8864",
            "text": "Make places safer for women but don&#39;t dare to look at them as some economic growth derivatives. They are more than that and they should never be pushed like Western society to be part of work force . It&#39;s should be choice always for better social growth and prosperity."
        },
        {
            "author": "@moonchild4689",
            "text": "Exactly thisssss. This is what most people don&#39;t understand and I don&#39;t know what&#39;s in there not to understand!!"
        },
        {
            "author": "@geonsorigin2108",
            "text": "It&#39;s fascinating to see generally smart people clueless yet confident about certain things."
        },
        {
            "author": "@jamaar_gobaat",
            "text": "Never thought about it like that but makes so much sense."
        },
        {
            "author": "@EthicalChimera",
            "text": "Rather than safer change the mentality that only men can enter workforce and when making laws on women safety make it 50/50 which will also protect victim of false rape accusation and to further concrete safety infrastructure and security should be upholded to a standard on any and all government private institutions which house and provide service to all women Jai Hind"
        },
        {
            "author": "@Hrithik_Rai",
            "text": "Omg the intellectual point though....😊"
        },
        {
            "author": "@josephif",
            "text": "R*ping is an economic issue proving india is still a undeveloped country even if its the 2nd largest economey<br>Still registered as developing country ,modi should have considered these factors instead of wasting time destroying mosque and building temples <br>What a waste of money"
        },
        {
            "author": "@VishnuM793",
            "text": "Instead make their villages prosper, then they don&#39;t have to go out of their village for work."
        },
        {
            "author": "@GotkeSureshGotkeSuresh",
            "text": "No otherway..comes with culture...long term values..very very long term values..inspiration like Chatrapati shivaji..we all know how he treated women..even the wives of other kings who he had defeated..treated them as Mother equivalent..."
        },
        {
            "author": "@ZLQ90",
            "text": "Girls in the village stay in the village... don&#39;t force them out to this darkness"
        },
        {
            "author": "@alwinthomas2313",
            "text": "Let&#39;s not hamper the women in villages and snatch their innocence and their lifestyle. I pray,  they should  be not adulterated by the corruption in big cities. I would rather want women in villages to be bolstered enough to develop those villages into world class places and who knows may be change those villages into prosperity which would bring in revenue and wealth to those villages so that there is no need for them to come to Big Cities"
        },
        {
            "author": "@shrutivaidya6840",
            "text": "Women safety is incredibly important issue, but does everyone need to move out of their homes to find stable careers. Why can’t we develop sustainable career options for people in the village. Not everyone is required to work in a corporate. There are a lot of skills people living in the village possess l, we need to identify that potential and create infrastructure so that they can thrive. People from villages migrating to urban cities, struggling for basics like rent and hygienic food, where is the logic in that. Instead, give them opportunities to thrive in their homes so that these other burdens are relieved."
        },
        {
            "author": "@vinayakanramesh2552",
            "text": "My India my pride"
        },
        {
            "author": "@swapnilpharate7970",
            "text": "These kind of illogical critical reasoning brainwashing India these days through new medium called “Podcast” ..making these stupid influencers filthy rich ."
        },
        {
            "author": "@DPranavVaidik",
            "text": "It&#39;s something every business owner and individual to be proactive about. Even smart things like separate toilets, arranging transport for women during late times, work from home opportunities during pregnancy, secure resting rooms for women.. all help with this."
        },
        {
            "author": "@SamSal-k6k",
            "text": "Allow LGBTQI rights to marriage and live with pride, this will reduce most of stereotypes...<br><br>Think wisely you would understand"
        },
        {
            "author": "@shahinshms",
            "text": "mind blowing 🤯🤯🤯"
        },
        {
            "author": "@aayushsaraswatSHIVA",
            "text": "Wat u have to say abt the opportunity that u don&#39;t let have to the males as well in the industry ....y don&#39;t u speak on that ..."
        },
        {
            "author": "@22Sudipta",
            "text": "Nobody thinks, this is a wonderful statement, everyone needs to think 🙏"
        },
        {
            "author": "@nabarkachoudhury4005",
            "text": "Every word coming out of his mouth is 100% pure truth❤."
        },
        {
            "author": "@Maharanaji1",
            "text": "We r a poor country, we have no police fear"
        },
        {
            "author": "@strexinfopedia8114",
            "text": "That&#39;s why women prefer working in foreign companies or foreign countries."
        },
        {
            "author": "@sindhuk8988",
            "text": "When All the male in the school,  college, work place, home and outside home start thinking and respecting the space of women then our planet can become a wonderful place to live.... it&#39;s a collective effort, everyone should start discussing the solutions and ideas in open forums...... Your parents raised you well it all shows on your face men, keeping going. Speak up more encourage anyone who is coming up with any solutions for these henious crimes...."
        },
        {
            "author": "@UjjwalKumar-se6pm",
            "text": "&quot;make place safe for woman&quot; is wish and goal not long term solution... He asked for long term solution.<br><br>Let me tell you solution - it has only solution raise societal consciousness following the path of spirituality and live with Sanatan Dharma.<br><br>It&#39;s not an individual problem but side-effect of where the modern society has evolved to. Victims and accused are only face of it, real problem lies in society. Unfortunately, all we are doing is reacting to an event or accident but not really acting and responding to its actual cause."
        },
        {
            "author": "@Sayan0709",
            "text": "Absolutely correct....if we want 50% of our population to contribute positively in our workforce, &amp; propser in econ9my, then make places safer for women RIGHT NOW!!!"
        },
        {
            "author": "@ajaynikalje3857",
            "text": "movie directors, reporters, writers and activists should show a movie on how incompetent our judicial system is. Justice delayed is justice denied."
        },
        {
            "author": "@ajaynikalje3857",
            "text": "True .. and our govt , police and judges are shameless and dumb.. I feel really sorry for this nation where no nationhood exists."
        },
        {
            "author": "@rp10304",
            "text": "100% correct..<br><br>Its most important for every parent/ teacher/ influencer (sports, media, acting) educate young boys to first respect women and not to objectify her.<br><br>Corporates, institutions should put women safety first.<br><br>Its a social behavioural change that we need to cultivate."
        },
        {
            "author": "@marineblue6594",
            "text": "Correct"
        },
        {
            "author": "@shubhamrajsingh6616",
            "text": "I can&#39;t really say wherever the women suffer , but I know this rural women really have the disability over urban women when it comes to economic independence"
        },
        {
            "author": "@marinanoeva0",
            "text": "Don&#39;t rapes happen in villages and go unreported? I watched a documentary about it. Reporting a rape in a village is a much more complex and difficult issue."
        },
        {
            "author": "@divyanshahirwarphysics1990",
            "text": "Solution -<br>Empowerment through <br><br>1.Political - provide representation in legislative assembly, parliament,local decision making authority.<br><br>2.Economic - better opportunity and skilling <br><br><a href=\"http://3.social/\">3.Social</a> - remove patriarchal mindset and provide them necessary social services including <br><br>a. Education <br>b. health facility <br>C. Sanitation facilities <br>D. Social protection <br>E. Social inclusion <br>F. Decision making opportunities regarding thier life including career, marriage, future plans, child bearing and rearing <br><br>4. Technical - employment robust cctv and protection mechanism, real time monitoring and traceability, quick response time and adequate action <br><br>5. Legal- women safety policy <br><br>6. Judicial - quick case resolution <br><br>7. Police- report and uninclined investigation and avoid any political interference in investigation and <br>Setup special women force<br><br>8. Cultural - gender sensitisation programme and awareness about rights <br><br>9. Religion - avoid the concept of purity and pollution under which women become impure during periods and untouchability is practice with them during periods <br>It hinders their full participation in society<br> <br>10. Individual level - do good upbringing of boys so that they can become good men and not animals <br><br>Save women and respect the &quot;nari shakti&quot;<br>Jai maa bhavani"
        },
        {
            "author": "@OverLord3693",
            "text": "Bro learned from Beer Biceps. Shorts are more emotional content and than informational"
        },
        {
            "author": "@aaranasatish",
            "text": "We want justice"
        },
        {
            "author": "@hari__unnikrishnan",
            "text": "Education ( not certificates)is the only solution"
        },
        {
            "author": "@djv7804",
            "text": "You are absolutely right about the economical impact.. 👍 <br><br>How to correct the situation - we need to revise the childhood education system and method of upbringing especially for boys.. <br><br>This will certainly bring down the issue."
        },
        {
            "author": "@SrishanthKakatiya",
            "text": "Making strict rules"
        },
        {
            "author": "@dharmeshparikh7837",
            "text": "Make place safer for women, but it should be responsiblity for people first, not just law and order, because law &amp; order are toothless in most states except for a few. 😑😑"
        },
        {
            "author": "@mayankshekharsingh154",
            "text": "It&#39;s a very good take/ perspective on a crime against the society"
        },
        {
            "author": "@jaishreeram3274",
            "text": "There are many rape cases seen at village also ."
        },
        {
            "author": "@adrishbpublicpolicy",
            "text": "Very insightful comment."
        },
        {
            "author": "@kanishk449",
            "text": "Also, develop the villages, so that people can stay back home and prosper over there itself without overpopulating the cities. It’d almost diminish the class disparity"
        },
        {
            "author": "@user-us5gt1ug8h",
            "text": "Collective memory is so fickle we forget the outrage once another headline comes up,if what you say is true,Delhi would have got vacated after Nirbaya&#39;s heinous murderous attack"
        },
        {
            "author": "@annesantiago471",
            "text": "Well put 👍"
        },
        {
            "author": "@usernjckkcpvjsndn",
            "text": "I didnt went outside delhi my parents didnt let me ... bcz they were worried then  i was allowed to complete my masters in du 😢"
        },
        {
            "author": "@davehastin3683",
            "text": "Bullshit point. A village or a city is as powerful as its residents. It is not essential for everyone to go to big cities in order to be productive or do something in life. If a girl does not go to City and stays in village, she will contribute to her village. What&#39;s the difference?"
        },
        {
            "author": "@vinaypatidar5901",
            "text": "Good video but not the right response."
        },
        {
            "author": "@shikharnigam6193",
            "text": "That&#39;s not a solution XD"
        },
        {
            "author": "@jayeetaghosh-5194",
            "text": "At leat someone tell the truth about social and economic issues"
        },
        {
            "author": "@Kalyan-s9f",
            "text": "The long term solution: <br>Make villages as prosperous and filled with opportunities as cities.<br>So that cities will be forced to up their game in terms of safety, justice, cleanliness etc. due to competition from rural regions, in order to attract talent. Not because the talented people don&#39;t have any other choice.<br><br>Why should all prosperity be concentrated in cities?"
        },
        {
            "author": "@RomitDholakia5",
            "text": "Look at west. They pushed women into the workforce and now they are suffering from population decline. West is sick. We should not follow them."
        },
        {
            "author": "@joylinepinto6973",
            "text": "So pertinent today to ensure that women feel safe in our country. Things that are happening are nerve wrecking!!"
        },
        {
            "author": "@megalacg",
            "text": "If the village is self sufficient to support the economic growth of people staying there and all infrastructure available,<br>Why will people move to a city?<br>Why are all jobs and development concentrated in specific cities.<br>Why not spread development across the nation?"
        },
        {
            "author": "@Bhargavikulkarni32517",
            "text": "Yes it is necessary not to wear body exposing clothes and going late nights.<br>Please be optimistic think about ground reality solution."
        },
        {
            "author": "@ShubhamGupta-jg7wq",
            "text": "Women empowerment in our country is elite class empowerment 😌"
        },
        {
            "author": "@keerthanadevi0776",
            "text": "That is true. After this Kolkata doctor incident. My neighborhood aunty is now afraid of sending her daughter to study nursing.🙄"
        },
        {
            "author": "@piyushkumarsah",
            "text": "Gr8 point . I understand this thing very deeply."
        },
        {
            "author": "@Dewdrops34215",
            "text": "Yes 100% look at history of work in the US. There are movies like North County and Hidden Figures that explain this beautifully."
        },
        {
            "author": "@loulicious5882",
            "text": "I love this finally now maybe men and bros will look at this as smthng personal too its not just save our sisters mothersit save economy"
        },
        {
            "author": "@venkatesh4715",
            "text": "Absolutely correct 💯!"
        },
        {
            "author": "@Noxxx18634",
            "text": "When you realise : Govt. Never wanted to make india better."
        },
        {
            "author": "@Segen_Bell",
            "text": "The fact that most people won&#39;t change social issues unless it affects the economy is just sad."
        },
        {
            "author": "@jyotiyadav5641",
            "text": "Justice for Kolkata Dr 😢😢😢😢"
        },
        {
            "author": "@HarikrishnaKommmaddi",
            "text": "Stop selling of alcohol"
        },
        {
            "author": "@vihang300788",
            "text": "I have one request for all the influencers. Please talk about how to educate men regarding consent, respecting women, and developing a healthy approach towards sex, gender, relationship, and family. Please create a pressure on the government to develop a massive program for educating boys and men. Only then there will be some change."
        },
        {
            "author": "@innocentmushi3036",
            "text": "Another difference between India and China. <br>In India rape is still a problem."
        },
        {
            "author": "@Astrotase",
            "text": "Only plain Indians, northeast indians and south is so much safer"
        },
        {
            "author": "@aartisharma8054",
            "text": "How do you make places safer for women?? No one is answering that question. By stating that we need to doesn’t help…. Because the duty to make workplaces safer for women is given to the men who have absolutely no clue what safety means… for them safety means lock up the girl, ensure dress codes, restrict her timings…. If you want work places safer for women… let’s start imposing and creating stricter laws with dire consequences for both the actual or potential perpetrators and the women who misuse these laws….. An open conversation and / or dialogue with the men at workplaces should be conducted by the women not by men… Strict guidelines on what can and cannot be said and what can and cannot be construed…. Armed female security guards and continuous monitoring of CCTV cameras…. Thorough and regular checks of personal spaces like female toilets and locker rooms for cameras, devices, etc…. <br><br>Women deal with returning to work post maternity leave only to find that the workplace changed and they were left behind, She is mocked for taking leaves during menstruation and labelled too many holidays, the ones imposing these are the men….<br><br>Sensitise the men to understand women issues that’s when you will exact change…."
        },
        {
            "author": "@vaibhavpatel6507",
            "text": "in India literally no body means no body is safe 100% not f**king even prime minister.<br> <br> Convoy of PM tried to surrounded punjab by protestors (pseudo protestor)<br>SSR was killed nothing happened.<br><br>India has serious problem of administration, judiciary, police &amp; maintaining proper low &amp; order. <br>Mafia &amp; money power &amp; political power people become headache for this country, they can do whatever they want ! No one could stop them by committing crime, corruption &amp; being goons. Most of them have powerful political backup."
        },
        {
            "author": "@hi-oj1jh",
            "text": "Make this in regional languages also so that msg spreads to all."
        },
        {
            "author": "@Niwhsayadwog",
            "text": "So that&#39;s why people move to South India and Mumbai because it&#39;s comparatively safer than the rest of India. That&#39;s the reason their economy, quality of life growing rapidly."
        },
        {
            "author": "@faneeshbansal637",
            "text": "Educate the boys,men.. raped first happen in mind and thought of rapist.. we have to stop them here..  his concise must be enough strong to fight against this thought.. so he will think what he is doing.. and this will happens only we crate environment.. educate males about consequences.."
        },
        {
            "author": "@ayantikadas1",
            "text": "Something that you mentioned long before.."
        },
        {
            "author": "@rosieb8732",
            "text": "Strong message from intellectual minds."
        },
        {
            "author": "@ChandrakanthSH",
            "text": "You&#39;re wrong...I ll come one day to answer you.. its you means &quot;whole world &quot; .."
        },
        {
            "author": "@benjaminlsubba",
            "text": "Damn so good. Never thought it in this way."
        },
        {
            "author": "@Onepercent12",
            "text": "To make a place safe for girl. You should look at the points why boys are safe."
        },
        {
            "author": "@annamalaian0711",
            "text": "This is so true. I have witnessed these incidents so often."
        },
        {
            "author": "@f1gamestring352",
            "text": "Make every where safe for two gender"
        },
        {
            "author": "@debaratidas2161",
            "text": "Forget about villages, this is no less in towns as well. <br>I have many talented friends here who are not allowed to go to a better city because of this."
        },
        {
            "author": "@mamtat7206",
            "text": "Ur es exactly this is Hurting our Country internally and Worldwide. Who in their Right Mind wants to Visit India if Rapes and Murders keep happening. We will loose big time it’s time we all wake us. As our Economy will get affected in many ways. And also Forget about getting any Respect Globally. We Need to make sure All Men and Women are Safe Equally."
        },
        {
            "author": "@lavishinglife2567",
            "text": "That&#39;s true... girls reject job offers from offices in Delhi because it is not considered as a safe city"
        },
        {
            "author": "@BIOS190",
            "text": "This is same reason I was denied going abroad.."
        },
        {
            "author": "@dibborah8203",
            "text": "Make places safer for women"
        },
        {
            "author": "@prishacomar514",
            "text": "Bro stop associating such a sensitive issue with money. Yes your point is right that it&#39;s hampering productivity etc. But instead of associating and being calculative and assigning monetary value to humans. First can we please give human value to humans. Can we please treat our girls with respect and dignity and respect their boundaries. Only a nation with a developed mindset is ready to grow into a successful economy"
        },
        {
            "author": "@keepmewherethelightis1036",
            "text": "After the kolkata rape case i decided i dnt wnat to raise my kid in India. I am moving to france and I will make her a doctor. If she wnats."
        },
        {
            "author": "@nikvasdbz",
            "text": "Linkages and perspectives 💯"
        },
        {
            "author": "@hareeshchandra",
            "text": "We have a useless police system where many posts are lying vacant , many stations don&#39;t even have enough funds for stationary and rely on bribes.<br><br>Above all they toss around the victim saying it&#39;s not their jurisdiction. Let it be village or city. If u have power and influence police will lick ur boots. <br><br>So get rich and help victims that the only option in this useless  country."
        },
        {
            "author": "@mrgz999",
            "text": "Talk shows go on and on...<br>Time to act - the action is missing.."
        },
        {
            "author": "@dronutube6698",
            "text": "So men who speak so that includes owner of think school, me the reader, the other viewers to stop all that pain or insecurity for women so to automatically become law enforcement to stop all this. Not to put in words."
        },
        {
            "author": "@toinfinityandbeyond4027",
            "text": "This is happening to me right now... I&#39;m a doctor, currently looking for a job. In metro cities the pay is good but I belong to small town and my mom didn&#39;t allowing me to get a job in cities like Hyderabad and Chennai.<br>Even after this bengal issue she is so scared about me taking PG in North 🙁... I can&#39;t even practice peacefully in my own country... 😢"
        },
        {
            "author": "@uzmashaikh1983",
            "text": "Absolutely right! Need more discussions like this."
        },
        {
            "author": "@namastechina.5637",
            "text": "Underutilized we have an unemployment rate so high 😂😂😂"
        },
        {
            "author": "@shivachandrasekhar2676",
            "text": "So unfortunate that a social problem<br>Has to be marketed as economical problem to gain importance. Make place safe for women also implies stop objectifying women in Bollywood item number and many other forms not limited to law enforcement."
        },
        {
            "author": "@Learner5406",
            "text": "True, bcoz we actually starts to rethink every opportunity, and actually not taking it a lot of times!"
        },
        {
            "author": "@rohithb5041",
            "text": "It is not about the safe place, by the way what do you mean by a safe place? We need to fight against the “system” which allows these kinds of brutal things."
        },
        {
            "author": "@Kolkatar_meye",
            "text": "If only men thinks like this 😢 Ganesh it is so so true ... They way every parents of a girl feared right now is unimaginable ."
        },
        {
            "author": "@user-um8vg3lf7e",
            "text": "I will tell u something I am from city and when some of my cousins come here they feel cities are updated they need explore themselves as they have never seen this environment they ignore red flags are become desperate in a toxic way they do things even as city ppl we wouldn&#39;t hence they end up in these rapes and all ........and then blame the city unnecessarily whereas they don&#39;t change themselves"
        },
        {
            "author": "@krishindian...",
            "text": "Good one"
        },
        {
            "author": "@MrSandy28",
            "text": "people will and must realise what the actual problem is. the problem is the law itself. I&#39;m not totally condemning the law as it creates another set of problems in itself, but people must realise that it&#39;s the weakness of the law that leads to such problems. and also that it&#39;s in the hand of the people that they can change any weak / bad law through their chosen law makers"
        },
        {
            "author": "@jenelleambience2890",
            "text": "Instead of make safer place for women why can’t we pass the strict and stringent law with capital punishment for those who gets convicted. WHY NOT?"
        },
        {
            "author": "@jenelleambience2890",
            "text": "So you mean to say rape only happens in urban and not in rural areas?"
        },
        {
            "author": "@Ignaz.Semmelweis",
            "text": "Big national media channels 🤡 Individual journalists/podcasters 😎"
        },
        {
            "author": "@dimbureddy",
            "text": "BRO i want to tell you one thing that...&quot;&quot;&quot;it&#39;s all about the mindset and dare that a girl or women willing to take challenges rather than house arresting ourselves and be a another kind of domestic violence victim..."
        },
        {
            "author": "@abishekwillie",
            "text": "Through policy or statement <br><br>We can&#39;t make a difference <br><br>When we take action against and fight for it"
        },
        {
            "author": "@tassarunnessa4904",
            "text": "Finally someone said it"
        },
        {
            "author": "@edytha2090",
            "text": "I agree im not sending my daughter for studies or job to any of the metros.. its not Just about the crime its about the government&#39;s protecting the criminals... The crime is hard enough but then to see the Power that be protecting the criminals damn its enough"
        },
        {
            "author": "@binayakbanerjee4238",
            "text": "Wrong again that&#39;s the instant fix. That cannot be the long term solution."
        },
        {
            "author": "@docexam",
            "text": "No woman health worker. Hopefully then 85 % work force gone. Most toppers gone."
        },
        {
            "author": "@Sunshine19956",
            "text": "Everyone should have to bear the responsibility"
        },
        {
            "author": "@Sunshine19956",
            "text": "It&#39;s comes true not only by one person but also with everyone in the world"
        },
        {
            "author": "@Sunshine19956",
            "text": "Everything is saying but the same thing is not put into action that makes between unreal to reality"
        },
        {
            "author": "@DevGohil-i5c",
            "text": "If you know hindi language you can talk in Hindi bro not everyone understands English language saamne bethe Ranveer KO bhi aata hai hindi Please"
        },
        {
            "author": "@BlaBla-xu6yw",
            "text": "142 bn people! What is the solution for this type of situation...<br><br>Not vague answers like make the work place safe ..i mean proper steps, guidelines and punishment..."
        },
        {
            "author": "@nits36901",
            "text": "Educate boys ….long term solution"
        },
        {
            "author": "@Shreds1016",
            "text": "If our country can put this much budget in the defence sector then of course the country also has a capacity to do something for women&#39;s safety. <br>Also, boy&#39;s families should focus on giving more &#39;sanskar&#39; to them since their childhood. Schools should also focus on this type of moral education too."
        },
        {
            "author": "@msan8888",
            "text": "Well said Ganesh!<br>Also it&#39;s an eye-wash to side track public attention from a much more deeper problems that those in power cannot face.<br>Unemployment (leading to crimes), International Relations, Poverty deaths, many more.<br>The Power is all they need, for that they divide us or divert our attention based on religion, caste, crimes against women, scandals of popular people not paying those in power to cover them up, regional disputes (north vs south), soldier&#39;s death in the borders, student suicides, business men frauds, and last but not the least fan wars between movie actors fans.<br><br>The list of scapegoats is endless."
        },
        {
            "author": "@babakela8634",
            "text": "The most illogical reason<br>😵‍💫"
        },
        {
            "author": "@srikarnv9834",
            "text": "Recently in mumbai, a posh lady sexually abused and killed her servant&#39;s minor aged son, why no one was talking about that.also we observed that a lady ceo killed her own 4 year son for alimony against husband. In india out of ten reported rape cases 7 are hoax and baseless. So when police took up 8th case they won&#39;t take it serious. So it is women themselves who&#39;s misusing the laws and make it hard for other women. Let&#39;s make gender neutral laws and strong judiciary. A men had spent 20 years in jail for fake rape case. All his family perished in meantime. Focussing on woman development won&#39;t give any desired results. Ethics should be taught to both genders."
        },
        {
            "author": "@mekalasuhasreddy3653",
            "text": "100% right"
        },
        {
            "author": "@devanarayans5131",
            "text": "stupid rhetoric these economic issues never really affects high population countries, there is always someone will happily do the job.."
        },
        {
            "author": "@pubginfo7357",
            "text": "💯 it effects so much economy and push our growth move backwards"
        },
        {
            "author": "@SurajKumar-ln8ij",
            "text": "They are literally half of the population and still being underestimated and oppressed by other half."
        },
        {
            "author": "@rahulmandru3890",
            "text": "Do you think it will play a major role in other country companies who wants setup in India /tourism..they might state out that hey India is not safe we don’t want to travel or we don’t want to setup our company there…in my belife yes"
        },
        {
            "author": "@stanleyj9839",
            "text": "I like how he always stick to the economical aspect and he always makes sense.<br>This less about the act and more about what precedent it remains."
        },
        {
            "author": "@karthikpuvvula",
            "text": "No one really cares. This victim is a doctor, so a lot of people are protesting. No one cares about the remaining victims who didn&#39;t make it to the headlines. Also stop talking about productivity of women. Family is not just about productivity of women. Housewives are also productive. They are raising kids and taking care of family. They keep the family structure strong. Also why should everyone come to cities ? Why can&#39;t we make our villages and towns prosperous ? Why can&#39;t we live in villages and earn a decent living ? Stop promoting cities as the ultimate destination. Also why talk only about women ? Men lives don&#39;t matter? Since there is a rape case in the news, you are suddenly concerned about women&#39;s safety ? After a month, we will forget about this as there will be new headlines. It&#39;s so easy to fool people by playing some emotional background music."
        },
        {
            "author": "@Enigmatichuman",
            "text": "So true majority of Indian womens families worry if they should allow their daughters to go far from home to work n most of them can&#39;t go and avail opportunities bz of incidents like these"
        },
        {
            "author": "@akj616",
            "text": "Loved it"
        },
        {
            "author": "@sharmilasinguru11",
            "text": "Okay the question is... How to make the place safer for women?"
        },
        {
            "author": "@susmitachakladar6429",
            "text": "I am born and brought up in kolkata. I had big dreams since my childhood.. My father got me admission into a girls college for safety. After my father&#39;s death, my mother don&#39;t allow me to go the even other states out of fear, she says.. With time all my dreams and ambitions are fading away and losing all hope.. I was diagnosed with chronic depression and anxiety disorder, low self-esteem, also stopped seeing people much. Where I am seeing my classmates excel in career, travelling abroad, who got lower marks than me and here I am struck in a vicious loop. Even, growing up in a city in an educated family I don&#39;t feel safe among men be in workplace or educational institutions."
        },
        {
            "author": "@dipikeshkumar1538",
            "text": "Those who are saying not understanding it.<br><br>No its not about replacing men with women instead it is adding men with women. As men starts company and give employement to the thousands of other people same will women do. Thats result in creating lot more oppurtunity for everyone and when this will happen per capita income will also increase and economy will boost"
        },
        {
            "author": "@adityaojha3856",
            "text": "I think it&#39;s old podcast with ranveer am I right"
        },
        {
            "author": "@skinny_bruh_shorts",
            "text": "When our elders told that girls should stay at home,they were actually foreseeing a future filled with horrendous acts"
        },
        {
            "author": "@Anurag_sharma_2_3",
            "text": "Its simple brother when crime is high economics investment goes down.<br>And if crime against woman is hight it will effect the gander equality gap. The % of woman participation will goes down in future as well as it will lead to lower downs the privet Consumption means lower growth, lower capital formation, lower human capital formation, over all it will effect your country at macro level"
        },
        {
            "author": "@debikabhattacharya3029",
            "text": "How right your thoughts are."
        },
        {
            "author": "@kollurubharathsimha539",
            "text": "Even I stopped my sister to go to Hyderabad . Even though salary is high . Because we know salary can be earned but person . If something happens no we can&#39;t take that risk . Atleast I&#39;m happy she is earning more that me living with us . If any disturbance happen in Visakhapatnam I will be able land on any place in 30min ."
        },
        {
            "author": "@divyasworld.0-1-2",
            "text": "Never thought in this perspective but it’s absolutely true in many ways 👏."
        },
        {
            "author": "@yashbansal8091",
            "text": "You are just beating around the bush. In villages, mostly crimes are not even reported. So how economic opportunity is assured for a woman there ? And it is a very general statement to say, “Make workplace safe for women.” But how ?? <br><br>I feel now it is high time to blame the judiciary who takes so much time to solve a single case. <br><br>For example, Nirbhaya 2012 case was solved within 7 years, which was actually an open and shut case. <br><br>Leave rape cases. This incompetent Indian judiciary took 4 years to hang Kasab in 26/11 terror attack case which was a case of National Security. <br><br>Now what did the SC do related to Kolkata case ? A Special Task Force ? Bullshit….<br><br>We Indians can’t criticise these judges openly as they will charge you with Contempt of Court and they talk about being protector of democracy. <br><br>Courts need to increase their working hours and less vacations. Read NITI Aayog report of 2018. Judges need to stop acting like “Sarkari babus” and start working their ass off for atleast 10-11 hours a day."
        },
        {
            "author": "@MrBiswas123",
            "text": "A country whose women are not happy will not prosper"
        },
        {
            "author": "@shivang999",
            "text": "Very well said. It&#39;s indirect proportional to our economy and nobody understands."
        },
        {
            "author": "@divyangdhamelia4118",
            "text": "Sir, you gave a very nice and genuine point. Thank you"
        },
        {
            "author": "@ajaypathak911",
            "text": "Ok, now tell me 1 country with more than 35 Crores of population(just 25% of India), where no rape happens.?<br>The point is rape is a crime and crime will always happen by criminals, what we can do is fast and big punishment after the crime happens, and also preventive measures by women to not be in unsafe places at unsafe time."
        },
        {
            "author": "@yellowNred",
            "text": "It’s a shame that this has to be said in this day and age. Why? The laws and the punishment is not severe enough. The culprits and the law makers and enforcers including the judiciary are all complicit in one way or another. Shame on all political parties and the so called leaders. Create a ministry to handle only such cases across India. Publish the database."
        },
        {
            "author": "@joydeepghosh460",
            "text": "The most valid point ever made.."
        },
        {
            "author": "@adinaidude",
            "text": "Bro thinks Villages have no rapes. Priviledge talks, reality suffers"
        },
        {
            "author": "@Sunny-wi2jw",
            "text": "<a href=\"http://www.youtube.com/results?search_query=%23who\">#who</a> are we to make place safer for women... Women- Mother if can keep us safe - they can they will.. they will do.. make safe for us... We have to belive in them ..no matter how small village they come from.. schools like think school has to make them belive that they can ..<a href=\"http://www.youtube.com/results?search_query=%23fight\">#fight</a> back it&#39;s just an understatement for every girl to a woman.. economy of the country ...Ganesh this will go on.. but a message u give inspires .. so no reasons .. let them do it ...they are more powerful, that&#39;s why we refer to a country even dominated by a male society, as our motherland...<a href=\"http://www.youtube.com/results?search_query=%23ganesh\">#Ganesh</a> your school has changed lives ..<a href=\"http://www.youtube.com/results?search_query=%23lets\">#lets</a> do it.."
        },
        {
            "author": "",
            "text": "Sir <br>I did not get how it would boost the economy .You are not generating new opportunities. You are just replacing with other gender (who will be less effective considering social , family , body burden )<br>Second, a working woman is not going to marry an unemployed man.But the opposite is not the same case.<br>This means it will infact wide the gap between working and non working more.<br><br>Lastly, the generation of employment is more important from an economic perspective irrespective of gender that is going to work.<br>Need is to create jobs that are specifically for women only.<br>Replacing Nirmala Sitaram with Manmohan Singh will not increase per capita income of a country. 😅<br>Social awareness and realisation is a must.<br>A criminal committing crime will never ever think of the country&#39;s economy before committing crime."
        },
        {
            "author": "@an.....",
            "text": "Simply control your lust. Rules and regulations are for common people not for the rich and politicians."
        },
        {
            "author": "@pappumahato1178",
            "text": "❤❤❤ Different perspective"
        },
        {
            "author": "@MukeshRane08",
            "text": "Ye thoda zyada ho gaya.. economy and all. Nirbhaya case was more gruesome, how many women did that stop."
        },
        {
            "author": "@shubhamdeshmukh8395",
            "text": "Well made point, but I still think that&#39;s the last thing you would consider when thinking of why women safety is important. <br>I think it is quite basic basic thing that every person should feel safe and that&#39;s the bare minimum. All the economical and other aspects are secondary."
        },
        {
            "author": "@dhanashriwagge9392",
            "text": "Very true!"
        },
        {
            "author": "@Journey_of_Knowledge",
            "text": "Excellent 😊Please forward to all, n help change everybodies mindset. Make place safer for women"
        },
        {
            "author": "@letitgo151",
            "text": "Ok what about misuse of law by women just for defamating a man"
        },
        {
            "author": "@ashishsalunkhe6499",
            "text": "Many inputs from surroundings play an important part for this such as what each person is interested in consuming nowadays.Most of it is sexual content and with an imprint on mind  of this, a person keeps deep thinking about it,keeps admiring it around him in the society(Admiring the curves of a women) and eventually it happens in one&#39;s mind and then in <a href=\"http://actual.porn/\">actual.Porn</a> and other media(movies,web series) has  objectified womens.What we can do is to have spirituality in our life in order to have control over our Indriyas and the best way to do this is chanting name of a diety as per your interest.<br>Honestly,many of us have watched porn and cannot deny that we feel like doing what we see and try to extract pleasure(Short term) from the act.<br>By chanting name always on daily basis our consciousness rises,mind becomes pure from the previous dirt and we get connected to supreme source of Pleasure(The almighty) and  body doesn&#39;t demand for the short term pleasures and mind becomes incharge of the body instead of the indriyas and ensures righteousness.<br>Please understand that each act is done in order to seek pleasure and rape is also one of them.<br>Nowadays casual relationships for sexual pleasure are going on increasing and we need to stop us and even our friends,family members from it.What we directly or indirectly are supporting also plays an important part to form a society.<br>Yes,i agree that the rapist must be treated strictly so that other&#39;s will be afraid to the core to do such act.<br>That is what i have understood myself as a human and my observations in the society.I am doing my part by chanting a name daily.People aslo need to read and understand bhagwad geeta and inculcate it&#39;s teaching in our day to day life and can also understand each person&#39;s life purpose,soul,mind,body,heart(feelings) and indriyas.<br>If we really want to work over this and if i can do anything in it,please connect on ashishsalunkhe79@<a href=\"http://gmail.com/\">gmail.com</a>"
        },
        {
            "author": "@ankitkaser",
            "text": "It&#39;s issues of handling emotions in mind vs reality coz society always differentiate both gender and it occurs eventually in such things by lower self steem male"
        },
        {
            "author": "@View_analytics",
            "text": "Its not only about making place safe for women&#39;s... its also about making mentality safe towards women&#39;s"
        },
        {
            "author": "@adhavanerode2164",
            "text": "Crimes do happen in small towns and villages. Thes news are not spreading much. Especially in case of underprivileged. Why do people think that productivity is there in cities alone? Big cities are not well maintained. Decentralisation is very much required. Cities are frustrating 😢"
        },
        {
            "author": "@shivendrasingh4631",
            "text": "True this will reduce woman participation in the workforce. Anyways it is low compared to China and other countries. If we aspire to compete we have along way to go."
        },
        {
            "author": "@karthikkumar5822",
            "text": "What&#39;s the long term solution? Educating from Adolescent males. All those alpha male movies are making a part of the psyche in developing adolescent males."
        },
        {
            "author": "@CalmSoul.514",
            "text": "Extremely Right... So many have same doubt if you are not safe in your workplace where will you be... Why will you go to work if it&#39;s not safe..."
        },
        {
            "author": "@SuperSaiyan-tr7fz",
            "text": "I agree, I think schools should make self defense training mandatory.<br>And, schools should stop treating boys and girls like they are allergic to each other from very young age. Interactions between all students should be equal."
        },
        {
            "author": "@VibewithMadhuri",
            "text": "This Kolkata doctor case has impacted so much that even in WhatsApp group chats... The people mindset is now like... India is not a safe country to live in... As if every other part of a foreign country is so safe for women"
        },
        {
            "author": "@Magic_of_Meghana",
            "text": "Even if it does not effect economy....please make a safe space for girls... because we deserve it🥺"
        },
        {
            "author": "@chitragiridhar6222",
            "text": "This is absolutely true. What I guess is happening is - there are laws, but execution of the laws is not proper. ( corruption is the culprit) We need to fix that 🙏🏻🙏🏻"
        },
        {
            "author": "@Ananya81253",
            "text": "True but why should everyone aspire to be in a big city ? Why can’t villages have good life ?"
        },
        {
            "author": "@RoshIdeations",
            "text": "Generic bla bla, every one knows what... talk about &#39;HOW&#39; and the execution plan!"
        },
        {
            "author": "@morphine231",
            "text": "Swift Punishment like middle east"
        },
        {
            "author": "@Knkteja1897",
            "text": "Perfectly placed💐"
        },
        {
            "author": "@surajkashyap5648",
            "text": "I think one solution is to increase women participation in job work especially in parliament make it to 45-50%"
        },
        {
            "author": "@kaigen96",
            "text": "Exactly international visitors getting hooked by the stories happen oftenly"
        },
        {
            "author": "@SmallChangeLiving",
            "text": "Narayana murthy sir from India will also speak for this... He is a legend who looks for every single opportunity to be spoken out and make India wealthier than ever in the history under gcc. So we can seek leaders help for this too.."
        },
        {
            "author": "@vidhyaramesh6733",
            "text": "Make the place safer for everyone, everywhere."
        },
        {
            "author": "@JourneyofGypsySoul",
            "text": "I don’t know if you will see this comment but I have to tell something! <br>Girls, women who leave their house and go to Bombay for career, house hunting is a nightmare! Especially for single girls from small towns! It’s useless what education you have taken and how hard you have you have worked. People just casually on the face say that “ these small town girls come to Mumbai and get into bad business and become call girls and ruin our society’s name.”   I have had such horrible experiences in Mumbai. Showing them I work at prestigious company, offer letter, my degree certificate nothing worked in few cases! I just hate how they view women who come from small towns. From loving Mumbai to now I hate Mumbai so much!"
        },
        {
            "author": "@AjaySharma-ul6ow",
            "text": "And also the women who are working till late everyday in the office despite this reality are putting their life&#39;s at risk everyday. Offices should let the women leave early before it gets dark to ensure safety . The women can then work from home or can reach office early in the morning ."
        },
        {
            "author": "@DiabloNemes",
            "text": "What do u expect will happen to u if u try to go against a mafia, drug smuggler ? U will face consequences….she tried to expose them … plz think before taking any step"
        },
        {
            "author": "@evensaj",
            "text": "When wrestlers were assaulted and followed by indifference of govt , the same logic would hold and parents wont send thier kids for sports, but no youtuber spoke that time 😅"
        },
        {
            "author": "@joelabishek7585",
            "text": "Punishments has to be wrost . Forget all the human rights"
        },
        {
            "author": "@JUSTSEEAROUND",
            "text": "Ban Porn completely and Ban obscene content on social media or any kind of entertainment facility even from the Indian Internet Infrastructure ...Banning not just on paper but in Real...even pirated content shouldn&#39;t available for anyone....that will make change in our society...<br><br>And Mark my words the change starts with the very next minute..."
        },
        {
            "author": "@shreyakhandal9163",
            "text": "These people were sleeping before Kolkata case."
        },
        {
            "author": "@ChandraShekharreddy-h1y",
            "text": "Its absolutely correct sir"
        },
        {
            "author": "@sonu40241",
            "text": "Very nicely explained &amp; with that seriousness on the face for a serious situation. Hats off Ganesh sir🙇"
        },
        {
            "author": "@uvicbe04061989",
            "text": "So that doesnt mean women are safer in their villages . They are not safe in most of their own rural places , neither at their homes and relatives circle. Just that it happens in Mumbai,  it gets the media attention."
        },
        {
            "author": "@ranjithranjith2552",
            "text": "I think I have heard these lines before Ganesh Bhai,but that&#39;s the only way to protect of women and production in economy 😢"
        },
        {
            "author": "@max78966",
            "text": "another really good viewpoint added to my prep"
        },
        {
            "author": "@saravanakumar-yv2sh",
            "text": "One more possible solution - move workplace to villages , so that not many people need to reach metro cities"
        },
        {
            "author": "@Entertainment_kavala",
            "text": "So finally Ganesh learn from ranveer and applying his them. Eg:- machine gun method"
        },
        {
            "author": "@imfromparalleluniverse4504",
            "text": "Any kind of crime just hinder the economic growth and more than social issue it is human issue"
        },
        {
            "author": "@aru2785",
            "text": "Wow what you said is 💯 true . 1 yr back I got a pg seat in Delhi hospital , monthly stipend - 1.24 L ( for me it is very big ) but I prefered to stay in my own  state , where the stipend is less  and I got some medicore medical college, because of only security issues ."
        },
        {
            "author": "@chinmaykamalapurkar16",
            "text": "Mamata is responsible for all of this unsafe environment she needs to be punished 🤬"
        },
        {
            "author": "@BilalKhan-cq6mn",
            "text": "Out of every harm......the best he could point out was economic harm. Wow🤌"
        },
        {
            "author": "@kannanayagam6915",
            "text": "how to do it ?? what should i do for it ?"
        },
        {
            "author": "@randell07",
            "text": "And on an even grander scale, why should women work? Have we not learned anything from the extinction crisis all these developed countries are facing?"
        },
        {
            "author": "@randell07",
            "text": "All of the women population went on a strike on a well developed country and the economy wasn’t impacted rather they had better experience."
        },
        {
            "author": "@kushajagarwal9761",
            "text": "Wow, nice msg. Thats what i love about think school"
        },
        {
            "author": "@sravyaalapati1878",
            "text": "I like how intense and genuine he was.....I follow u sir ....thanks for the great content......"
        },
        {
            "author": "@pranavgawane9571",
            "text": "How ? Is the real question. And none of the things circulating on the internet would work that&#39;s why those things are not in place already. What&#39;s the real solution?"
        },
        {
            "author": "@smarthelp01",
            "text": "Make place safer for women ❌<br>Make INDIA Safe for women ✅"
        },
        {
            "author": "@Shanth-u2z",
            "text": "Very true"
        },
        {
            "author": "@chandrachoodR",
            "text": "Great perspective"
        },
        {
            "author": "@manthan5867",
            "text": "The more educated &amp; so called prosperous we are becoming as a society the more Rapes are happening. <br><br>Its the problem of education"
        },
        {
            "author": "@rohanrathore1994",
            "text": "Not only Women..Make Workplace Safer for All..!! 🙏"
        },
        {
            "author": "@PrashantKumar-cn1fj",
            "text": "Problem :- Rape<br>Solution :- Make strict laws like Dubai or Singapore where  there is death penalty for rape and target killing (like Kanaiyalal) crime."
        },
        {
            "author": "@Opshorts623",
            "text": "Being a political hons student I never realised that it will indirectly affect the economy of a country.<br>This is absolutely true madly respect sir"
        },
        {
            "author": "@jaibharath9591",
            "text": "System failure &amp; policies also worst"
        },
        {
            "author": "@KK-uo4nu",
            "text": "The fastest way to reduce this issue by providing street lights and cctv cameras everywhere."
        },
        {
            "author": "@shaiquerahman2063",
            "text": "Such a stupid argument, a lot of crimes can be justified bcuZ of economic arguments so shud that be ok post that"
        },
        {
            "author": "@NerdCentral_",
            "text": "Leave the country"
        },
        {
            "author": "@abhishekkumar6301",
            "text": "Yeah, absolutely correct 👍"
        },
        {
            "author": "@mohankrishna3597",
            "text": "Justice for 74% fake rape cases on men .<br>Women making fake cases aren&#39;t punished seriously then why rapist must be punished seriously .<br><br>Source : NCRB not from jumla or what&#39;s app University."
        },
        {
            "author": "@baijusharma6027",
            "text": "India needs to make strict law and fast track court. Like Arab countries."
        },
        {
            "author": "@raveenasachdev4231",
            "text": "Omg someone made an intellectual point.👏👏"
        },
        {
            "author": "@shaileshsivakumar9622",
            "text": "What a thinking ❤"
        },
        {
            "author": "@sleepingiv",
            "text": "50 % population is under-utilised.<br><br>Productivity ⏬."
        },
        {
            "author": "@rohangera2374",
            "text": "Is this the Machine Gun strategy, Ranveer talks abt? 😅"
        },
        {
            "author": "@user-db1mx3kq6x",
            "text": "mind needs to be safer for women, places would be automatically safe ."
        },
        {
            "author": "@boonedocksfl2012",
            "text": "Trust me, you don’t want a society where you push all women to work and have careers."
        },
        {
            "author": "@gsberwal",
            "text": "Yes this is absolutely correct 💯 <br>Recently one of my friends sister was denied to go to Delhi even for college studies. Just because of all such incidents in news that we are hearing nowadays."
        },
        {
            "author": "@priharahj5515",
            "text": "i dnt know when women who hv son understd this and raise good men"
        }
    ]
}