{
    "videoId": "wqxR8Uh3D5o",
    "totalComments": 44,
    "comments": [
        {
            "author": "@BilalKhan-cq6mn",
            "text": "We will tax<br><br>And tax more<br><br><br>And tax even more"
        },
        {
            "author": "@akbarjalaluddin3451",
            "text": "Mam no one is stopping development but please have some mercy on middle class you are the people that pay their taxes the most part of the tax recovery"
        },
        {
            "author": "@alexphilip6004",
            "text": "Useless minister only knows how to tax people"
        },
        {
            "author": "@samprithpatel6578",
            "text": "Ufff fed up with this fancy terminology"
        },
        {
            "author": "@GGGGGGGGGS",
            "text": "And We are all idiots..."
        },
        {
            "author": "@AbbyRCToys",
            "text": "I can&#39;t  tolerate  Nirmala Sitharaman. <br><br>She and Modiji are the reason Middle class is suffering"
        },
        {
            "author": "@infinitybrothers5921",
            "text": "Why is India&#39;s GDP per capita so low? If India&#39;s GDP per capita remained low like this then India will always be a poor country"
        },
        {
            "author": "@nandus1",
            "text": "Simple increase tax from current 50% ( both direct n indirect including) to 70% and start building flyover n roads  and help netas get 30 - 40% comission on these projects and don&#39;t give states it&#39;s share of GST, India will become world leading economy <br>Also please do not talk only about GDP also talk about increasing per capita income"
        },
        {
            "author": "@ABCXYZ-vg9gh",
            "text": "Yes very well laid out indeed. 😂😂"
        },
        {
            "author": "@vathsalanagaraju",
            "text": "If you collect so much tax , how will it improve economy?"
        },
        {
            "author": "@MasterLoki64",
            "text": "&quot;Consumer end of agriculture products is important&quot; - This interview<br>&quot;I don&#39;t use onion, so I don&#39;t care about onion price&quot; - old interview"
        },
        {
            "author": "@suryakiran4722",
            "text": "her vision is to make the middle class people completely drained out and move them into poor category"
        },
        {
            "author": "@rushikhadiya4965",
            "text": "So why Indian government ban the export of produce ..?."
        },
        {
            "author": "@prabhuar1989",
            "text": "Farmers to earn more by exporting quality products and selling inferior products in domestic markets whereas benefiting from schemes like MSP and other tax benefits which is bared by the domestic middle class !! Cant get more stupid than this !!"
        },
        {
            "author": "@youtubehandlefreethought",
            "text": "Make tax mandatory even for the lower class, in terms of their income and tax the farmers, give relief for the middle class, so they can spend the extra money by buying more in India from India.<br><a href=\"http://www.youtube.com/results?search_query=%23nirmalasitaraman\">#nirmalasitaraman</a><br><a href=\"http://www.youtube.com/results?search_query=%23modiji\">#modiji</a>"
        },
        {
            "author": "@SurajKumar-ln8ij",
            "text": "Wel dont even ask her about ungodly taxes on middle class."
        },
        {
            "author": "@noclicheplease",
            "text": "Her vision is to squeeze the middle class as much as possible with taxes."
        },
        {
            "author": "@mukeshKumar-pw2oc",
            "text": "you read comments everyone is talking about different problems🤧<br>in reality : i will pay money so my documents will be ready before time,<br>i will not provide my actual income details so i would get more benefits, <br>i will throw out trash in public places who cares, I won&#39;t follow any traffic rules,i will find a way to not pay money even if i can pay that money ,<br>welcome to india🤡"
        },
        {
            "author": "@lokeshjain2444",
            "text": "Population control bill should be top most priority."
        },
        {
            "author": "@DevSingh-p7s",
            "text": "She is telling you lie"
        },
        {
            "author": "@bijuldesai3097",
            "text": "What about pathetic tax base less than <br>3 % &amp; freebie Doles"
        },
        {
            "author": "@sameerchaudhary5033",
            "text": "Talk about per capita income not gdp.<br><a href=\"http://www.youtube.com/results?search_query=%23worstfinmin\">#worstfinmin</a>"
        },
        {
            "author": "@s.chiranthgowda7461",
            "text": "If we want to develop our country you should reduce tax on manufacturing sector band develop our manufacturing sector"
        },
        {
            "author": "@mrstrange218",
            "text": "India should focus on becoming the 2nd or the largest economy. Japan is already declining and Germany isn&#39;t that far."
        },
        {
            "author": "@kumarKumar-id2zy",
            "text": "Resignation kab derahe hoo puchooo"
        },
        {
            "author": "@Techloves",
            "text": "How can u invite sucha chu+ýa apratim for a podcast"
        },
        {
            "author": "@SamudraMishra-yp4gc",
            "text": "East Asian countries had double digit growth, while they transformed from lower middle income country to upper middle income country, and they all started with India.  We are still happy with 7% growth rate, and stuck with a foolish mindset of becoming developed after 100 years of independence."
        },
        {
            "author": "@puneetsehgal5049",
            "text": "Middle class ke bare meh kuch"
        },
        {
            "author": "@behuman3869",
            "text": "You need to protect yourself from this information war around the world. Make your own social media to protect the country."
        },
        {
            "author": "@an.....",
            "text": "I don&#39;t know which country goes for the largest economy with more than 50% of its people still being poor and feeds on 30% population income. Really a BJP style thinking. Get control over the media, spread fake information and declare anti nationalist who ever say anything. I know there will be millions of people who can prove that she is right."
        },
        {
            "author": "@sleepingiv",
            "text": "Poverty of Ambition."
        },
        {
            "author": "@arpanabinaswar1811",
            "text": "Lol Atmanirbhar Bharat When you Refuse to place Orders for Indian Equipments in Defence Sector and Sanction money for R&amp;D all the while begging infront of US for TOT.<br>You have got Kaveri that was able to Generate 75KN Thrust in First Attempt but you are yet to sanction Funds for further Development since Congress cut down the funds in 2013.<br>You are going to buy Strykers when you have WhAP based system made by Tata ( Gen 1 ) and Mahindra ( Gen 2 )<br>You are purchasing Rifles from Russia which are ASSEMBLED in INDIA even when you have Companies like SSS Defence which are exporting weapons.<br>You have yet to sign orders for LUH , LCH , ATAGS...etc<br>Sorry to Say Nirmala what you are planning to acheive is not ATMANIRBHAR BHARAT but SCREWDRIVER BHARAT"
        },
        {
            "author": "@rahulrahangdale1787",
            "text": "Agriculture sector needs investment"
        },
        {
            "author": "@Gvkrish52",
            "text": "Increase tax to get 5 trillion economy, forgot people ❤️"
        },
        {
            "author": "@vinayjoshi2436",
            "text": "And tax everyone"
        },
        {
            "author": "@swapnilnehe8948",
            "text": "Nation standing on graves of middle class🎉..Congratulations Bharat you got it"
        },
        {
            "author": "@sarathchandra6729",
            "text": "Largest economy by shitting in our country with no reforms n sustainability. Loot the middle classes in the name of taxes"
        },
        {
            "author": "@satish4cs",
            "text": "Having the economic disparities at peaks, we shouldn&#39;t aim to become a developed nation. Poor and middle class couldn&#39;t even live in thier own country..please understand.. don&#39;t chase positions...pls 🙏🙏🙏🙏"
        },
        {
            "author": "@priharahj5515",
            "text": "right time to hustle"
        },
        {
            "author": "@khushpanara124",
            "text": "I would not even listen to that person whose first priority is to get third largest economy and not development"
        },
        {
            "author": "@allanbenoy6092",
            "text": "Pay tax that&#39;s only use she knows"
        },
        {
            "author": "@dhirenkumarsahoo6050",
            "text": "Hit a like to exempt from tax"
        },
        {
            "author": "@Jaatbhai23",
            "text": "Largest economy doesn&#39;t mean to development!!! Please understand"
        },
        {
            "author": "@jackiecooper9439",
            "text": "Like or pay tax!! 🔫"
        }
    ]
}