{
    "videoId": "bwcQCIUxzak",
    "totalComments": 24,
    "comments": [
        {
            "author": "@user-tu2vp7xz6j",
            "text": "I live in Germany. I can understand what he’s trying to say. In my opinion, it’s not like Europeans are getting physically sick all the time. It’s more about their mental health. People are stressed/depressed for some reason. Indians are mentally much tougher."
        },
        {
            "author": "@pratikmukherjee5914",
            "text": "Probably a good depiction of what will happen if majority of work in the world is automated via AI or anything else. People will be more comfortable and then get sick :)"
        },
        {
            "author": "@RD-zf7dv",
            "text": "Bro please not so much flash cuts in shorts,one it&#39;s irritating two distracting"
        },
        {
            "author": "@Heymon17",
            "text": "The music and video don&#39;t synch. 😂😂"
        },
        {
            "author": "@kirangowda9318",
            "text": "@ThinkSchool why do you keep so fast, even we can&#39;t understand that fast video"
        },
        {
            "author": "@rjpradp",
            "text": "Let&#39;s go Europe and suffer from comfort."
        },
        {
            "author": "@arunsubramanian7949",
            "text": "India’s problem is- a lot of our population is stuck at the bottom. Getting piped water is a dream, inspite of surplus electricity- we still have power cuts, inspite of ability to build a metro or have buses- we still have traffic bottleneck. So a lot of our time is wasted on doing these chores and we cannot aspire to go further."
        },
        {
            "author": "@not-human9264",
            "text": "Well I think paying without a job is a problem ."
        },
        {
            "author": "@sans1684",
            "text": "This is wild truth!"
        },
        {
            "author": "@misakirachu",
            "text": "Why do I get the feeling, he&#39;s flexing the benefits European countries give their citizens"
        },
        {
            "author": "@Goldshot123",
            "text": "I do not agree. I think everyone should have a comfortable life, we should all aspire to it as a society. The push and competitiveness and uncertainty in nowadays life is throwing many people into situations where they pay too many taxes, havo no time for the family, are too tired to exercise, can&#39;t stretch their salaries enough in many cases and fall to a bur out or depression. Also the prescribed drugs nowadays are intensifying this problem.<br>Soon they will tell us we must work like the asians do, 6 days a week, 14 hours a day, with 2 weeks leave per year. Is that what we want, need or deserve? Of course not."
        },
        {
            "author": "@myspam9173",
            "text": "UTOPIA is a myth"
        },
        {
            "author": "@muttineni03",
            "text": "So thats why west comes up with Woke and identify gender bullshit."
        },
        {
            "author": "@MOHAMMED-gi2uh",
            "text": "I don&#39;t think so, most Europeans work not for comfortable life but to clear their bills. And western Europe and Eastern Europe are not the same in any terms"
        },
        {
            "author": "@karthiknadar8380",
            "text": "In india situation is very worse , we need access to good basic health &amp; education... Indians are demanding these two basic things primarily...."
        },
        {
            "author": "@Stardust_26",
            "text": "Capitalist explaining work life balance 😂.<br>This guy chose India for one reason.<br>&quot;Cheap labour&quot;.<br>And he is explaining europe&#39;s better work culture as a mockery. Because he can never exploit that system. In India he can.<br><br>And think school is presenting this as if he is explaining this as a greater philosophy or something 😊."
        },
        {
            "author": "@stratos9212",
            "text": "It is absolutely wrong to suggest that these apply to all EU countries’ citizens"
        },
        {
            "author": "@darekkinasz8933",
            "text": "He describes black and Muslim French lol"
        },
        {
            "author": "@McSivam",
            "text": "Welcome to life!"
        },
        {
            "author": "@thakurvijaita",
            "text": "The question to ponder is what are we working for? Better lives for our kids? So, are we in return making our kids weak. ."
        },
        {
            "author": "@mallikarjunchougule7318",
            "text": "Too much or too low of anything would destroy you. Keeping balance in check is the key. Extremes are easy, balance is difficult."
        },
        {
            "author": "@iamtherj",
            "text": "Bro I&#39;ll be frank!<br>The editing is super fantastic, but the KGF bgm isn&#39;t going well with this video and topic being discussed here!<br><br>Please observe very carefully how Ranveer&#39;s videos gets edited. Study carefully each and every thing he does. You have a potential to become one of the top creators in India<br><br>Wish you good luck 😄"
        },
        {
            "author": "@codewithsathya",
            "text": "Hard times create strong men. Strong men create good times. Good times create weak men. Weak men create hard times."
        },
        {
            "author": "@k.Choudhary5026",
            "text": "I am first"
        }
    ]
}