{
    "videoId": "YTBS_bH-Mm8",
    "totalComments": 41,
    "comments": [
        {
            "author": "@denosummer8789",
            "text": "Doing the worm while thinking &quot;it should have been me in the dress!!!&quot; Is crazy"
        },
        {
            "author": "@davidteasdale8163",
            "text": "Surely that&#39;s what u would want from ur best mate at ur wedding tho ❤️"
        },
        {
            "author": "@zealvalharriah9723",
            "text": "Even on Simon&#39;s wedding day, he can&#39;t get JJ out of his head 😆."
        },
        {
            "author": "@sleepybunny6834",
            "text": "Some ppl cant comprehend someone having fun without alcohol"
        },
        {
            "author": "@Rumym8",
            "text": "even if you dont drink youll drink for your friends wedding<br>(unless your a recovering alcoholic then obviously not)"
        },
        {
            "author": "@user-yl4jq6ut3r",
            "text": "That’s a good friend, he doesn’t drink but he will for simon"
        },
        {
            "author": "@furkanbozdag8198",
            "text": "So he does not drink but ends up being the drunkest?"
        },
        {
            "author": "@josez375",
            "text": "i cant wait till my brother gets married. I almost made my sister in law cry cuz i told her thank you for making me older brother happy, and giving life to my first niece.(i was also drunk when i said this, ig ima be the drunk uncle😭)"
        },
        {
            "author": "@thelegendaryalienteacher",
            "text": "Talia stole JJ&#39;s boyfriend"
        },
        {
            "author": "@Ms.Anonymous",
            "text": "That&#39;s actually so cute wait 😭"
        },
        {
            "author": "@Leonicole09",
            "text": "Jj is like that one amazing friend that doesnt have to be drunk but like acts drunk 🥹🥰"
        },
        {
            "author": "@Hungover_raccoon67",
            "text": "How come we still haven’t seen any pics of Harry at the wedding?"
        },
        {
            "author": "@GamingPokaru",
            "text": "Love the way in a previous sidemen reacts Simon said JJ was known in school as the worm kid. Probably done the warm to bring back some memories for Simon 😢"
        },
        {
            "author": "@nikkoanthony1342",
            "text": "I stopped watching these because the flute smh I can’t"
        },
        {
            "author": "@JohnJoe-sv5yy",
            "text": "He only had the tie around his head because he finally got to the laundrette with that silly bandana. Let loose until the dry cleaners called then he was back to his Prime! He works out in the flipping thing! It&#39;s bound to stink!"
        },
        {
            "author": "@BLX187",
            "text": "i always thought he was in the closet"
        },
        {
            "author": "@FH-wi6ek",
            "text": "Ksi is just a waste of space"
        },
        {
            "author": "@kunalgub",
            "text": "I can’t wait for JJ to get crushed at some point, his ego is disgusting tbh<br>I prefer moresidemen when it’s usually the other 6"
        },
        {
            "author": "@HeartbrokenHeartshooter",
            "text": "So Warrick gets a part in a movie and Disney get to use him to make money. They people in china do a show, and all that money goes to them. <br><br>Both are definitely being used. But I’d argue only one is selling out for other people’s profits…."
        },
        {
            "author": "@The_Curious_Cat",
            "text": "But didn&#39;t JJ ruined everything because reasons? I heard everyone was crying because JJ ruined the wedding because he didn&#39;t like the villa because the room was too small and then he fought Randolph&#39;s baby and then Randolph did a diss track on JJ and JJ dissed him and then Talia smacked him with a flying double feet kick and then Simon was crying and Talia was crying and everyone was crying and the internet raged because views or whatever."
        },
        {
            "author": "@aidanford4285",
            "text": "If you aren&#39;t crying at the loss of your best mate (their wedding) then are you really their best mate?<br><br>PS. To the absolute Karen&#39;s that spout &#39;tOxIc MaScUlInItY&#39; fuck off outta here you weirdos, it&#39;s partly a joke and partly a real thing watching your mate go from the stereotypical &quot;Bois&quot; lifestyle to being married. I&#39;ll sometimes miss the times we had as just the &#39;bois&#39; but I&#39;ll always be proud that they found their partner in life."
        },
        {
            "author": "@kye741",
            "text": "Everyone but Simon got the drunk text from. Ksi😂"
        },
        {
            "author": "@astralmirage6353",
            "text": "JJ sounds like what Terry would do in Brooklyn Nine-Nine"
        },
        {
            "author": "@SteezyKyung",
            "text": "To be fair, JJ’s slimmed down &amp; has been on a fitness diet for years now.  So the alcohol probably hit him like Logan Paul😂 Hopefully man had water."
        },
        {
            "author": "@mixedorange",
            "text": "Trust me alcohol is just an excuse. I don&#39;t drink but I party like crazy with my friends who drink. They often ask me how the hell are you more drunk than us without even taking a sip. If you can let go of your inhibitions without depeding upon alcohol you&#39;re good. All you need is good company, friends, food and just the right atmosphere"
        },
        {
            "author": "@nickcain3920",
            "text": "Did someone tape the wedding? It would be a dope video"
        },
        {
            "author": "@goatclips2222",
            "text": "I like Simon but does anyone else see the weird vibe Simon has with vik, Ethan Harry? I wasn’t shocked to hear that they wernt apart of his best men."
        },
        {
            "author": "@olivernewton8584",
            "text": "I remember when i used to rip my shirt off after i had my first night out at 18. How olds JJ again? Lol"
        },
        {
            "author": "@tnft95",
            "text": "no one will drink for a banger video anymore"
        },
        {
            "author": "@therazor514",
            "text": "JJ was supposed to be in that dress not Talia"
        },
        {
            "author": "@anthonymorosanu8555",
            "text": "jj drinking to numb the pain of watching simon marry someone that isn’t him"
        },
        {
            "author": "@jkasaunder228",
            "text": "You gotta love that &quot;doing the worm&quot; is a recognised level of being drunk world wide."
        },
        {
            "author": "@juicyg9355",
            "text": "Not the Flute - 🤓"
        },
        {
            "author": "@4422-",
            "text": "JJ turned up at the right time sounds like he made the wedding great for everyone"
        },
        {
            "author": "@nickbh15",
            "text": "Who was the best man?"
        },
        {
            "author": "@PiercerOvHeaven7",
            "text": "Getting rid of randy when?"
        },
        {
            "author": "@siitiixbpd7984",
            "text": "Jj knows he finally lost his best friend😢"
        },
        {
            "author": "@Anti-HyperLink",
            "text": "The alcohol is his blood.<br><br>Does JJ partake in other things?"
        },
        {
            "author": "@throwaway756",
            "text": "Even JJ played the goddamned flute at the Simon-Talia wedding."
        },
        {
            "author": "@oscaryee703",
            "text": "flute is growing on me"
        },
        {
            "author": "@theyab6173",
            "text": "Why is this ksi fella making everything about him"
        }
    ]
}